{
  "source_id": "bible_niv",
  "title": "New International Version Bible",
  "chunks": [
    {
      "id": "bible_niv_000001",
      "text": "talents, one talent for each base. 28They used the 1,775 shekels to make the hooks for the posts, to overlay the tops of the posts, and to make their bands. 29The bronze from the wave offering was 70 talents and 2,400 shekels.m 30They used it to make the bases for the entrance to the tent of meeting, the bronze altar with its bronze grating and all its utensils, 31the bases for the surrounding courtyard and those for its entrance and all the tent pegs for the tabernacle and those for the surrounding courtyard.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Exodus",
        "chapter_number": "38",
        "verse_numbers": "100",
        "verse_reference": "Exodus 38:100",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.834800"
      }
    },
    {
      "id": "bible_niv_000002",
      "text": "Samuel",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Ruth",
        "chapter_number": "4",
        "verse_numbers": "1",
        "verse_reference": "Ruth 4:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.847277"
      }
    },
    {
      "id": "bible_niv_000003",
      "text": "Samuel 21a 1David went to Nob, to Ahimelek the priest. Ahimelek trembled when he met him, and asked, “Why are you alone? Why is no one with you?” 2David answered Ahimelek the priest, “The king sent me on a mission and said to me, ‘No one is to know anything about the mission I am sending you on.’ As for my men, I have told them to meet me at a certain place. 3Now then, what do you have on hand? Give me five loaves of bread, or whatever you can find.” 4But the priest answered David, “I don’t have any ordinary bread on hand; however, there is some consecrated bread here—provided the men have kept themselves from women.” 5David replied, “Indeed women have been kept from us, as usual wheneverb I set out. The men’s bodies are holy even on missions that are not holy. How much more so today!” 6So the priest gave him the consecrated bread, since there was no bread there except the bread of the Presence that had been removed from before the LORD and replaced by hot bread on the day it was taken away. 7Now one of Saul’s servants was there that day, detained before the LORD; he was Doeg the Edomite, Saul’s chief shepherd. 8David asked Ahimelek, “Don’t you have a spear or a sword here? I haven’t brought my sword or any other weapon, because the king’s mission was urgent.” 9The priest replied, “The sword of Goliath the Philistine, whom you killed in the Valley of Elah, is here; it is wrapped in a cloth behind the ephod. If you want it, take it; there is no sword here but that one.” David said, “There is none like it; give it to me.” David at Gath 10That day David fled from Saul and went to Achish king of Gath. 11But the servants of Achish said to him, “Isn’t this David, the king of the land? Isn’t he the one they sing about in their dances: “ ‘Saul has slain his thousands, and David his tens of thousands’?” 12David took these words to heart and was very much afraid of Achish king of Gath. 13So he pretended to be insane in their presence; and while he was in their hands he acted like a madman, making marks on the doors of the gate and letting saliva run down his beard. 14Achish said to his servants, “Look at the man! He is insane! Why bring him to me? 15Am I so short of madmen that you have to bring this fellow here to carry on like this in front of me? Must this man come into my house?”",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Samuel",
        "chapter_number": "20",
        "verse_numbers": "1",
        "verse_reference": "1 Samuel 20:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.848819"
      }
    },
    {
      "id": "bible_niv_000004",
      "text": "Samuel 24a 1After Saul returned from pursuing the Philistines, he was told, “David is in the Desert of En Gedi.” 2So Saul took three thousand able young men from all Israel and set out to look for David and his men near the Crags of the Wild Goats. 3He came to the sheep pens along the way; a cave was there, and Saul went in to relieve himself. David and his men were far back in the cave. 4The men said, “This is the day the LORD spoke of when he saidb to you, ‘I will give your enemy into your hands for you to deal with as you wish.’ ” Then David crept up unnoticed and cut off a corner of Saul’s robe. 5Afterward, David was conscience-stricken for having cut off a corner of his robe. 6He said to his men, “The LORD forbid that I should do such a thing to my master, the LORD’s anointed, or lay my hand on him; for he is the anointed of the LORD.” 7With these words David sharply rebuked his men and did not allow them to attack Saul. And Saul left the cave and went his way. 8Then David went out of the cave and called out to Saul, “My lord the king!” When Saul looked behind him, David bowed down and prostrated himself with his face to the ground. 9He said to Saul, “Why do you listen when men say, ‘David is bent on harming you’? 10This day you have seen with your own eyes how the LORD delivered you into my hands in the cave. Some urged me to kill you, but I spared you; I said, ‘I will not lay my hand on my lord, because he is the LORD’s anointed.’ 11See, my father, look at this piece of your robe in my hand! I cut off the corner of your robe but did not kill you. See that there is nothing in my hand to indicate that I am guilty of wrongdoing or rebellion. I have not wronged you, but you are hunting me down to take my life. 12May the LORD judge between you and me. And may the LORD avenge the wrongs you have done to me, but my hand will not touch you. 13As the old saying goes, ‘From evildoers come evil deeds,’ so my hand will not touch you. 14“Against whom has the king of Israel come out? Who are you pursuing? A dead dog? A flea? 15May the LORD be our judge and decide between us. May he consider my cause and uphold it; may he vindicate me by delivering me from your hand.” 16When David finished saying this, Saul asked, “Is that your voice, David my son?” And he wept aloud. 17“You are more righteous than I,” he said. “You have treated me well, but I have treated you badly. 18You have just now told me about the good you did to me; the LORD delivered me into your hands, but you did not kill me. 19When a man finds his enemy, does he let him get away unharmed? May the LORD reward you well for the way you treated me today. 20I know that you will surely be king and that the kingdom of Israel will be established in your hands. 21Now swear to me by the LORD that you will not kill off my descendants or wipe out my name from my father’s family.” 22So David gave his oath to Saul. Then Saul returned home, but David and his men went up to the stronghold.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Samuel",
        "chapter_number": "23",
        "verse_numbers": "1",
        "verse_reference": "1 Samuel 23:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.849031"
      }
    },
    {
      "id": "bible_niv_000005",
      "text": "Samuel",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Samuel",
        "chapter_number": "28",
        "verse_numbers": "2",
        "verse_reference": "1 Samuel 28:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.849594"
      }
    },
    {
      "id": "bible_niv_000006",
      "text": "Samuel 19a 1Joab was told, “The king is weeping and mourning for Absalom.” 2And for the whole army the victory that day was turned into mourning, because on that day the troops heard it said, “The king is grieving for his son.” 3The men stole into the city that day as men steal in who are ashamed when they flee from battle. 4The king covered his face and cried aloud, “O my son Absalom! O Absalom, my son, my son!” 5Then Joab went into the house to the king and said, “Today you have humiliated all your men, who have just saved your life and the lives of your sons and daughters and the lives of your wives and concubines. 6You love those who hate you and hate those who love you. You have made it clear today that the commanders and their men mean nothing to you. I see that you would be pleased if Absalom were alive today and all of us were dead. 7Now go out and encourage your men. I swear by the LORD that if you don’t go out, not a man will be left with you by nightfall. This will be worse for you than all the calamities that have come on you from your youth till now.” 8So the king got up and took his seat in the gateway. When the men were told, “The king is sitting in the gateway,” they all came before him. Meanwhile, the Israelites had fled to their homes. David Returns to Jerusalem 9Throughout the tribes of Israel, all the people were arguing among themselves, saying, “The king delivered us from the hand of our enemies; he is the one who rescued us from the hand of the Philistines. But now he has fled the country to escape from Absalom; 10and Absalom, whom we anointed to rule over us, has died in battle. So why do you say nothing about bringing the king back?” 11King David sent this message to Zadok and Abiathar, the priests: “Ask the elders of Judah, ‘Why should you be the last to bring the king back to his palace, since what is being said throughout Israel has reached the king at his quarters? 12You are my relatives, my own flesh and blood. So why should you be the last to bring back the king?’ 13And say to Amasa, ‘Are you not my own flesh and blood? May God deal with me, be it ever so severely, if you are not the commander of my army for life in place of Joab.’ ” 14He won over the hearts of the men of Judah so that they were all of one mind. They sent word to the king, “Return, you and all your men.” 15Then the king returned and went as far as the Jordan. Now the men of Judah had come to Gilgal to go out and meet the king and bring him across the Jordan. 16Shimei son of Gera, the Benjamite from Bahurim, hurried down with the men of Judah to meet King David. 17With him were a thousand Benjamites, along with Ziba, the steward of Saul’s household, and his fifteen sons and twenty servants. They rushed to the Jordan, where the king was. 18They crossed at the ford to take the king’s household over and to do whatever he wished. When Shimei son of Gera crossed the Jordan, he fell prostrate before the king 19and said to him, “May my lord not hold me guilty. Do not remember how your servant did wrong on the day my lord the king left Jerusalem. May the king put it out of his mind. 20For I your servant know that I have sinned, but today I have come here as the first from the tribes of Joseph to come down and meet my lord the king.” 21Then Abishai son of Zeruiah said, “Shouldn’t Shimei be put to death for this? He cursed the LORD’s anointed.” 22David replied, “What does this have to do with you, you sons of Zeruiah? What right do you have to interfere? Should anyone be put to death in Israel today? Don’t I know that today I am king over Israel?” 23So the king said to Shimei, “You shall not die.” And the king promised him on oath. 24Mephibosheth, Saul’s grandson, also went down to meet the king. He had not taken care of his feet or trimmed his mustache or washed his clothes from the day the king left until the day he returned safely. 25When he came from Jerusalem to meet the king, the king asked him, “Why didn’t you go with me, Mephibosheth?” 26He said, “My lord the king, since I your servant am lame, I said, ‘I will have my donkey saddled and will ride on it, so I can go with the king.’ But Ziba my servant betrayed me. 27And he has slandered your servant to my lord the king. My lord the king is like an angel of God; so do whatever you wish. 28All my grandfather’s descendants deserved nothing but death from my lord the king, but you gave your servant a place among those who eat at your table. So what right do I have to make any more appeals to the king?” 29The king said to him, “Why say more? I order you and Ziba to divide the land.” 30Mephibosheth said to the king, “Let him take everything, now that my lord the king has returned home safely.” 31Barzillai the Gileadite also came down from Rogelim to cross the Jordan with the king and to send him on his way from there. 32Now Barzillai was very old, eighty years of age. He had provided for the king during his stay in Mahanaim, for he was a very wealthy man. 33The king said to Barzillai, “Cross over with me and stay with me in Jerusalem, and I will provide for you.” 34But Barzillai answered the king, “How many more years will I live, that I should go up to Jerusalem with the king? 35I am now eighty years old. Can I tell the difference between what is enjoyable and what is not? Can your servant taste what he eats and drinks? Can I still hear the voices of male and female singers? Why should your servant be an added burden to my lord the king? 36Your servant will cross over the Jordan with the king for a short distance, but why should the king reward me in this way? 37Let your servant return, that I may die in my own town near the tomb of my father and mother. But here is your servant Kimham. Let him cross over with my lord the king. Do for him whatever you wish.” 38The king said, “Kimham shall cross over with me, and I will do for him whatever you wish. And anything you desire from me I will do for you.” 39So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and bid him farewell, and Barzillai returned to his home. 40When the king crossed over to Gilgal, Kimham crossed with him. All the troops of Judah and half the troops of Israel had taken the king over. 41Soon all the men of Israel were coming to the king and saying to him, “Why did our brothers, the men of Judah, steal the king away and bring him and his household across the Jordan, together with all his men?” 42All the men of Judah answered the men of Israel, “We did this because the king is closely related to us. Why are you angry about it? Have we eaten any of the king’s provisions? Have we taken anything for ourselves?” 43Then the men of Israel answered the men of Judah, “We have ten shares in the king; so we have a greater claim on David than you have. Why then do you treat us with contempt? Weren’t we the first to speak of bringing back our king?” But the men of Judah pressed their claims even more forcefully than the men of Israel.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Samuel",
        "chapter_number": "18",
        "verse_numbers": "2",
        "verse_reference": "2 Samuel 18:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.851151"
      }
    },
    {
      "id": "bible_niv_000007",
      "text": "Kings",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Samuel",
        "chapter_number": "24",
        "verse_numbers": "1",
        "verse_reference": "2 Samuel 24:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.851924"
      }
    },
    {
      "id": "bible_niv_000008",
      "text": "Kings 5a 1When Hiram king of Tyre heard that Solomon had been anointed king to succeed his father David, he sent his envoys to Solomon, because he had always been on friendly terms with David. 2Solomon sent back this message to Hiram: 3“You know that because of the wars waged against my father David from all sides, he could not build a temple for the Name of the LORD his God until the LORD put his enemies under his feet. 4But now the LORD my God has given me rest on every side, and there is no adversary or disaster. 5I intend, therefore, to build a temple for the Name of the LORD my God, as the LORD told my father David, when he said, ‘Your son whom I will put on the throne in your place will build the temple for my Name.’ 6“So give orders that cedars of Lebanon be cut for me. My men will work with yours, and I will pay you for your men whatever wages you set. You know that we have no one so skilled in felling timber as the Sidonians.” 7When Hiram heard Solomon’s message, he was greatly pleased and said, “Praise be to the LORD today, for he has given David a wise son to rule over this great nation.” 8So Hiram sent word to Solomon: “I have received the message you sent me and will do all you want in providing the cedar and juniper logs. 9My men will haul them down from Lebanon to the Mediterranean Sea, and I will float them as rafts by sea to the place you specify. There I will separate them and you can take them away. And you are to grant my wish by providing food for my royal household.” 10In this way Hiram kept Solomon supplied with all the cedar and juniper logs he wanted, 11and Solomon gave Hiram twenty thousand corsb of wheat as food for his household, in addition to twenty thousand bathsc,d of pressed olive oil. Solomon continued to do this for Hiram year after year. 12The LORD gave Solomon wisdom, just as he had promised him. There were peaceful relations between Hiram and Solomon, and the two of them made a treaty. 13King Solomon conscripted laborers from all Israel—thirty thousand men. 14He sent them off to Lebanon in shifts of ten thousand a month, so that they spent one month in Lebanon and two months at home. Adoniram was in charge of the forced labor. 15Solomon had seventy thousand carriers and eighty thousand stonecutters in the hills, 16as well as thirty-three hundrede foremen who supervised the project and directed the workers. 17At the king’s command they removed from the quarry large blocks of high-grade stone to provide a foundation of dressed stone for the temple. 18The craftsmen of Solomon and Hiram and workers from Byblos cut and prepared the timber and stone for the building of the temple.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Kings",
        "chapter_number": "4",
        "verse_numbers": "1",
        "verse_reference": "1 Kings 4:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.852357"
      }
    },
    {
      "id": "bible_niv_000009",
      "text": "Kings",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Kings",
        "chapter_number": "22",
        "verse_numbers": "2",
        "verse_reference": "1 Kings 22:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.854177"
      }
    },
    {
      "id": "bible_niv_000010",
      "text": "Kings 12a 1In the seventh year of Jehu, Joashb became king, and he reigned in Jerusalem forty years. His mother’s name was Zibiah; she was from Beersheba. 2Joash did what was right in the eyes of the LORD all the years Jehoiada the priest instructed him. 3The high places, however, were not removed; the people continued to offer sacrifices and burn incense there. 4Joash said to the priests, “Collect all the money that is brought as sacred offerings to the temple of the LORD—the money collected in the census, the money received from personal vows and the money brought voluntarily to the temple. 5Let every priest receive the money from one of the treasurers, then use it to repair whatever damage is found in the temple.” 6But by the twenty-third year of King Joash the priests still had not repaired the temple. 7Therefore King Joash summoned Jehoiada the priest and the other priests and asked them, “Why aren’t you repairing the damage done to the temple? Take no more money from your treasurers, but hand it over for repairing the temple.” 8The priests agreed that they would not collect any more money from the people and that they would not repair the temple themselves. 9Jehoiada the priest took a chest and bored a hole in its lid. He placed it beside the altar, on the right side as one enters the temple of the LORD. The priests who guarded the entrance put into the chest all the money that was brought to the temple of the LORD. 10Whenever they saw that there was a large amount of money in the chest, the royal secretary and the high priest came, counted the money that had been brought into the temple of the LORD and put it into bags. 11When the amount had been determined, they gave the money to the men appointed to supervise the work on the temple. With it they paid those who worked on the temple of the LORD—the carpenters and builders, 12the masons and stonecutters. They purchased timber and blocks of dressed stone for the repair of the temple of the LORD, and met all the other expenses of restoring the temple. 13The money brought into the temple was not spent for making silver basins, wick trimmers, sprinkling bowls, trumpets or any other articles of gold or silver for the temple of the LORD; 14it was paid to the workers, who used it to repair the temple. 15They did not require an accounting from those to whom they gave the money to pay the workers, because they acted with complete honesty. 16The money from the guilt offerings and sin offeringsc was not brought into the temple of the LORD; it belonged to the priests. 17About this time Hazael king of Aram went up and attacked Gath and captured it. Then he turned to attack Jerusalem. 18But Joash king of Judah took all the sacred objects dedicated by his predecessors—Jehoshaphat, Jehoram and Ahaziah, the kings of Judah—and the gifts he himself had dedicated and all the gold found in the treasuries of the temple of the LORD and of the royal palace, and he sent them to Hazael king of Aram, who then withdrew from Jerusalem. 19As for the other events of the reign of Joash, and all he did, are they not written in the book of the annals of the kings of Judah? 20His officials conspired against him and assassinated him at Beth Millo, on the road down to Silla. 21The officials who murdered him were Jozabad son of Shimeath and Jehozabad son of Shomer. He died and was buried with his ancestors in the City of David. And Amaziah his son succeeded him as king.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Kings",
        "chapter_number": "11",
        "verse_numbers": "2",
        "verse_reference": "2 Kings 11:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.855232"
      }
    },
    {
      "id": "bible_niv_000011",
      "text": "Chronicles",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Kings",
        "chapter_number": "25",
        "verse_numbers": "1",
        "verse_reference": "2 Kings 25:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.856535"
      }
    },
    {
      "id": "bible_niv_000012",
      "text": "Chronicles 6a 1The sons of Levi: Gershon, Kohath and Merari. 2The sons of Kohath: Amram, Izhar, Hebron and Uzziel. 3The children of Amram: Aaron, Moses and Miriam. The sons of Aaron: Nadab, Abihu, Eleazar and Ithamar. 4Eleazar was the father of Phinehas, Phinehas the father of Abishua, 5Abishua the father of Bukki, Bukki the father of Uzzi, 6Uzzi the father of Zerahiah, Zerahiah the father of Meraioth, 7Meraioth the father of Amariah, Amariah the father of Ahitub, 8Ahitub the father of Zadok, Zadok the father of Ahimaaz, 9Ahimaaz the father of Azariah, Azariah the father of Johanan, 10Johanan the father of Azariah (it was he who served as priest in the temple Solomon built in Jerusalem), 11Azariah the father of Amariah, Amariah the father of Ahitub, 12Ahitub the father of Zadok, Zadok the father of Shallum, 13Shallum the father of Hilkiah, Hilkiah the father of Azariah, 14Azariah the father of Seraiah, and Seraiah the father of Jozadak.b 15Jozadak was deported when the LORD sent Judah and Jerusalem into exile by the hand of Nebuchadnezzar. 16The sons of Levi: Gershon,c Kohath and Merari. 17These are the names of the sons of Gershon: Libni and Shimei. 18The sons of Kohath: Amram, Izhar, Hebron and Uzziel. 19The sons of Merari: Mahli and Mushi. These are the clans of the Levites listed according to their fathers: 20Of Gershon: Libni his son, Jahath his son, Zimmah his son, 21Joah his son, Iddo his son, Zerah his son and Jeatherai his son. 22The descendants of Kohath: Amminadab his son, Korah his son, Assir his son, 23Elkanah his son, Ebiasaph his son, Assir his son, 24Tahath his son, Uriel his son, Uzziah his son and Shaul his son. 25The descendants of Elkanah: Amasai, Ahimoth, 26Elkanah his son,d Zophai his son, Nahath his son, 27Eliab his son, Jeroham his son, Elkanah his son and Samuel his son.e 28The sons of Samuel: Joelf the firstborn and Abijah the second son. 29The descendants of Merari: Mahli, Libni his son, Shimei his son, Uzzah his son, 30Shimea his son, Haggiah his son and Asaiah his son. The Temple Musicians 31These are the men David put in charge of the music in the house of the LORD after the ark came to rest there. 32They ministered with music before the tabernacle, the tent of meeting, until Solomon built the temple of the LORD in Jerusalem. They performed their duties according to the regulations laid down for them. 33Here are the men who served, together with their sons: From the Kohathites: Heman, the musician, the son of Joel, the son of Samuel, 34the son of Elkanah, the son of Jeroham, the son of Eliel, the son of Toah, 35the son of Zuph, the son of Elkanah, the son of Mahath, the son of Amasai, 36the son of Elkanah, the son of Joel, the son of Azariah, the son of Zephaniah, 37the son of Tahath, the son of Assir, the son of Ebiasaph, the son of Korah, 38the son of Izhar, the son of Kohath, the son of Levi, the son of Israel; 39and Heman’s associate Asaph, who served at his right hand: Asaph son of Berekiah, the son of Shimea, 40the son of Michael, the son of Baaseiah,g the son of Malkijah, 41the son of Ethni, the son of Zerah, the son of Adaiah, 42the son of Ethan, the son of Zimmah, the son of Shimei, 43the son of Jahath, the son of Gershon, the son of Levi; 44and from their associates, the Merarites, at his left hand: Ethan son of Kishi, the son of Abdi, the son of Malluk, 45the son of Hashabiah, the son of Amaziah, the son of Hilkiah, 46the son of Amzi, the son of Bani, the son of Shemer, 47the son of Mahli, the son of Mushi, the son of Merari, the son of Levi. 48Their fellow Levites were assigned to all the other duties of the tabernacle, the house of God. 49But Aaron and his descendants were the ones who presented offerings on the altar of burnt offering and on the altar of incense in connection with all that was done in the Most Holy Place, making atonement for Israel, in accordance with all that Moses the servant of God had commanded. 50These were the descendants of Aaron: Eleazar his son, Phinehas his son, Abishua his son, 51Bukki his son, Uzzi his son, Zerahiah his son, 52Meraioth his son, Amariah his son, Ahitub his son, 53Zadok his son and Ahimaaz his son. 54These were the locations of their settlements allotted as their territory (they were assigned to the descendants of Aaron who were from the Kohathite clan, because the first lot was for them): 55They were given Hebron in Judah with its surrounding pasturelands. 56But the fields and villages around the city were given to Caleb son of Jephunneh. 57So the descendants of Aaron were given Hebron (a city of refuge), and Libnah,h Jattir, Eshtemoa, 58Hilen, Debir, 59Ashan, Juttahi and Beth Shemesh, together with their pasturelands. 60And from the tribe of Benjamin they were given Gibeon,j Geba, Alemeth and Anathoth, together with their pasturelands. The total number of towns distributed among the Kohathite clans came to thirteen. 61The rest of Kohath’s descendants were allotted ten towns from the clans of half the tribe of Manasseh. 62The descendants of Gershon, clan by clan, were allotted thirteen towns from the tribes of Issachar, Asher and Naphtali, and from the part of the tribe of Manasseh that is in Bashan. 63The descendants of Merari, clan by clan, were allotted twelve towns from the tribes of Reuben, Gad and Zebulun. 64So the Israelites gave the Levites these towns and their pasturelands. 65From the tribes of Judah, Simeon and Benjamin they allotted the previously named towns. 66Some of the Kohathite clans were given as their territory towns from the tribe of Ephraim. 67In the hill country of Ephraim they were given Shechem (a city of refuge), and Gezer,k 68Jokmeam, Beth Horon, 69Aijalon and Gath Rimmon, together with their pasturelands. 70And from half the tribe of Manasseh the Israelites gave Aner and Bileam, together with their pasturelands, to the rest of the Kohathite clans. 71The Gershonites received the following: From the clan of the half-tribe of Manasseh they received Golan in Bashan and also Ashtaroth, together with their pasturelands; 72from the tribe of Issachar they received Kedesh, Daberath, 73Ramoth and Anem, together with their pasturelands; 74from the tribe of Asher they received Mashal, Abdon, 75Hukok and Rehob, together with their pasturelands; 76and from the tribe of Naphtali they received Kedesh in Galilee, Hammon and Kiriathaim, together with their pasturelands. 77The Merarites (the rest of the Levites) received the following: From the tribe of Zebulun they received Jokneam, Kartah,l Rimmono and Tabor, together with their pasturelands; 78from the tribe of Reuben across the Jordan east of Jericho they received Bezer in the wilderness, Jahzah, 79Kedemoth and Mephaath, together with their pasturelands; 80and from the tribe of Gad they received Ramoth in Gilead, Mahanaim, 81Heshbon and Jazer, together with their pasturelands.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Chronicles",
        "chapter_number": "5",
        "verse_numbers": "1",
        "verse_reference": "1 Chronicles 5:1",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.857310"
      }
    },
    {
      "id": "bible_niv_000013",
      "text": "Chronicles",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Chronicles",
        "chapter_number": "29",
        "verse_numbers": "2",
        "verse_reference": "1 Chronicles 29:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.859421"
      }
    },
    {
      "id": "bible_niv_000014",
      "text": "Chronicles 2a 1Solomon gave orders to build a temple for the Name of the LORD and a royal palace for himself. 2He conscripted 70,000 men as carriers and 80,000 as stonecutters in the hills and 3,600 as foremen over them. 3Solomon sent this message to Hiramb king of Tyre: “Send me cedar logs as you did for my father David when you sent him cedar to build a palace to live in. 4Now I am about to build a temple for the Name of the LORD my God and to dedicate it to him for burning fragrant incense before him, for setting out the consecrated bread regularly, and for making burnt offerings every morning and evening and on the Sabbaths, at the New Moons and at the appointed festivals of the LORD our God. This is a lasting ordinance for Israel. 5“The temple I am going to build will be great, because our God is greater than all other gods. 6But who is able to build a temple for him, since the heavens, even the highest heavens, cannot contain him? Who then am I to build a temple for him, except as a place to burn sacrifices before him? 7“Send me, therefore, a man skilled to work in gold and silver, bronze and iron, and in purple, crimson and blue yarn, and experienced in the art of engraving, to work in Judah and Jerusalem with my skilled workers, whom my father David provided. 8“Send me also cedar, juniper and algumc logs from Lebanon, for I know that your servants are skilled in cutting timber there. My servants will work with yours 9to provide me with plenty of lumber, because the temple I build must be large and magnificent. 10I will give your servants, the woodsmen who cut the timber, twenty thousand corsd of ground wheat, twenty thousand corse of barley, twenty thousand bathsf of wine and twenty thousand baths of olive oil.” 11Hiram king of Tyre replied by letter to Solomon: “Because the LORD loves his people, he has made you their king.” 12And Hiram added: “Praise be to the LORD, the God of Israel, who made heaven and earth! He has given King David a wise son, endowed with intelligence and discernment, who will build a temple for the LORD and a palace for himself. 13“I am sending you Huram-Abi, a man of great skill, 14whose mother was from Dan and whose father was from Tyre. He is trained to work in gold and silver, bronze and iron, stone and wood, and with purple and blue and crimson yarn and fine linen. He is experienced in all kinds of engraving and can execute any design given to him. He will work with your skilled workers and with those of my lord, David your father. 15“Now let my lord send his servants the wheat and barley and the olive oil and wine he promised, 16and we will cut all the logs from Lebanon that you need and will float them as rafts by sea down to Joppa. You can then take them up to Jerusalem.” 17Solomon took a census of all the foreigners residing in Israel, after the census his father David had taken; and they were found to be 153,600. 18He assigned 70,000 of them to be carriers and 80,000 to be stonecutters in the hills, with 3,600 foremen over them to keep the people working.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Chronicles",
        "chapter_number": "1",
        "verse_numbers": "2",
        "verse_reference": "2 Chronicles 1:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.859551"
      }
    },
    {
      "id": "bible_niv_000015",
      "text": "Chronicles 14a 1And Abijah rested with his ancestors and was buried in the City of David. Asa his son succeeded him as king, and in his days the country was at peace for ten years. Asa King of Judah 2Asa did what was good and right in the eyes of the LORD his God. 3He removed the foreign altars and the high places, smashed the sacred stones and cut down the Asherah poles.b 4He commanded Judah to seek the LORD, the God of their ancestors, and to obey his laws and commands. 5He removed the high places and incense altars in every town in Judah, and the kingdom was at peace under him. 6He built up the fortified cities of Judah, since the land was at peace. No one was at war with him during those years, for the LORD gave him rest. 7“Let us build up these towns,” he said to Judah, “and put walls around them, with towers, gates and bars. The land is still ours, because we have sought the LORD our God; we sought him and he has given us rest on every side.” So they built and prospered. 8Asa had an army of three hundred thousand men from Judah, equipped with large shields and with spears, and two hundred and eighty thousand from Benjamin, armed with small shields and with bows. All these were brave fighting men. 9Zerah the Cushite marched out against them with an army of thousands upon thousands and three hundred chariots, and came as far as Mareshah. 10Asa went out to meet him, and they took up battle positions in the Valley of Zephathah near Mareshah. 11Then Asa called to the LORD his God and said, “LORD, there is no one like you to help the powerless against the mighty. Help us, LORD our God, for we rely on you, and in your name we have come against this vast army. LORD, you are our God; do not let mere mortals prevail against you.” 12The LORD struck down the Cushites before Asa and Judah. The Cushites fled, 13and Asa and his army pursued them as far as Gerar. Such a great number of Cushites fell that they could not recover; they were crushed before the LORD and his forces. The men of Judah carried off a large amount of plunder. 14They destroyed all the villages around Gerar, for the terror of the LORD had fallen on them. They looted all these villages, since there was much plunder there. 15They also attacked the camps of the herders and carried off droves of sheep and goats and camels. Then they returned to Jerusalem.",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Chronicles",
        "chapter_number": "13",
        "verse_numbers": "2",
        "verse_reference": "2 Chronicles 13:2",
        "testament": "Old",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.860305"
      }
    },
    {
      "id": "bible_niv_000016",
      "text": "Corinthians",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Romans",
        "chapter_number": "16",
        "verse_numbers": "1",
        "verse_reference": "Romans 16:1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.930713"
      }
    },
    {
      "id": "bible_niv_000017",
      "text": "Corinthians",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Corinthians",
        "chapter_number": "16",
        "verse_numbers": "2",
        "verse_reference": "1 Corinthians 16:2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.931682"
      }
    },
    {
      "id": "bible_niv_000018",
      "text": "Thessalonians",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Colossians",
        "chapter_number": "4",
        "verse_numbers": "1",
        "verse_reference": "Colossians 4:1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.933996"
      }
    },
    {
      "id": "bible_niv_000019",
      "text": "Thessalonians",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Thessalonians",
        "chapter_number": "4",
        "verse_numbers": "2",
        "verse_reference": "1 Thessalonians 4:2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.934399"
      }
    },
    {
      "id": "bible_niv_000020",
      "text": "Timothy",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Thessalonians",
        "chapter_number": "3",
        "verse_numbers": "1",
        "verse_reference": "2 Thessalonians 3:1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.934652"
      }
    },
    {
      "id": "bible_niv_000021",
      "text": "Timothy",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Timothy",
        "chapter_number": "6",
        "verse_numbers": "2",
        "verse_reference": "1 Timothy 6:2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.934984"
      }
    },
    {
      "id": "bible_niv_000022",
      "text": "Peter",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "James",
        "chapter_number": "5",
        "verse_numbers": "1",
        "verse_reference": "James 5:1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.936528"
      }
    },
    {
      "id": "bible_niv_000023",
      "text": "Peter",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 Peter",
        "chapter_number": "5",
        "verse_numbers": "2",
        "verse_reference": "1 Peter 5:2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.936936"
      }
    },
    {
      "id": "bible_niv_000024",
      "text": "John",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 Peter",
        "chapter_number": "3",
        "verse_numbers": "1",
        "verse_reference": "2 Peter 3:1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.937186"
      }
    },
    {
      "id": "bible_niv_000025",
      "text": "John",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "1 John",
        "chapter_number": "5",
        "verse_numbers": "2",
        "verse_reference": "1 John 5:2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.937559"
      }
    },
    {
      "id": "bible_niv_000026",
      "text": "John",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "2 John",
        "chapter_number": "1",
        "verse_numbers": "3",
        "verse_reference": "2 John 1:3",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.937612"
      }
    },
    {
      "id": "bible_niv_000027",
      "text": "pounds 1/4 pounds 2/ ounce 1/ ounce 1/ ounce 1/ ounce 1/ ounce APPROXIMATE METRIC EQUIVALENT kilograms 560 grams 11.5 grams 7.8 grams 5.7 grams 0.6 gram inches inches",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Revelation",
        "chapter_number": "22",
        "verse_numbers": "75,1,34,18,9",
        "verse_reference": "Revelation 22:75-9",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.939536"
      }
    },
    {
      "id": "bible_niv_000028",
      "text": "inches 600 feet 8.4 grams centimeters centimeters 7.5 centimeters meters cor [homer] (10 ephahs) lethek (5 ephahs) ephah (10 omers) bushels",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Revelation",
        "chapter_number": "22",
        "verse_numbers": "3,45,23,183,6",
        "verse_reference": "Revelation 22:3-6",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.939564"
      }
    },
    {
      "id": "bible_niv_000029",
      "text": "bushels 3/ bushel 220 liters liters liters seah (1/3 ephah) quarts 7.5 liters omer (1/10 ephah) quarts",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Revelation",
        "chapter_number": "22",
        "verse_numbers": "3,110,22,7,2",
        "verse_reference": "Revelation 22:3-2",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.939589"
      }
    },
    {
      "id": "bible_niv_000030",
      "text": "liters cab (1/18 ephah) bath (1 ephah) hin (1/6 bath) quart gallons gallon liter",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Revelation",
        "chapter_number": "22",
        "verse_numbers": "2,1,6,1,1",
        "verse_reference": "Revelation 22:2-1",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.939605"
      }
    },
    {
      "id": "bible_niv_000031",
      "text": "liters 3.8 liters log (1/72 bath) 1/ quart 0.3 liter The figures of the table are calculated on the basis of a shekel equaling 11.5 grams, a cubit equaling 18 inches and an ephah equaling 22 liters. The quart referred to is either a dry quart (slightly larger than a liter) or a liquid quart (slightly smaller than a liter), whichever is applicable. The ton referred to in the footnotes is the American ton of 2,000 pounds. These weights are calculated relative to the particular commodity involved. Accordingly, the same measure of capacity in the text may be converted into different weights in the footnotes. This table is based upon the best available information, but it is not intended to be mathematically precise; like the measurement equivalents in the footnotes, it merely gives approximate amounts and distances. Weights and measures differed somewhat at various times and places in the ancient world. There is uncertainty particularly about the ephah and the bath; further discoveries may shed more light on these units of capacity. Zondervan Color Maps Map 1:World of the Patriarchs Map 2: Holy Land and Sinai Map 3: Exodus and Conquest of Canaan Map 4: Land of the Twelve Tribes Map 5: Kingdom of David and Solomon Map 6: Kingdoms of Israel and Judah Map 7: Prophets in Israel and Judah Map 8: Assyrian and Babylonian Empires Map 9: Holy Land in the Time of Jesus Map 10: Jerusalem in the Time of Jesus Map 11: Jesus’ Ministry Map 12: Apostles’ Early Travel Map 13: Paul’s Missionary Journeys Map 14: Roman Empire Map 1:World of the Patriarchs Map 2: Holy Land and Sinai Map 3: Exodus and Conquest of Canaan Map 4: Land of the Twelve Tribes Map 5: Kingdom of David and Solomon Map 6: Kingdoms of Israel and Judah Map 7: Prophets in Israel and Judah Map 8: Assyrian and Babylonian Empires Map 9: Holy Land in the Time of Jesus Map 10: Jerusalem in the Time of Jesus Map 11: Jesus’ Ministry Map 12: Apostles’ Early Travel Map 13: Paul’s Missionary Journeys Map 14: Roman Empire",
      "metadata": {
        "source_id": "bible_niv",
        "title": "New International Version Bible",
        "author": "Various",
        "domain": "theology",
        "book_name": "Revelation",
        "chapter_number": "22",
        "verse_numbers": "22",
        "verse_reference": "Revelation 22:22",
        "testament": "New",
        "chunk_strategy": "verse",
        "creation_timestamp": "2025-08-31T17:22:12.941886"
      }
    }
  ]
}