{
  "source_id": "steps_to_christ",
  "title": "Steps to Christ",
  "chunks": [
    {
      "id": "steps_to_christ_000001",
      "text": "Steps to Christ\nEllen G. White\n1892\nCopyright © 2017\nEllen G. White Estate, Inc.\nInformation about this Book\nOverview\nThis eBook is provided by the Ellen G. White Estate. It is included\nin the larger free Online Books collection on the Ellen G. White\nEstate Web site.\nAbout the Author\nEllen G. White (1827-1915) is considered the most widely translated\nAmerican author, her works having been published in more than 160\nlanguages. She wrote more than 100,000 pages on a wide variety of\nspiritual and practical topics. Guided by the Holy Spirit, she exalted\nJesus and pointed to the Scriptures as the basis of one’s faith.\nFurther Links\nA Brief Biography of Ellen G. White\nAbout the Ellen G. White Estate\nEnd User License Agreement\nThe viewing, printing or downloading of this book grants you only\na limited, nonexclusive and nontransferable license for use solely\nby you for your own personal use. This license does not permit\nrepublication, distribution, assignment, sublicense, sale, preparation\nof derivative works, or other use. Any unauthorized use of this book\nterminates the license granted hereby.\nFurther Information\nFor more information about the author, publishers, or how you\ncan support this service, please contact the Ellen G. White Estate\nat mail@whiteestate.org. We are thankful for your interest and\nfeedback and wish you God’s blessing as you read.\ni\nii\nForeword\nFew books attain a distribution reckoned in millions or exert so\ngreat an influence in the uplifting of humanity as has Steps to Christ.\nIn countless editions, this little volume has been printed in more than\nseventy languages, bringing inspiration to hundreds of thousands\nof men and women throughout the world, even those who dwell in\nthe remote corners of the earth. From the appearance of the first\nedition in 1892, the publishers have been called upon to add printing\nto printing to meet the immediate and sustained demand from the\nreading public.\nThe author of this work, Ellen G. White (1827-1915), was a\nreligious speaker and writer, well known on three continents. Born\nnear Portland, Maine, she spent her early life in the New England\nStates, and then her travels and labors led her to the rapidly expand-\ning central and western areas of the United States. The years 1885 to\n1887 she devoted to work in the leading countries of Europe, where\nshe often addressed large audiences, and continued her writing. Sub-\nsequently she spent nine active years in Australia and New Zealand.\nFrom her pen have come forty-five volumes, large and small, in the\nfields of theology, education, health, and the home, and practical\nChristianity, several with a distribution exceeding the million-copy\nmark. Of these, Steps to Christis the most popular and widely read.\nThe title of the book tells its mission. It points the reader to Jesus [6]\nChrist as the only one who is able to meet the needs of the soul. It\ndirects the feet of the doubting and halting to the pathway of peace.\nIt leads the seeker after righteousness and wholeness of character,\nstep by step, along the way of Christian living, to that experience\nwhere he can know the fullness of blessing which is found in the\ncomplete surrender of self. It reveals to him the secret of victory as\nit unfolds in simplicity the saving grace and the keeping power of\nthe great Friend of all mankind.\nThis edition marks a forward step in standardizing the paging\nof the book in forthcoming English-language printings. With no\niii\nchange in the text, but with a format, spelling, and capitalization\nin keeping with the times, this little compendium of devotion will\ncontinue on its mission, but now in such form, regardless of the size\nof the type or page, as to conform to the new Index to the writings\nof Ellen G. White.\nJacob of old, when oppressed with the fear that his sin had cut\nhim off from God, lay down to rest, and “he dreamed, and behold a\nladder set up on the earth, and the top of it reached to heaven.” The\nconnection between earth and heaven was thus revealed to him, and\nwords of comfort and hope were spoken to the wanderer by Him\nwho stood at the top of the shadowy stairs. That the heavenly vision\nmay be repeated to many as they read this story of the way of life, is\nthe sincere wish of the publishers, and—\nThe Trustees of the Ellen G. White Publications\nContents\nInformation about this Book . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . i\nForeword . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . iii\nChapter 1—God’s Love for Man . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\nChapter 2—The Sinner’s Need of Christ . . . . . . . . . . . . . . . . . . . 11\nChapter 3—Repentance . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\nChapter 4—Confession . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\nChapter 5—Consecration . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 29\nChapter 6—Faith and Acceptance . . . . . . . . . . . . . . . . . . . . . . . . 33\nChapter 7—The Test of Discipleship . . . . . . . . . . . . . . . . . . . . . 38\nChapter 8—Growing Up Into Christ . . . . . . . . . . . . . . . . . . . . . . 44\nChapter 9—The Work and the Life . . . . . . . . . . . . . . . . . . . . . . . 50\nChapter 10—A Knowledge of God . . . . . . . . . . . . . . . . . . . . . . . 55\nChapter 11—The Privilege of Prayer . . . . . . . . . . . . . . . . . . . . . 60\nChapter 12—What to Do with Doubt . . . . . . . . . . . . . . . . . . . . . 68\nChapter 13—Rejoicing in the Lord . . . . . . . . . . . . . . . . . . . . . . . 74\nv\nChapter 1—God’s Love for Man[7]\nNature and revelation alike testify of God’s love. Our Father\nin heaven is the source of life, of wisdom, and of joy. Look at the\nwonderful and beautiful things of nature. Think of their marvelous\nadaptation to the needs and happiness, not only of man, but of all\nliving creatures. The sunshine and the rain, that gladden and refresh\nthe earth, the hills and seas and plains, all speak to us of the Creator’s\nlove. It is God who supplies the daily needs of all His creatures. In\nthe beautiful words of the psalmist—\n“The eyes of all wait upon Thee;\nAnd Thou givest them their meat in due season.\nThou openest Thine hand,\nAnd satisfiest the desire of every living thing.”\nPsalm 145:15, 16.\nGod made man perfectly holy and happy; and the fair earth, as it\ncame from the Creator’s hand, bore no blight of decay or shadow of\nthe curse. It is transgression of God’s law—the law of love—that\nhas brought woe and death. Yet even amid the suffering that results\nfrom sin, God’s love is revealed. It is written that God cursed the\nground for man’s sake. Genesis 3:17. The thorn and the thistle—the\ndifficulties and trials that make his life one of toil and care—were\nappointed for his good as a part of the training needful in God’s plan\nfor his uplifting from the ruin and degradation that sin has wrought.\nThe world, though fallen, is not all sorrow and misery. In nature[10]\nitself are messages of hope and comfort. There are flowers upon the\nthistles, and the thorns are covered with roses.\n“God is love” is written upon every opening bud, upon every\nspire of springing grass. The lovely birds making the air vocal with\ntheir happy songs, the delicately tinted flowers in their perfection\nperfuming the air, the lofty trees of the forest with their rich foliage\nof living green—all testify to the tender, fatherly care of our God\nand to His desire to make His children happy.\n6\nGod’s Love for Man 7\nThe word of God reveals His character. He Himself has declared\nHis infinite love and pity. When Moses prayed, “Show me Thy\nglory,” the Lord answered, “I will make all My goodness pass before\nthee.” Exodus 33:18, 19. This is His glory. The Lord passed before\nMoses, and proclaimed, “The Lord, The Lord God, merciful and\ngracious, long-suffering, and abundant in goodness and truth, keep-\ning mercy for thousands, forgiving iniquity and transgression and\nsin.” Exodus 34:6, 7. He is “slow to anger, and of great kindness,”\n“because He delighteth in mercy.” Jonah 4:2; Micah 7:18.\nGod has bound our hearts to Him by unnumbered tokens in\nheaven and in earth. Through the things of nature, and the deepest\nand tenderest earthly ties that human hearts can know, He has sought\nto reveal Himself to us. Yet these but imperfectly represent His love.\nThough all these evidences have been given, the enemy of good\nblinded the minds of men, so that they looked upon God with fear;\nthey thought of Him as severe and unforgiving. Satan led men to [11]\nconceive of God as a being whose chief attribute is stern justice,—\none who is a severe judge, a harsh, exacting creditor. He pictured\nthe Creator as a being who is watching with jealous eye to discern\nthe errors and mistakes of men, that He may visit judgments upon\nthem. It was to remove this dark shadow, by revealing to the world\nthe infinite love of God, that Jesus came to live among men.\nThe Son of God came from heaven to make manifest the Fa-\nther. “No man hath seen God at any time; the only begotten Son,\nwhich is in the bosom of the Father, He hath declared Him.” John\n1:18. “Neither knoweth any man the Father, save the Son, and he\nto whomsoever the Son will reveal Him.” Matthew 11:27. When\none of the disciples made the request, “Show us the Father,” Jesus\nanswered, “Have I been so long time with you, and yet hast thou not\nknown Me, Philip? He that hath seen Me hath seen the Father; and\nhow sayest thou then, Show us the Father?” John 14:8, 9.\nIn describing His earthly mission, Jesus said, The Lord “hath\nanointed Me to preach the gospel to the poor; He hath sent Me to heal\nthe brokenhearted, to preach deliverance to the captives, and recover-\ning of sight to the blind, to set at liberty them that are bruised.” Luke\n4:18. This was His work. He went about doing good and healing\nall that were oppressed by Satan. There were whole villages where\nthere was not a moan of sickness in any house, for He had passed\n8 Steps to Christ\nthrough them and healed all their sick. His work gave evidence of\nHis divine anointing. Love, mercy, and compassion were revealed\nin every act of His life; His heart went out in tender sympathy to the[12]\nchildren of men. He took man’s nature, that He might reach man’s\nwants. The poorest and humblest were not afraid to approach Him.\nEven little children were attracted to Him. They loved to climb upon\nHis knees and gaze into the pensive face, benignant with love.\nJesus did not suppress one word of truth, but He uttered it always\nin love. He exercised the greatest tact and thoughtful, kind attention\nin His relationships with the people. He was never rude, never need-\nlessly spoke a severe word, never gave needless pain to a sensitive\nsoul. He did not censure human weakness. He spoke the truth, but\nalways in love. He denounced hypocrisy, unbelief, and iniquity; but\ntears were in His voice as He uttered His scathing rebukes. He wept\nover Jerusalem, the city He loved, which refused to receive Him,\nthe way, the truth, and the life. They had rejected Him, the Saviour,\nbut He regarded them with pitying tenderness. His life was one of\nself-denial and thoughtful care for others. Every soul was precious\nin His eyes. While He ever bore Himself with divine dignity, He\nbowed with the tenderest regard to every member of the family of\nGod. In all men He saw fallen souls whom it was His mission to\nsave.\nSuch is the character of Christ as revealed in His life. This is the\ncharacter of God. It is from the Father’s heart that the streams of\ndivine compassion, manifest in Christ, flow out to the children of\nmen. Jesus, the tender, pitying Saviour, was God “manifest in the\nflesh.” 1 Timothy 3:16.\nIt was to redeem us that Jesus lived and suffered and died. He[13]\nbecame “a Man of Sorrows,” that we might be made partakers of\neverlasting joy. God permitted His beloved Son, full of grace and\ntruth, to come from a world of indescribable glory, to a world marred\nand blighted with sin, darkened with the shadow of death and the\ncurse. He permitted Him to leave the bosom of His love, the adora-\ntion of the angels, to suffer shame, insult, humiliation, hatred, and\ndeath. “The chastisement of our peace was upon Him; and with His\nstripes we are healed.” Isaiah 53:5. Behold Him in the wilderness,\nin Gethsemane, upon the cross! The spotless Son of God took upon\nHimself the burden of sin. He who had been one with God, felt in\nGod’s Love for Man 9\nHis soul the awful separation that sin makes between God and man.\nThis wrung from His lips the anguished cry, “My God, My God,\nwhy hast Thou forsaken Me?” Matthew 27:46. It was the burden of\nsin, the sense of its terrible enormity, of its separation of the soul\nfrom God—it was this that broke the heart of the Son of God.\nBut this great sacrifice was not made in order to create in the\nFather’s heart a love for man, not to make Him willing to save. No,\nno! “God so loved the world, that He gave His only-begotten Son.”\nJohn 3:16. The Father loves us, not because of the great propitiation,\nbut He provided the propitiation because He loves us. Christ was\nthe medium through which He could pour out His infinite love upon\na fallen world. “God was in Christ, reconciling the world unto\nHimself.” 2 Corinthians 5:19. God suffered with His Son. In the\nagony of Gethsemane, the death of Calvary, the heart of Infinite [14]\nLove paid the price of our redemption.\nJesus said, “Therefore doth My Father love Me, because I lay\ndown My life, that I might take it again.” John 10:17. That is, “My\nFather has so loved you that He even loves Me more for giving My\nlife to redeem you. In becoming your Substitute and Surety, by\nsurrendering My life, by taking your liabilities, your transgressions,\nI am endeared to My Father; for by My sacrifice, God can be just,\nand yet the Justifier of him who believeth in Jesus.”\nNone but the Son of God could accomplish our redemption; for\nonly He who was in the bosom of the Father could declare Him.\nOnly He who knew the height and depth of the love of God could\nmake it manifest. Nothing less than the infinite sacrifice made by\nChrist in behalf of fallen man could express the Father’s love to lost\nhumanity.\n“God so loved the world, that He gave His only-begotten Son.”\nHe gave Him not only to live among men, to bear their sins, and\ndie their sacrifice. He gave Him to the fallen race. Christ was to\nidentify Himself with the interests and needs of humanity. He who\nwas one with God has linked Himself with the children of men by\nties that are never to be broken. Jesus is “not ashamed to call them\nbrethren” (Hebrews 2:11); He is our Sacrifice, our Advocate, our\nBrother, bearing our human form before the Father’s throne, and\nthrough eternal ages one with the race He has redeemed—the Son\nof man. And all this that man might be uplifted from the ruin and\n10 Steps to Christ\ndegradation of sin that he might reflect the love of God and share\nthe joy of holiness.\nThe price paid for our redemption, the infinite sacrifice of our[15]\nheavenly Father in giving His Son to die for us, should give us\nexalted conceptions of what we may become through Christ. As the\ninspired apostle John beheld the height, the depth, the breadth of the\nFather’s love toward the perishing race, he was filled with adoration\nand reverence; and, failing to find suitable language in which to\nexpress the greatness and tenderness of this love, he called upon the\nworld to behold it. “Behold, what manner of love the Father hath\nbestowed upon us, that we should be called the sons of God.” 1 John\n3:1. What a value this places upon man! Through transgression the\nsons of man become subjects of Satan. Through faith in the atoning\nsacrifice of Christ the sons of Adam may become the sons of God.\nBy assuming human nature, Christ elevates humanity. Fallen men\nare placed where, through connection with Christ, they may indeed\nbecome worthy of the name “sons of God.”\nSuch love is without a parallel. Children of the heavenly King!\nPrecious promise! Theme for the most profound meditation! The\nmatchless love of God for a world that did not love Him! The\nthought has a subduing power upon the soul and brings the mind into\ncaptivity to the will of God. The more we study the divine character\nin the light of the cross, the more we see mercy, tenderness, and\nforgiveness blended with equity and justice, and the more clearly we\ndiscern innumerable evidences of a love that is infinite and a tender\npity surpassing a mother’s yearning sympathy for her wayward child.\nChapter 2—The Sinner’s Need of Christ [16]\n[17]\nMan was originally endowed with noble powers and a well-bal-\nanced mind. He was perfect in his being, and in harmony with God.\nHis thoughts were pure, his aims holy. But through disobedience,\nhis powers were perverted, and selfishness took the place of love.\nHis nature became so weakened through transgression that it was\nimpossible for him, in his own strength, to resist the power of evil.\nHe was made captive by Satan, and would have remained so forever\nhad not God specially interposed. It was the tempter’s purpose to\nthwart the divine plan in man’s creation, and fill the earth with woe\nand desolation. And he would point to all this evil as the result of\nGod’s work in creating man.\nIn his sinless state, man held joyful communion with Him “in\nwhom are hid all the treasures of wisdom and knowledge.” Colos-\nsians 2:3. But after his sin, he could no longer find joy in holiness,\nand he sought to hide from the presence of God. Such is still the\ncondition of the unrenewed heart. It is not in harmony with God, and\nfinds no joy in communion with Him. The sinner could not be happy\nin God’s presence; he would shrink from the companionship of holy\nbeings. Could he be permitted to enter heaven, it would have no joy\nfor him. The spirit of unselfish love that reigns there—every heart\nresponding to the heart of Infinite Love—would touch no answering\nchord in his soul. His thoughts, his interests, his motives, would be\nalien to those that actuate the sinless dwellers there. He would be a [18]\ndiscordant note in the melody of heaven. Heaven would be to him\na place of torture; he would long to be hidden from Him who is its\nlight, and the center of its joy. It is no arbitrary decree on the part of\nGod that excludes the wicked from heaven; they are shut out by their\nown unfitness for its companionship. The glory of God would be to\nthem a consuming fire. They would welcome destruction, that they\nmight be hidden from the face of Him who died to redeem them.\nIt is impossible for us, of ourselves, to escape from the pit of\nsin in which we are sunken. Our hearts are evil, and we cannot\n11\n12 Steps to Christ\nchange them. “Who can bring a clean thing out of an unclean?\nnot one.” “The carnal mind is enmity against God: for it is not\nsubject to the law of God, neither indeed can be.” Job 14:4; Romans\n8:7. Education, culture, the exercise of the will, human effort, all\nhave their proper sphere, but here they are powerless. They may\nproduce an outward correctness of behavior, but they cannot change\nthe heart; they cannot purify the springs of life. There must be a\npower working from within, a new life from above, before men can\nbe changed from sin to holiness. That power is Christ. His grace\nalone can quicken the lifeless faculties of the soul, and attract it to\nGod, to holiness.\nThe Saviour said, “Except a man be born from above,” unless\nhe shall receive a new heart, new desires, purposes, and motives,\nleading to a new life, “he cannot see the kingdom of God.” John\n3:3, margin. The idea that it is necessary only to develop the good\nthat exists in man by nature, is a fatal deception. “The natural man[19]\nreceiveth not the things of the Spirit of God: for they are foolishness\nunto him: neither can he know them, because they are spiritually\ndiscerned.” “Marvel not that I said unto thee, Ye must be born again.”\n1 Corinthians 2:14; John 3:7. Of Christ it is written, “In Him was\nlife; and the life was the light of men”—the only “name under heaven\ngiven among men, whereby we must be saved.” John 1:4; Acts 4:12.\nIt is not enough to perceive the loving-kindness of God, to see\nthe benevolence, the fatherly tenderness, of His character. It is not\nenough to discern the wisdom and justice of His law, to see that it\nis founded upon the eternal principle of love. Paul the apostle saw\nall this when he exclaimed, “I consent unto the law that it is good.”\n“The law is holy, and the commandment holy, and just, and good.”\nBut he added, in the bitterness of his soul-anguish and despair, “I\nam carnal, sold under sin.” Romans 7:16, 12, 14. He longed for the\npurity, the righteousness, to which in himself he was powerless to\nattain, and cried out, “O wretched man that I am! who shall deliver\nme from this body of death?” Romans 7:24, margin. Such is the cry\nthat has gone up from burdened hearts in all lands and in all ages.\nTo all, there is but one answer, “Behold the Lamb of God, which\ntaketh away the sin of the world.” John 1:29.\nMany are the figures by which the Spirit of God has sought to\nillustrate this truth, and make it plain to souls that long to be freed\nSinner’s Need of Christ 13\nfrom the burden of guilt. When, after his sin in deceiving Esau,\nJacob fled from his father’s home, he was weighed down with a\nsense of guilt. Lonely and outcast as he was, separated from all that [20]\nhad made life dear, the one thought that above all others pressed\nupon his soul, was the fear that his sin had cut him off from God, that\nhe was forsaken of Heaven. In sadness he lay down to rest on the\nbare earth, around him only the lonely hills, and above, the heavens\nbright with stars. As he slept, a strange light broke upon his vision;\nand lo, from the plain on which he lay, vast shadowy stairs seemed\nto lead upward to the very gates of heaven, and upon them angels\nof God were passing up and down; while from the glory above, the\ndivine voice was heard in a message of comfort and hope. Thus was\nmade known to Jacob that which met the need and longing of his\nsoul—a Saviour. With joy and gratitude he saw revealed a way by\nwhich he, a sinner, could be restored to communion with God. The\nmystic ladder of his dream represented Jesus, the only medium of\ncommunication between God and man.\nThis is the same figure to which Christ referred in His conver-\nsation with Nathanael, when He said, “Ye shall see heaven open,\nand the angels of God ascending and descending upon the Son of\nman.” John 1:51. In the apostasy, man alienated himself from God;\nearth was cut off from heaven. Across the gulf that lay between,\nthere could be no communion. But through Christ, earth is again\nlinked with heaven. With His own merits, Christ has bridged the\ngulf which sin had made, so that the ministering angels can hold\ncommunion with man. Christ connects fallen man in his weakness\nand helplessness with the Source of infinite power.\nBut in vain are men’s dreams of progress, in vain all efforts for [21]\nthe uplifting of humanity, if they neglect the one Source of hope\nand help for the fallen race. “Every good gift and every perfect gift”\n(James 1:17) is from God. There is no true excellence of character\napart from Him. And the only way to God is Christ. He says, “I am\nthe way, the truth, and the life: no man cometh unto the Father, but\nby Me.” John 14:6.\nThe heart of God yearns over His earthly children with a love\nstronger than death. In giving up His Son, He has poured out to us\nall heaven in one gift. The Saviour’s life and death and intercession,\nthe ministry of angels, the pleading of the Spirit, the Father working\n14 Steps to Christ\nabove and through all, the unceasing interest of heavenly beings,—\nall are enlisted in behalf of man’s redemption.\nOh, let us contemplate the amazing sacrifice that has been made\nfor us! Let us try to appreciate the labor and energy that Heaven is\nexpending to reclaim the lost, and bring them back to the Father’s\nhouse. Motives stronger, and agencies more powerful, could never\nbe brought into operation; the exceeding rewards for right-doing,\nthe enjoyment of heaven, the society of the angels, the communion\nand love of God and His Son, the elevation and extension of all our\npowers throughout eternal ages—are these not mighty incentives\nand encouragements to urge us to give the heart’s loving service to\nour Creator and Redeemer?\nAnd, on the other hand, the judgments of God pronounced\nagainst sin, the inevitable retribution, the degradation of our charac-[22]\nter, and the final destruction, are presented in God’s word to warn us\nagainst the service of Satan.\nShall we not regard the mercy of God? What more could He\ndo? Let us place ourselves in right relation to Him who has loved us\nwith amazing love. Let us avail ourselves of the means provided for\nus that we may be transformed into His likeness, and be restored to\nfellowship with the ministering angels, to harmony and communion\nwith the Father and the Son.\nChapter 3—Repentance [23]\nHow shall a man be just with God? How shall the sinner be\nmade righteous? It is only through Christ that we can be brought\ninto harmony with God, with holiness; but how are we to come to\nChrist? Many are asking the same question as did the multitude on\nthe Day of Pentecost, when, convicted of sin, they cried out, “What\nshall we do?” The first word of Peter’s answer was, “Repent.” Acts\n2:37, 38. At another time, shortly after, he said, “Repent, ... and be\nconverted, that your sins may be blotted out.” Acts 3:19.\nRepentance includes sorrow for sin and a turning away from it.\nWe shall not renounce sin unless we see its sinfulness; until we turn\naway from it in heart, there will be no real change in the life.\nThere are many who fail to understand the true nature of repen-\ntance. Multitudes sorrow that they have sinned and even make an\noutward reformation because they fear that their wrongdoing will\nbring suffering upon themselves. But this is not repentance in the\nBible sense. They lament the suffering rather than the sin. Such\nwas the grief of Esau when he saw that the birthright was lost to\nhim forever. Balaam, terrified by the angel standing in his pathway\nwith drawn sword, acknowledged his guilt lest he should lose his\nlife; but there was no genuine repentance for sin, no conversion of\npurpose, no abhorrence of evil. Judas Iscariot, after betraying his\nLord, exclaimed, “I have sinned in that I have betrayed the innocent [24]\nblood.” Matthew 27:4.\nThe confession was forced from his guilty soul by an awful sense\nof condemnation and a fearful looking for of judgment. The conse-\nquences that were to result to him filled him with terror, but there\nwas no deep, heartbreaking grief in his soul, that he had betrayed\nthe spotless Son of God and denied the Holy One of Israel. Pharaoh,\nwhen suffering under the judgments of God, acknowledged his sin\nin order to escape further punishment, but returned to his defiance\nof Heaven as soon as the plagues were stayed. These all lamented\nthe results of sin, but did not sorrow for the sin itself.\n15\n16 Steps to Christ\nBut when the heart yields to the influence of the Spirit of God, the\nconscience will be quickened, and the sinner will discern something\nof the depth and sacredness of God’s holy law, the foundation of\nHis government in heaven and on earth. The “Light, which lighteth\nevery man that cometh into the world,” illumines the secret chambers\nof the soul, and the hidden things of darkness are made manifest.\nJohn 1:9. Conviction takes hold upon the mind and heart. The sinner\nhas a sense of the righteousness of Jehovah and feels the terror of\nappearing, in his own guilt and uncleanness, before the Searcher of\nhearts. He sees the love of God, the beauty of holiness, the joy of\npurity; he longs to be cleansed and to be restored to communion\nwith Heaven.\nThe prayer of David after his fall, illustrates the nature of true\nsorrow for sin. His repentance was sincere and deep. There was\nno effort to palliate his guilt; no desire to escape the judgment[25]\nthreatened, inspired his prayer. David saw the enormity of his trans-\ngression; he saw the defilement of his soul; he loathed his sin. It was\nnot for pardon only that he prayed, but for purity of heart. He longed\nfor the joy of holiness—to be restored to harmony and communion\nwith God. This was the language of his soul:\n“Blessed is he whose transgression is forgiven,\nwhose sin is covered.\nBlessed is the man unto whom the Lord\nimputeth not iniquity,\nAnd in whose spirit there is no guile.”\nPsalm 32:1, 2.\n“Have mercy upon me, O God, according to\nThy loving-kindness:\nAccording unto the multitude of Thy tender\nmercies blot out my transgressions....\nFor I acknowledge my transgressions: and my\nsin is ever before me....\nPurge me with hyssop, and I shall be clean:\nwash me, and I shall be whiter than snow....\nCreate in me a clean heart, O God;\nAnd renew a right spirit within me.\nRepentance 17\nCast me not away from Thy presence;\nAnd take not Thy Holy Spirit from me.\nRestore unto me the joy of Thy salvation;\nAnd uphold me with Thy free spirit....\nDeliver me from bloodguiltiness, O God, Thou\nGod of my salvation:\nAnd my tongue shall sing aloud of Thy\nrighteousness.”\nPsalm 51:1-14.\nA repentance such as this, is beyond the reach of our own power\nto accomplish; it is obtained only from Christ, who ascended up on\nhigh and has given gifts unto men.\nJust here is a point on which many may err, and hence they fail [26]\nof receiving the help that Christ desires to give them. They think\nthat they cannot come to Christ unless they first repent, and that\nrepentance prepares for the forgiveness of their sins. It is true that\nrepentance does precede the forgiveness of sins; for it is only the\nbroken and contrite heart that will feel the need of a Saviour. But\nmust the sinner wait till he has repented before he can come to Jesus?\nIs repentance to be made an obstacle between the sinner and the\nSaviour?\nThe Bible does not teach that the sinner must repent before he can\nheed the invitation of Christ, “Come unto Me, all ye that labor and\nare heavy-laden, and I will give you rest.” Matthew 11:28. It is the\nvirtue that goes forth from Christ, that leads to genuine repentance.\nPeter made the matter clear in his statement to the Israelites when\nhe said, “Him hath God exalted with His right hand to be a Prince\nand a Saviour, for to give repentance to Israel, and forgiveness of\nsins.” Acts 5:31. We can no more repent without the Spirit of Christ\nto awaken the conscience than we can be pardoned without Christ.\nChrist is the source of every right impulse. He is the only one that\ncan implant in the heart enmity against sin. Every desire for truth\nand purity, every conviction of our own sinfulness, is an evidence\nthat His Spirit is moving upon our hearts.\nJesus has said, “I, if I be lifted up from the earth, will draw all\nmen unto Me.” John 12:32. Christ must be revealed to the sinner as\nthe Saviour dying for the sins of the world; and as we behold the\n18 Steps to Christ\nLamb of God upon the cross of Calvary, the mystery of redemption[27]\nbegins to unfold to our minds and the goodness of God leads us to\nrepentance. In dying for sinners, Christ manifested a love that is\nincomprehensible; and as the sinner beholds this love, it softens the\nheart, impresses the mind, and inspires contrition in the soul.\nIt is true that men sometimes become ashamed of their sinful\nways, and give up some of their evil habits, before they are conscious\nthat they are being drawn to Christ. But whenever they make an\neffort to reform, from a sincere desire to do right, it is the power\nof Christ that is drawing them. An influence of which they are\nunconscious works upon the soul, and the conscience is quickened,\nand the outward life is amended. And as Christ draws them to look\nupon His cross, to behold Him whom their sins have pierced, the\ncommandment comes home to the conscience. The wickedness of\ntheir life, the deep-seated sin of the soul, is revealed to them. They\nbegin to comprehend something of the righteousness of Christ, and\nexclaim, “What is sin, that it should require such a sacrifice for\nthe redemption of its victim? Was all this love, all this suffering,\nall this humiliation, demanded, that we might not perish, but have\neverlasting life?”\nThe sinner may resist this love, may refuse to be drawn to Christ;\nbut if he does not resist he will be drawn to Jesus; a knowledge of the\nplan of salvation will lead him to the foot of the cross in repentance\nfor his sins, which have caused the sufferings of God’s dear Son.\nThe same divine mind that is working upon the things of nature is[28]\nspeaking to the hearts of men and creating an inexpressible craving\nfor something they have not. The things of the world cannot satisfy\ntheir longing. The Spirit of God is pleading with them to seek\nfor those things that alone can give peace and rest—the grace of\nChrist, the joy of holiness. Through influences seen and unseen,\nour Saviour is constantly at work to attract the minds of men from\nthe unsatisfying pleasures of sin to the infinite blessings that may\nbe theirs in Him. To all these souls, who are vainly seeking to\ndrink from the broken cisterns of this world, the divine message is\naddressed, “Let him that is athirst come. And whosoever will, let\nhim take the water of life freely.” Revelation 22:17.\nYou who in heart long for something better than this world\ncan give, recognize this longing as the voice of God to your soul.\nRepentance 19\nAsk Him to give you repentance, to reveal Christ to you in His\ninfinite love, in His perfect purity. In the Saviour’s life the principles\nof God’s law—love to God and man—were perfectly exemplified.\nBenevolence, unselfish love, was the life of His soul. It is as we\nbehold Him, as the light from our Saviour falls upon us, that we see\nthe sinfulness of our own hearts.\nWe may have flattered ourselves, as did Nicodemus, that our life\nhas been upright, that our moral character is correct, and think that\nwe need not humble the heart before God, like the common sinner:\nbut when the light from Christ shines into our souls, we shall see\nhow impure we are; we shall discern the selfishness of motive, the\nenmity against God, that has defiled every act of life. Then we shall [29]\nknow that our own righteousness is indeed as filthy rags, and that\nthe blood of Christ alone can cleanse us from the defilement of sin,\nand renew our hearts in His own likeness.\nOne ray of the glory of God, one gleam of the purity of Christ,\npenetrating the soul, makes every spot of defilement painfully dis-\ntinct, and lays bare the deformity and defects of the human character.\nIt makes apparent the unhallowed desires, the infidelity of the heart,\nthe impurity of the lips. The sinner’s acts of disloyalty in making\nvoid the law of God, are exposed to his sight, and his spirit is stricken\nand afflicted under the searching influence of the Spirit of God. He\nloathes himself as he views the pure, spotless character of Christ.\nWhen the prophet Daniel beheld the glory surrounding the heav-\nenly messenger that was sent unto him, he was overwhelmed with\na sense of his own weakness and imperfection. Describing the ef-\nfect of the wonderful scene, he says, “There remained no strength\nin me: for my comeliness was turned in me into corruption, and I\nretained no strength.” Daniel 10:8. The soul thus touched will hate\nits selfishness, abhor its self-love, and will seek, through Christ’s\nrighteousness, for the purity of heart that is in harmony with the law\nof God and the character of Christ.\nPaul says that as “touching the righteousness which is in the\nlaw”—as far as outward acts were concerned—he was “blameless”\n(Philippians 3:6); but when the spiritual character of the law was\ndiscerned, he saw himself a sinner. Judged by the letter of the law as\nmen apply it to the outward life, he had abstained from sin; but when [30]\nhe looked into the depths of its holy precepts, and saw himself as\n20 Steps to Christ\nGod saw him, he bowed in humiliation and confessed his guilt. He\nsays, “I was alive without the law once: but when the commandment\ncame, sin revived, and I died.” Romans 7:9. When he saw the\nspiritual nature of the law, sin appeared in its true hideousness, and\nhis self-esteem was gone.\nGod does not regard all sins as of equal magnitude; there are\ndegrees of guilt in His estimation, as well as in that of man; but\nhowever trifling this or that wrong act may seem in the eyes of\nmen, no sin is small in the sight of God. Man’s judgment is partial,\nimperfect; but God estimates all things as they really are. The\ndrunkard is despised and is told that his sin will exclude him from\nheaven; while pride, selfishness, and covetousness too often go\nunrebuked. But these are sins that are especially offensive to God;\nfor they are contrary to the benevolence of His character, to that\nunselfish love which is the very atmosphere of the unfallen universe.\nHe who falls into some of the grosser sins may feel a sense of his\nshame and poverty and his need of the grace of Christ; but pride\nfeels no need, and so it closes the heart against Christ and the infinite\nblessings He came to give.\nThe poor publican who prayed, “God be merciful to me a sinner”\n(Luke 18:13), regarded himself as a very wicked man, and others\nlooked upon him in the same light; but he felt his need, and with\nhis burden of guilt and shame he came before God, asking for His[31]\nmercy. His heart was open for the Spirit of God to do its gracious\nwork and set him free from the power of sin. The Pharisee’s boastful,\nself-righteous prayer showed that his heart was closed against the\ninfluence of the Holy Spirit. Because of his distance from God, he\nhad no sense of his own defilement, in contrast with the perfection\nof the divine holiness. He felt no need, and he received nothing.\nIf you see your sinfulness, do not wait to make yourself better.\nHow many there are who think they are not good enough to come to\nChrist. Do you expect to become better through your own efforts?\n“Can the Ethiopian change his skin, or the leopard his spots? then\nmay ye also do good, that are accustomed to do evil.” Jeremiah\n13:23. There is help for us only in God. We must not wait for\nstronger persuasions, for better opportunities, or for holier tempers.\nWe can do nothing of ourselves. We must come to Christ just as we\nare.\nRepentance 21\nBut let none deceive themselves with the thought that God, in\nHis great love and mercy, will yet save even the rejecters of His\ngrace. The exceeding sinfulness of sin can be estimated only in the\nlight of the cross. When men urge that God is too good to cast off the\nsinner, let them look to Calvary. It was because there was no other\nway in which man could be saved, because without this sacrifice it\nwas impossible for the human race to escape from the defiling power\nof sin, and be restored to communion with holy beings,—impossible\nfor them again to become partakers of spiritual life,—it was because [32]\nof this that Christ took upon Himself the guilt of the disobedient and\nsuffered in the sinner’s stead. The love and suffering and death of\nthe Son of God all testify to the terrible enormity of sin and declare\nthat there is no escape from its power, no hope of the higher life, but\nthrough the submission of the soul to Christ.\nThe impenitent sometimes excuse themselves by saying of pro-\nfessed Christians, “I am as good as they are. They are no more\nself-denying, sober, or circumspect in their conduct than I am. They\nlove pleasure and self-indulgence as well as I do.” Thus they make\nthe faults of others an excuse for their own neglect of duty. But the\nsins and defects of others do not excuse anyone, for the Lord has not\ngiven us an erring human pattern. The spotless Son of God has been\ngiven as our example, and those who complain of the wrong course\nof professed Christians are the ones who should show better lives\nand nobler examples. If they have so high a conception of what a\nChristian should be, is not their own sin so much the greater? They\nknow what is right, and yet refuse to do it.\nBeware of procrastination. Do not put off the work of forsaking\nyour sins and seeking purity of heart through Jesus. Here is where\nthousands upon thousands have erred to their eternal loss. I will not\nhere dwell upon the shortness and uncertainty of life; but there is a\nterrible danger—a danger not sufficiently understood—in delaying\nto yield to the pleading voice of God’s Holy Spirit, in choosing to\nlive in sin; for such this delay really is. Sin, however small it may be [33]\nesteemed, can be indulged in only at the peril of infinite loss. What\nwe do not overcome, will overcome us and work out our destruction.\nAdam and Eve persuaded themselves that in so small a matter\nas eating of the forbidden fruit there could not result such terrible\nconsequences as God had declared. But this small matter was the\n22 Steps to Christ\ntransgression of God’s immutable and holy law, and it separated\nman from God and opened the floodgates of death and untold woe\nupon our world. Age after age there has gone up from our earth\na continual cry of mourning, and the whole creation groaneth and\ntravaileth together in pain as a consequence of man’s disobedience.\nHeaven itself has felt the effects of his rebellion against God. Calvary\nstands as a memorial of the amazing sacrifice required to atone for\nthe transgression of the divine law. Let us not regard sin as a trivial\nthing.\nEvery act of transgression, every neglect or rejection of the grace\nof Christ, is reacting upon yourself; it is hardening the heart, deprav-\ning the will, benumbing the understanding, and not only making\nyou less inclined to yield, but less capable of yielding, to the tender\npleading of God’s Holy Spirit.\nMany are quieting a troubled conscience with the thought that\nthey can change a course of evil when they choose; that they can trifle\nwith the invitations of mercy, and yet be again and again impressed.\nThey think that after doing despite to the Spirit of grace, after casting\ntheir influence on the side of Satan, in a moment of terrible extremity\nthey can change their course. But this is not so easily done. The\nexperience, the education, of a lifetime, has so thoroughly molded[34]\nthe character that few then desire to receive the image of Jesus.\nEven one wrong trait of character, one sinful desire, persistently\ncherished, will eventually neutralize all the power of the gospel.\nEvery sinful indulgence strengthens the soul’s aversion to God. The\nman who manifests an infidel hardihood, or a stolid indifference to\ndivine truth, is but reaping the harvest of that which he has himself\nsown. In all the Bible there is not a more fearful warning against\ntrifling with evil than the words of the wise man that the sinner “shall\nbe holden with the cords of his sins.” Proverbs 5:22.\nChrist is ready to set us free from sin, but He does not force the\nwill; and if by persistent transgression the will itself is wholly bent\non evil, and we do not desire to be set free, if we will not accept\nHis grace, what more can He do? We have destroyed ourselves by\nour determined rejection of His love. “Behold, now is the accepted\ntime; behold, now is the day of salvation.” “Today if ye will hear His\nvoice, harden not your hearts.” 2 Corinthians 6:2; Hebrews 3:7, 8.\nRepentance 23\n“Man looketh on the outward appearance, but the Lord looketh\non the heart”—the human heart, with its conflicting emotions of joy\nand sorrow; the wandering, wayward heart, which is the abode of so\nmuch impurity and deceit. 1 Samuel 16:7. He knows its motives, its\nvery intents and purposes. Go to Him with your soul all stained as it\nis. Like the psalmist, throw its chambers open to the all-seeing eye,\nexclaiming, “Search me, O God, and know my heart: try me, and\nknow my thoughts: and see if there be any wicked way in me, and [35]\nlead me in the way everlasting.” Psalm 139:23, 24.\nMany accept an intellectual religion, a form of godliness, when\nthe heart is not cleansed. Let it be your prayer, “Create in me a clean\nheart, O God; and renew a right spirit within me.” Psalm 51:10. Deal\ntruly with your own soul. Be as earnest, as persistent, as you would\nbe if your mortal life were at stake. This is a matter to be settled\nbetween God and your own soul, settled for eternity. A supposed\nhope, and nothing more, will prove your ruin.\nStudy God’s word prayerfully. That word presents before you, in\nthe law of God and the life of Christ, the great principles of holiness,\nwithout which “no man shall see the Lord.” Hebrews 12:14. It\nconvinces of sin; it plainly reveals the way of salvation. Give heed\nto it as the voice of God speaking to your soul.\nAs you see the enormity of sin, as you see yourself as you really\nare, do not give up to despair. It was sinners that Christ came to save.\nWe have not to reconcile God to us, but—O wondrous love!—God\nin Christ is “reconciling the world unto Himself.” 2 Corinthians 5:19.\nHe is wooing by His tender love the hearts of His erring children. No\nearthly parent could be as patient with the faults and mistakes of his\nchildren, as is God with those He seeks to save. No one could plead\nmore tenderly with the transgressor. No human lips ever poured\nout more tender entreaties to the wanderer than does He. All His\npromises, His warnings, are but the breathing of unutterable love.\nWhen Satan comes to tell you that you are a great sinner, look up [36]\nto your Redeemer and talk of His merits. That which will help you\nis to look to His light. Acknowledge your sin, but tell the enemy that\n“Christ Jesus came into the world to save sinners” and that you may\nbe saved by His matchless love. 1 Timothy 1:15. Jesus asked Simon\na question in regard to two debtors. One owed his Lord a small sum,\nand the other owed him a very large sum; but he forgave them both,\n24 Steps to Christ\nand Christ asked Simon which debtor would love his Lord most.\nSimon answered, “He to whom he forgave most.” Luke 7:43. We\nhave been great sinners, but Christ died that we might be forgiven.\nThe merits of His sacrifice are sufficient to present to the Father in\nour behalf. Those to whom He has forgiven most will love Him\nmost, and will stand nearest to His throne to praise Him for His great\nlove and infinite sacrifice. It is when we most fully comprehend the\nlove of God that we best realize the sinfulness of sin. When we see\nthe length of the chain that was let down for us, when we understand\nsomething of the infinite sacrifice that Christ has made in our behalf,\nthe heart is melted with tenderness and contrition.\nChapter 4—Confession [37]\n“He that covereth his sins shall not prosper: but whoso confesseth\nand forsaketh them shall have mercy.” Proverbs 28:13.\nThe conditions of obtaining mercy of God are simple and just\nand reasonable. The Lord does not require us to do some grievous\nthing in order that we may have the forgiveness of sin. We need not\nmake long and wearisome pilgrimages, or perform painful penances,\nto commend our souls to the God of heaven or to expiate our trans-\ngression; but he that confesseth and forsaketh his sin shall have\nmercy.\nThe apostle says, “Confess your faults one to another, and pray\none for another, that ye may be healed.” James 5:16. Confess your\nsins to God, who only can forgive them, and your faults to one\nanother. If you have given offense to your friend or neighbor, you\nare to acknowledge your wrong, and it is his duty freely to forgive\nyou. Then you are to seek the forgiveness of God, because the\nbrother you have wounded is the property of God, and in injuring\nhim you sinned against his Creator and Redeemer. The case is\nbrought before the only true Mediator, our great High Priest, who\n“was in all points tempted like as we are, yet without sin,” and who\nis “touched with the feeling of our infirmities,” and is able to cleanse\nfrom every stain of iniquity. Hebrews 4:15.\nThose who have not humbled their souls before God in acknowl-\nedging their guilt, have not yet fulfilled the first condition of accep- [38]\ntance. If we have not experienced that repentance which is not to\nbe repented of, and have not with true humiliation of soul and bro-\nkenness of spirit confessed our sins, abhorring our iniquity, we have\nnever truly sought for the forgiveness of sin; and if we have never\nsought, we have never found the peace of God. The only reason\nwhy we do not have remission of sins that are past is that we are not\nwilling to humble our hearts and comply with the conditions of the\nword of truth. Explicit instruction is given concerning this matter.\nConfession of sin, whether public or private, should be heartfelt and\n25\n26 Steps to Christ\nfreely expressed. It is not to be urged from the sinner. It is not to be\nmade in a flippant and careless way, or forced from those who have\nno realizing sense of the abhorrent character of sin. The confession\nthat is the outpouring of the inmost soul finds its way to the God of\ninfinite pity. The psalmist says, “The Lord is nigh unto them that are\nof a broken heart; and saveth such as be of a contrite spirit.” Psalm\n34:18.\nTrue confession is always of a specific character, and acknowl-\nedges particular sins. They may be of such a nature as to be brought\nbefore God only; they may be wrongs that should be confessed to\nindividuals who have suffered injury through them; or they may be\nof a public character, and should then be as publicly confessed. But\nall confession should be definite and to the point, acknowledging\nthe very sins of which you are guilty.\nIn the days of Samuel the Israelites wandered from God. They\nwere suffering the consequences of sin; for they had lost their faith[39]\nin God, lost their discernment of His power and wisdom to rule the\nnation, lost their confidence in His ability to defend and vindicate\nHis cause. They turned from the great Ruler of the universe and\ndesired to be governed as were the nations around them. Before they\nfound peace they made this definite confession: “We have added\nunto all our sins this evil, to ask us a king.” 1 Samuel 12:19. The\nvery sin of which they were convicted had to be confessed. Their\ningratitude oppressed their souls and severed them from God.\nConfession will not be acceptable to God without sincere repen-\ntance and reformation. There must be decided changes in the life;\neverything offensive to God must be put away. This will be the result\nof genuine sorrow for sin. The work that we have to do on our part\nis plainly set before us: “Wash you, make you clean; put away the\nevil of your doings from before Mine eyes; cease to do evil; learn to\ndo well; seek judgment, relieve the oppressed, judge the fatherless,\nplead for the widow.” Isaiah 1:16, 17. “If the wicked restore the\npledge, give again that he had robbed, walk in the statutes of life,\nwithout committing iniquity; he shall surely live, he shall not die.”\nEzekiel 33:15. Paul says, speaking of the work of repentance: “Ye\nsorrowed after a godly sort, what carefulness it wrought in you, yea,\nwhat clearing of yourselves, yea, what indignation, yea, what fear,\nyea, what vehement desire, yea, what zeal, yea, what revenge! In\nConfession 27\nall things ye have approved yourselves to be clear in this matter.” 2\nCorinthians 7:11.\nWhen sin has deadened the moral perceptions, the wrongdoer [40]\ndoes not discern the defects of his character nor realize the enormity\nof the evil he has committed; and unless he yields to the convicting\npower of the Holy Spirit he remains in partial blindness to his sin.\nHis confessions are not sincere and in earnest. To every acknowl-\nedgment of his guilt he adds an apology in excuse of his course,\ndeclaring that if it had not been for certain circumstances he would\nnot have done this or that for which he is reproved.\nAfter Adam and Eve had eaten of the forbidden fruit, they were\nfilled with a sense of shame and terror. At first their only thought\nwas how to excuse their sin and escape the dreaded sentence of\ndeath. When the Lord inquired concerning their sin, Adam replied,\nlaying the guilt partly upon God and partly upon his companion:\n“The woman whom Thou gavest to be with me, she gave me of the\ntree, and I did eat.” The woman put the blame upon the serpent,\nsaying, “The serpent beguiled me, and I did eat.” Genesis 3:12, 13.\nWhy did You make the serpent? Why did You suffer him to come\ninto Eden? These were the questions implied in her excuse for her\nsin, thus charging God with the responsibility of their fall. The\nspirit of self-justification originated in the father of lies and has been\nexhibited by all the sons and daughters of Adam. Confessions of this\norder are not inspired by the divine Spirit and will not be acceptable\nto God. True repentance will lead a man to bear his guilt himself\nand acknowledge it without deception or hypocrisy. Like the poor\npublican, not lifting up so much as his eyes unto heaven, he will cry,\n“God be merciful to me a sinner,” and those who do acknowledge [41]\ntheir guilt will be justified, for Jesus will plead His blood in behalf\nof the repentant soul.\nThe examples in God’s word of genuine repentance and humili-\nation reveal a spirit of confession in which there is no excuse for sin\nor attempt at self-justification. Paul did not seek to shield himself;\nhe paints his sin in its darkest hue, not attempting to lessen his guilt.\nHe says, “Many of the saints did I shut up in prison, having received\nauthority from the chief priests; and when they were put to death, I\ngave my voice against them. And I punished them oft in every syna-\ngogue, and compelled them to blaspheme; and being exceedingly\n28 Steps to Christ\nmad against them, I persecuted them even unto strange cities.” Acts\n26:10, 11. He does not hesitate to declare that “Christ Jesus came\ninto the world to save sinners; of whom I am chief.” 1 Timothy 1:15.\nThe humble and broken heart, subdued by genuine repentance,\nwill appreciate something of the love of God and the cost of Calvary;\nand as a son confesses to a loving father, so will the truly penitent\nbring all his sins before God. And it is written, “If we confess our\nsins, He is faithful and just to forgive us our sins, and to cleanse us\nfrom all unrighteousness.” 1 John 1:9.\nChapter 5—Consecration [42]\n[43]\nGod’s promise is, “Ye shall seek Me, and find Me, when ye shall\nsearch for Me with all your heart.” Jeremiah 29:13.\nThe whole heart must be yielded to God, or the change can never\nbe wrought in us by which we are to be restored to His likeness. By\nnature we are alienated from God. The Holy Spirit describes our\ncondition in such words as these: “Dead in trespasses and sins;” “the\nwhole head is sick, and the whole heart faint;” “no soundness in it.”\nWe are held fast in the snare of Satan, “taken captive by him at his\nwill.” Ephesians 2:1; Isaiah 1:5, 6; 2 Timothy 2:26. God desires to\nheal us, to set us free. But since this requires an entire transformation,\na renewing of our whole nature, we must yield ourselves wholly to\nHim.\nThe warfare against self is the greatest battle that was ever fought.\nThe yielding of self, surrendering all to the will of God, requires a\nstruggle; but the soul must submit to God before it can be renewed\nin holiness.\nThe government of God is not, as Satan would make it appear,\nfounded upon a blind submission, an unreasoning control. It appeals\nto the intellect and the conscience. “Come now, and let us reason\ntogether” is the Creator’s invitation to the beings He has made.\nIsaiah 1:18. God does not force the will of His creatures. He cannot\naccept an homage that is not willingly and intelligently given. A\nmere forced submission would prevent all real development of mind\nor character; it would make man a mere automaton. Such is not the [44]\npurpose of the Creator. He desires that man, the crowning work of\nHis creative power, shall reach the highest possible development.\nHe sets before us the height of blessing to which He desires to bring\nus through His grace. He invites us to give ourselves to Him, that\nHe may work His will in us. It remains for us to choose whether we\nwill be set free from the bondage of sin, to share the glorious liberty\nof the sons of God.\n29\n30 Steps to Christ\nIn giving ourselves to God, we must necessarily give up all that\nwould separate us from Him. Hence the Saviour says, “Whosoever\nhe be of you that forsaketh not all that he hath, he cannot be My\ndisciple.” Luke 14:33. Whatever shall draw away the heart from\nGod must be given up. Mammon is the idol of many. The love of\nmoney, the desire for wealth, is the golden chain that binds them\nto Satan. Reputation and worldly honor are worshiped by another\nclass. The life of selfish ease and freedom from responsibility is the\nidol of others. But these slavish bands must be broken. We cannot\nbe half the Lord’s and half the world’s. We are not God’s children\nunless we are such entirely.\nThere are those who profess to serve God, while they rely upon\ntheir own efforts to obey His law, to form a right character, and\nsecure salvation. Their hearts are not moved by any deep sense of\nthe love of Christ, but they seek to perform the duties of the Christian\nlife as that which God requires of them in order to gain heaven. Such\nreligion is worth nothing. When Christ dwells in the heart, the soul\nwill be so filled with His love, with the joy of communion with[45]\nHim, that it will cleave to Him; and in the contemplation of Him,\nself will be forgotten. Love to Christ will be the spring of action.\nThose who feel the constraining love of God, do not ask how little\nmay be given to meet the requirements of God; they do not ask\nfor the lowest standard, but aim at perfect conformity to the will of\ntheir Redeemer. With earnest desire they yield all and manifest an\ninterest proportionate to the value of the object which they seek. A\nprofession of Christ without this deep love is mere talk, dry formality,\nand heavy drudgery.\nDo you feel that it is too great a sacrifice to yield all to Christ?\nAsk yourself the question, “What has Christ given for me?” The Son\nof God gave all—life and love and suffering—for our redemption.\nAnd can it be that we, the unworthy objects of so great love, will\nwithhold our hearts from Him? Every moment of our lives we have\nbeen partakers of the blessings of His grace, and for this very reason\nwe cannot fully realize the depths of ignorance and misery from\nwhich we have been saved. Can we look upon Him whom our sins\nhave pierced, and yet be willing to do despite to all His love and\nsacrifice? In view of the infinite humiliation of the Lord of glory,\nConsecration 31\nshall we murmur because we can enter into life only through conflict\nand self-abasement?\nThe inquiry of many a proud heart is, “Why need I go in pen-\nitence and humiliation before I can have the assurance of my ac-\nceptance with God?” I point you to Christ. He was sinless, and,\nmore than this, He was the Prince of heaven; but in man’s behalf [46]\nHe became sin for the race. “He was numbered with the transgres-\nsors; and He bare the sin of many, and made intercession for the\ntransgressors.” Isaiah 53:12.\nBut what do we give up, when we give all? A sin-polluted heart,\nfor Jesus to purify, to cleanse by His own blood, and to save by\nHis matchless love. And yet men think it hard to give up all! I am\nashamed to hear it spoken of, ashamed to write it.\nGod does not require us to give up anything that it is for our best\ninterest to retain. In all that He does, He has the well-being of His\nchildren in view. Would that all who have not chosen Christ might\nrealize that He has something vastly better to offer them than they\nare seeking for themselves. Man is doing the greatest injury and\ninjustice to his own soul when he thinks and acts contrary to the will\nof God. No real joy can be found in the path forbidden by Him who\nknows what is best and who plans for the good of His creatures. The\npath of transgression is the path of misery and destruction.\nIt is a mistake to entertain the thought that God is pleased to see\nHis children suffer. All heaven is interested in the happiness of man.\nOur heavenly Father does not close the avenues of joy to any of His\ncreatures. The divine requirements call upon us to shun those indul-\ngences that would bring suffering and disappointment, that would\nclose to us the door of happiness and heaven. The world’s Redeemer\naccepts men as they are, with all their wants, imperfections, and\nweaknesses; and He will not only cleanse from sin and grant re-\ndemption through His blood, but will satisfy the heart-longing of all [47]\nwho consent to wear His yoke, to bear His burden. It is His purpose\nto impart peace and rest to all who come to Him for the bread of\nlife. He requires us to perform only those duties that will lead our\nsteps to heights of bliss to which the disobedient can never attain.\nThe true, joyous life of the soul is to have Christ formed within, the\nhope of glory.\n32 Steps to Christ\nMany are inquiring, “How am I to make the surrender of myself\nto God?” You desire to give yourself to Him, but you are weak in\nmoral power, in slavery to doubt, and controlled by the habits of your\nlife of sin. Your promises and resolutions are like ropes of sand. You\ncannot control your thoughts, your impulses, your affections. The\nknowledge of your broken promises and forfeited pledges weakens\nyour confidence in your own sincerity, and causes you to feel that\nGod cannot accept you; but you need not despair. What you need to\nunderstand is the true force of the will. This is the governing power\nin the nature of man, the power of decision, or of choice. Everything\ndepends on the right action of the will. The power of choice God\nhas given to men; it is theirs to exercise. You cannot change your\nheart, you cannot of yourself give to God its affections; but you can\nchoose to serve Him. You can give Him your will; He will then\nwork in you to will and to do according to His good pleasure. Thus\nyour whole nature will be brought under the control of the Spirit of\nChrist; your affections will be centered upon Him, your thoughts\nwill be in harmony with Him.\nDesires for goodness and holiness are right as far as they go; but[48]\nif you stop here, they will avail nothing. Many will be lost while\nhoping and desiring to be Christians. They do not come to the point\nof yielding the will to God. They do not nowchoose to be Christians.\nThrough the right exercise of the will, an entire change may\nbe made in your life. By yielding up your will to Christ, you ally\nyourself with the power that is above all principalities and powers.\nYou will have strength from above to hold you steadfast, and thus\nthrough constant surrender to God you will be enabled to live the\nnew life, even the life of faith.\nChapter 6—Faith and Acceptance [49]\nAs your conscience has been quickened by the Holy Spirit, you\nhave seen something of the evil of sin, of its power, its guilt, its\nwoe; and you look upon it with abhorrence. You feel that sin has\nseparated you from God, that you are in bondage to the power of\nevil. The more you struggle to escape, the more you realize your\nhelplessness. Your motives are impure; your heart is unclean. You\nsee that your life has been filled with selfishness and sin. You long\nto be forgiven, to be cleansed, to be set free. Harmony with God,\nlikeness to Him—what can you do to obtain it?\nIt is peace that you need—Heaven’s forgiveness and peace and\nlove in the soul. Money cannot buy it, intellect cannot procure it,\nwisdom cannot attain to it; you can never hope, by your own efforts,\nto secure it. But God offers it to you as a gift, “without money and\nwithout price.” Isaiah 55:1. It is yours if you will but reach out your\nhand and grasp it. The Lord says, “Though your sins be as scarlet,\nthey shall be as white as snow; though they be red like crimson, they\nshall be as wool.” Isaiah 1:18. “A new heart also will I give you, and\na new spirit will I put within you.” Ezekiel 36:26.\nYou have confessed your sins, and in heart put them away. You\nhave resolved to give yourself to God. Now go to Him, and ask\nthat He will wash away your sins and give you a new heart. Then\nbelieve that He does thisbecause He has promised. This is the lesson [50]\nwhich Jesus taught while He was on earth, that the gift which God\npromises us, we must believe we do receive, and it is ours. Jesus\nhealed the people of their diseases when they had faith in His power;\nHe helped them in the things which they could see, thus inspiring\nthem with confidence in Him concerning things which they could\nnot see—leading them to believe in His power to forgive sins. This\nHe plainly stated in the healing of the man sick with palsy: “That ye\nmay know that the Son of man hath power on earth to forgive sins,\n(then saith He to the sick of the palsy,) Arise, take up thy bed, and\ngo unto thine house.” Matthew 9:6. So also John the evangelist says,\n33\n34 Steps to Christ\nspeaking of the miracles of Christ, “These are written, that ye might\nbelieve that Jesus is the Christ, the Son of God; and that believing\nye might have life through His name.” John 20:31.\nFrom the simple Bible account of how Jesus healed the sick, we\nmay learn something about how to believe in Him for the forgiveness\nof sins. Let us turn to the story of the paralytic at Bethesda. The\npoor sufferer was helpless; he had not used his limbs for thirty-eight\nyears. Yet Jesus bade him, “Rise, take up thy bed, and walk.” The\nsick man might have said, “Lord, if Thou wilt make me whole, I\nwill obey Thy word.” But, no, he believed Christ’s word, believed\nthat he was made whole, and he made the effort at once; he willed\nto walk, and he did walk. He acted on the word of Christ, and God\ngave the power. He was made whole.\nIn like manner you are a sinner. You cannot atone for your past[51]\nsins; you cannot change your heart and make yourself holy. But\nGod promises to do all this for you through Christ. You believe that\npromise. You confess your sins and give yourself to God. Youwill\nto serve Him. Just as surely as you do this, God will fulfill His word\nto you. If you believe the promise,—believe that you are forgiven\nand cleansed,—God supplies the fact; you are made whole, just as\nChrist gave the paralytic power to walk when the man believed that\nhe was healed. It is so if you believe it.\nDo not wait to feel that you are made whole, but say, “I believe\nit; it is so, not because I feel it, but because God has promised.”\nJesus says, “What things soever ye desire, when ye pray, believe\nthat ye receive them, and ye shall have them.” Mark 11:24. There is\na condition to this promise—that we pray according to the will of\nGod. But it is the will of God to cleanse us from sin, to make us His\nchildren, and to enable us to live a holy life. So we may ask for these\nblessings, and believe that we receive them, and thank God that we\nhave received them. It is our privilege to go to Jesus and be cleansed,\nand to stand before the law without shame or remorse. “There is\ntherefore now no condemnation to them which are in Christ Jesus,\nwho walk not after the flesh, but after the Spirit.” Romans 8:1.\nHenceforth you are not your own; you are bought with a price.\n“Ye were not redeemed with corruptible things, as silver and gold; ...\nbut with the precious blood of Christ, as of a lamb without blemish\nand without spot.” 1 Peter 1:18, 19. Through this simple act of[52]\nFaith and Acceptance 35\nbelieving God, the Holy Spirit has begotten a new life in your heart.\nYou are as a child born into the family of God, and He loves you as\nHe loves His Son.\nNow that you have given yourself to Jesus, do not draw back, do\nnot take yourself away from Him, but day by day say, “I am Christ’s;\nI have given myself to Him;” and ask Him to give you His Spirit\nand keep you by His grace. As it is by giving yourself to God, and\nbelieving Him, that you become His child, so you are to live in Him.\nThe apostle says, “As ye have therefore received Christ Jesus the\nLord, so walk ye in Him.” Colossians 2:6.\nSome seem to feel that they must be on probation, and must\nprove to the Lord that they are reformed, before they can claim His\nblessing. But they may claim the blessing of God even now. They\nmust have His grace, the Spirit of Christ, to help their infirmities,\nor they cannot resist evil. Jesus loves to have us come to Him just\nas we are, sinful, helpless, dependent. We may come with all our\nweakness, our folly, our sinfulness, and fall at His feet in penitence.\nIt is His glory to encircle us in the arms of His love and to bind up\nour wounds, to cleanse us from all impurity.\nHere is where thousands fail; they do not believe that Jesus\npardons them personally, individually. They do not take God at His\nword. It is the privilege of all who comply with the conditions to\nknow for themselves that pardon is freely extended for every sin.\nPut away the suspicion that God’s promises are not meant for you.\nThey are for every repentant transgressor. Strength and grace have [53]\nbeen provided through Christ to be brought by ministering angels\nto every believing soul. None are so sinful that they cannot find\nstrength, purity, and righteousness in Jesus, who died for them. He\nis waiting to strip them of their garments stained and polluted with\nsin, and to put upon them the white robes of righteousness; He bids\nthem live and not die.\nGod does not deal with us as finite men deal with one another.\nHis thoughts are thoughts of mercy, love, and tenderest compassion.\nHe says, “Let the wicked forsake his way, and the unrighteous man\nhis thoughts: and let him return unto the Lord, and He will have\nmercy upon him; and to our God, for He will abundantly pardon.”\n“I have blotted out, as a thick cloud, thy transgressions, and, as a\ncloud, thy sins.” Isaiah 55:7; 44:22.\n36 Steps to Christ\n“I have no pleasure in the death of him that dieth, saith the Lord\nGod: wherefore turn yourselves, and live ye.” Ezekiel 18:32. Satan\nis ready to steal away the blessed assurances of God. He desires to\ntake every glimmer of hope and every ray of light from the soul; but\nyou must not permit him to do this. Do not give ear to the tempter,\nbut say, “Jesus has died that I might live. He loves me, and wills not\nthat I should perish. I have a compassionate heavenly Father; and\nalthough I have abused His love, though the blessings He has given\nme have been squandered, I will arise, and go to my Father, and say,\n‘I have sinned against heaven, and before Thee, and am no more\nworthy to be called Thy son: make me as one of Thy hired servants.’”\nThe parable tells you how the wanderer will be received: “When he[54]\nwas yet a great way off, his father saw him, and had compassion,\nand ran, and fell on his neck, and kissed him.” Luke 15:18-20.\nBut even this parable, tender and touching as it is, comes short\nof expressing the infinite compassion of the heavenly Father. The\nLord declares by His prophet, “I have loved thee with an everlasting\nlove: therefore with loving-kindness have I drawn thee.” Jeremiah\n31:3. While the sinner is yet far from the Father’s house, wasting his\nsubstance in a strange country, the Father’s heart is yearning over\nhim; and every longing awakened in the soul to return to God is but\nthe tender pleading of His Spirit, wooing, entreating, drawing the\nwanderer to his Father’s heart of love.\nWith the rich promises of the Bible before you, can you give\nplace to doubt? Can you believe that when the poor sinner longs to\nreturn, longs to forsake his sins, the Lord sternly withholds him from\ncoming to His feet in repentance? Away with such thoughts! Nothing\ncan hurt your own soul more than to entertain such a conception of\nour heavenly Father. He hates sin, but He loves the sinner, and He\ngave Himself in the person of Christ, that all who would might be\nsaved and have eternal blessedness in the kingdom of glory. What\nstronger or more tender language could have been employed than\nHe has chosen in which to express His love toward us? He declares,\n“Can a woman forget her sucking child, that she should not have\ncompassion on the son of her womb? yea, they may forget, yet will\nI not forget thee.” Isaiah 49:15.\nLook up, you that are doubting and trembling; for Jesus lives to[55]\nmake intercession for us. Thank God for the gift of His dear Son and\nFaith and Acceptance 37\npray that He may not have died for you in vain. The Spirit invites\nyou today. Come with your whole heart to Jesus, and you may claim\nHis blessing.\nAs you read the promises, remember they are the expression of\nunutterable love and pity. The great heart of Infinite Love is drawn\ntoward the sinner with boundless compassion. “We have redemption\nthrough His blood, the forgiveness of sins.” Ephesians 1:7. Yes, only\nbelieve that God is your helper. He wants to restore His moral image\nin man. As you draw near to Him with confession and repentance,\nHe will draw near to you with mercy and forgiveness.\nChapter 7—The Test of Discipleship[56]\n[57]\n“If any man be in Christ, he is a new creature: old things are\npassed away; behold, all things are become new.” 2 Corinthians\n5:17.\nA person may not be able to tell the exact time or place, or trace\nall the chain of circumstances in the process of conversion; but this\ndoes not prove him to be unconverted. Christ said to Nicodemus,\n“The wind bloweth where it listeth, and thou hearest the sound\nthereof, but canst not tell whence it cometh, and whither it goeth: so\nis everyone that is born of the Spirit.” John 3:8. Like the wind, which\nis invisible, yet the effects of which are plainly seen and felt, is the\nSpirit of God in its work upon the human heart. That regenerating\npower, which no human eye can see, begets a new life in the soul;\nit creates a new being in the image of God. While the work of the\nSpirit is silent and imperceptible, its effects are manifest. If the heart\nhas been renewed by the Spirit of God, the life will bear witness\nto the fact. While we cannot do anything to change our hearts or\nto bring ourselves into harmony with God; while we must not trust\nat all to ourselves or our good works, our lives will reveal whether\nthe grace of God is dwelling within us. A change will be seen in\nthe character, the habits, the pursuits. The contrast will be clear\nand decided between what they have been and what they are. The\ncharacter is revealed, not by occasional good deeds and occasional[58]\nmisdeeds, but by the tendency of the habitual words and acts.\nIt is true that there may be an outward correctness of deportment\nwithout the renewing power of Christ. The love of influence and\nthe desire for the esteem of others may produce a well-ordered life.\nSelf-respect may lead us to avoid the appearance of evil. A selfish\nheart may perform generous actions. By what means, then, shall we\ndetermine whose side we are on?\nWho has the heart? With whom are our thoughts? Of whom do\nwe love to converse? Who has our warmest affections and our best\nenergies? If we are Christ’s, our thoughts are with Him, and our\n38\nTest of Discipleship 39\nsweetest thoughts are of Him. All we have and are is consecrated to\nHim. We long to bear His image, breathe His spirit, do His will, and\nplease Him in all things.\nThose who become new creatures in Christ Jesus will bring forth\nthe fruits of the Spirit, “love, joy, peace, long-suffering, gentleness,\ngoodness, faith, meekness, temperance.” Galatians 5:22, 23. They\nwill no longer fashion themselves according to the former lusts, but\nby the faith of the Son of God they will follow in His steps, reflect\nHis character, and purify themselves even as He is pure. The things\nthey once hated they now love, and the things they once loved they\nhate. The proud and self-assertive become meek and lowly in heart.\nThe vain and supercilious become serious and unobtrusive. The\ndrunken become sober, and the profligate pure. The vain customs\nand fashions of the world are laid aside. Christians will seek not the\n“outward adorning,” but “the hidden man of the heart, in that which [59]\nis not corruptible, even the ornament of a meek and quiet spirit.” 1\nPeter 3:3, 4.\nThere is no evidence of genuine repentance unless it works\nreformation. If he restore the pledge, give again that he had robbed,\nconfess his sins, and love God and his fellow men, the sinner may\nbe sure that he has passed from death unto life.\nWhen, as erring, sinful beings, we come to Christ and become\npartakers of His pardoning grace, love springs up in the heart. Every\nburden is light, for the yoke that Christ imposes is easy. Duty\nbecomes a delight, and sacrifice a pleasure. The path that before\nseemed shrouded in darkness, becomes bright with beams from the\nSun of Righteousness.\nThe loveliness of the character of Christ will be seen in His\nfollowers. It was His delight to do the will of God. Love to God,\nzeal for His glory, was the controlling power in our Saviour’s life.\nLove beautified and ennobled all His actions. Love is of God. The\nunconsecrated heart cannot originate or produce it. It is found only\nin the heart where Jesus reigns. “We love, because He first loved\nus.” 1 John 4:19, R.V . In the heart renewed by divine grace, love\nis the principle of action. It modifies the character, governs the\nimpulses, controls the passions, subdues enmity, and ennobles the\naffections. This love, cherished in the soul, sweetens the life and\nsheds a refining influence on all around.\n40 Steps to Christ\nThere are two errors against which the children of God—particu-\nlarly those who have just come to trust in His grace—especially need\nto guard. The first, already dwelt upon, is that of looking to their\nown works, trusting to anything they can do, to bring themselves[60]\ninto harmony with God. He who is trying to become holy by his\nown works in keeping the law, is attempting an impossibility. All\nthat man can do without Christ is polluted with selfishness and sin.\nIt is the grace of Christ alone, through faith, that can make us holy.\nThe opposite and no less dangerous error is that belief in Christ\nreleases men from keeping the law of God; that since by faith alone\nwe become partakers of the grace of Christ, our works have nothing\nto do with our redemption.\nBut notice here that obedience is not a mere outward compliance,\nbut the service of love. The law of God is an expression of His very\nnature; it is an embodiment of the great principle of love, and hence\nis the foundation of His government in heaven and earth. If our hearts\nare renewed in the likeness of God, if the divine love is implanted\nin the soul, will not the law of God be carried out in the life? When\nthe principle of love is implanted in the heart, when man is renewed\nafter the image of Him that created him, the new-covenant promise is\nfulfilled, “I will put My laws into their hearts, and in their minds will\nI write them.” Hebrews 10:16. And if the law is written in the heart,\nwill it not shape the life? Obedience—the service and allegiance of\nlove—is the true sign of discipleship. Thus the Scripture says, “This\nis the love of God, that we keep His commandments.” “He that saith,\nI know Him, and keepeth not His commandments, is a liar, and the\ntruth is not in him.” 1 John 5:3; 2:4. Instead of releasing man from\nobedience, it is faith, and faith only, that makes us partakers of the[61]\ngrace of Christ, which enables us to render obedience.\nWe do not earn salvation by our obedience; for salvation is the\nfree gift of God, to be received by faith. But obedience is the fruit of\nfaith. “Ye know that He was manifested to take away our sins; and\nin Him is no sin. Whosoever abideth in Him sinneth not: whosoever\nsinneth hath not seen Him, neither known Him.” 1 John 3:5, 6. Here\nis the true test. If we abide in Christ, if the love of God dwells\nin us, our feelings, our thoughts, our purposes, our actions, will\nbe in harmony with the will of God as expressed in the precepts\nof His holy law. “Little children, let no man deceive you: he that\nTest of Discipleship 41\ndoeth righteousness is righteous, even as He is righteous.” 1 John\n3:7. Righteousness is defined by the standard of God’s holy law, as\nexpressed in the ten precepts given on Sinai.\nThat so-called faith in Christ which professes to release men from\nthe obligation of obedience to God, is not faith, but presumption.\n“By grace are ye saved through faith.” But “faith, if it hath not works,\nis dead.” Ephesians 2:8; James 2:17. Jesus said of Himself before He\ncame to earth, “I delight to do Thy will, O My God: yea, Thy law is\nwithin My heart.” Psalm 40:8. And just before He ascended again to\nheaven He declared, “I have kept My Father’s commandments, and\nabide in His love.” John 15:10. The Scripture says, “Hereby we do\nknow that we know Him, if we keep His commandments.... He that\nsaith he abideth in Him ought himself also so to walk even as He\nwalked.” 1 John 2:3-6. “Because Christ also suffered for us, leaving [62]\nus an example, that ye should follow His steps.” 1 Peter 2:21.\nThe condition of eternal life is now just what it always has\nbeen,—just what it was in Paradise before the fall of our first par-\nents,—perfect obedience to the law of God, perfect righteousness. If\neternal life were granted on any condition short of this, then the hap-\npiness of the whole universe would be imperiled. The way would be\nopen for sin, with all its train of woe and misery, to be immortalized.\nIt was possible for Adam, before the fall, to form a righteous\ncharacter by obedience to God’s law. But he failed to do this, and be-\ncause of his sin our natures are fallen and we cannot make ourselves\nrighteous. Since we are sinful, unholy, we cannot perfectly obey the\nholy law. We have no righteousness of our own with which to meet\nthe claims of the law of God. But Christ has made a way of escape\nfor us. He lived on earth amid trials and temptations such as we have\nto meet. He lived a sinless life. He died for us, and now He offers\nto take our sins and give us His righteousness. If you give yourself\nto Him, and accept Him as your Saviour, then, sinful as your life\nmay have been, for His sake you are accounted righteous. Christ’s\ncharacter stands in place of your character, and you are accepted\nbefore God just as if you had not sinned.\nMore than this, Christ changes the heart. He abides in your\nheart by faith. You are to maintain this connection with Christ by\nfaith and the continual surrender of your will to Him; and so long\nas you do this, He will work in you to will and to do according to [63]\n42 Steps to Christ\nHis good pleasure. So you may say, “The life which I now live in\nthe flesh I live by the faith of the Son of God, who loved me, and\ngave Himself for me.” Galatians 2:20. So Jesus said to His disciples,\n“It is not ye that speak, but the Spirit of your Father which speaketh\nin you.” Matthew 10:20. Then with Christ working in you, you will\nmanifest the same spirit and do the same good works—works of\nrighteousness, obedience.\nSo we have nothing in ourselves of which to boast. We have\nno ground for self-exaltation. Our only ground of hope is in the\nrighteousness of Christ imputed to us, and in that wrought by His\nSpirit working in and through us.\nWhen we speak of faith, there is a distinction that should be\nborne in mind. There is a kind of belief that is wholly distinct from\nfaith. The existence and power of God, the truth of His word, are\nfacts that even Satan and his hosts cannot at heart deny. The Bible\nsays that “the devils also believe, and tremble;” but this is not faith.\nJames 2:19. Where there is not only a belief in God’s word, but a\nsubmission of the will to Him; where the heart is yielded to Him,\nthe affections fixed upon Him, there is faith—faith that works by\nlove and purifies the soul. Through this faith the heart is renewed\nin the image of God. And the heart that in its unrenewed state is\nnot subject to the law of God, neither indeed can be, now delights\nin its holy precepts, exclaiming with the psalmist, “O how love I\nThy law! it is my meditation all the day.” Psalm 119:97. And the\nrighteousness of the law is fulfilled in us, “who walk not after the[64]\nflesh, but after the Spirit.” Romans 8:1.\nThere are those who have known the pardoning love of Christ\nand who really desire to be children of God, yet they realize that\ntheir character is imperfect, their life faulty, and they are ready to\ndoubt whether their hearts have been renewed by the Holy Spirit.\nTo such I would say, Do not draw back in despair. We shall often\nhave to bow down and weep at the feet of Jesus because of our\nshortcomings and mistakes, but we are not to be discouraged. Even\nif we are overcome by the enemy, we are not cast off, not forsaken\nand rejected of God. No; Christ is at the right hand of God, who also\nmaketh intercession for us. Said the beloved John, “These things\nwrite I unto you, that ye sin not. And if any man sin, we have an\nadvocate with the Father, Jesus Christ the righteous.” 1 John 2:1.\nTest of Discipleship 43\nAnd do not forget the words of Christ, “The Father Himself loveth\nyou.” John 16:27. He desires to restore you to Himself, to see His\nown purity and holiness reflected in you. And if you will but yield\nyourself to Him, He that hath begun a good work in you will carry\nit forward to the day of Jesus Christ. Pray more fervently; believe\nmore fully. As we come to distrust our own power, let us trust the\npower of our Redeemer, and we shall praise Him who is the health\nof our countenance.\nThe closer you come to Jesus, the more faulty you will appear in\nyour own eyes; for your vision will be clearer, and your imperfections\nwill be seen in broad and distinct contrast to His perfect nature. This\nis evidence that Satan’s delusions have lost their power; that the [65]\nvivifying influence of the Spirit of God is arousing you.\nNo deep-seated love for Jesus can dwell in the heart that does\nnot realize its own sinfulness. The soul that is transformed by the\ngrace of Christ will admire His divine character; but if we do not see\nour own moral deformity, it is unmistakable evidence that we have\nnot had a view of the beauty and excellence of Christ.\nThe less we see to esteem in ourselves, the more we shall see to\nesteem in the infinite purity and loveliness of our Saviour. A view of\nour sinfulness drives us to Him who can pardon; and when the soul,\nrealizing its helplessness, reaches out after Christ, He will reveal\nHimself in power. The more our sense of need drives us to Him and\nto the word of God, the more exalted views we shall have of His\ncharacter, and the more fully we shall reflect His image.\nChapter 8—Growing Up Into Christ[66]\n[67]\nThe change of heart by which we become children of God is in\nthe Bible spoken of as birth. Again, it is compared to the germination\nof the good seed sown by the husbandman. In like manner those\nwho are just converted to Christ are, “as new-born babes,” to “grow\nup” to the stature of men and women in Christ Jesus. 1 Peter 2:2;\nEphesians 4:15. Or like the good seed sown in the field, they are to\ngrow up and bring forth fruit. Isaiah says that they shall “be called\ntrees of righteousness, the planting of the Lord, that He might be\nglorified.” Isaiah 61:3. So from natural life, illustrations are drawn,\nto help us better to understand the mysterious truths of spiritual life.\nNot all the wisdom and skill of man can produce life in the\nsmallest object in nature. It is only through the life which God\nHimself has imparted, that either plant or animal can live. So it\nis only through the life from God that spiritual life is begotten in\nthe hearts of men. Unless a man is “born from above,” he cannot\nbecome a partaker of the life which Christ came to give. John 3:3,\nmargin.\nAs with life, so it is with growth. It is God who brings the bud\nto bloom and the flower to fruit. It is by His power that the seed\ndevelops, “first the blade, then the ear, after that the full corn in the\near.” Mark 4:28. And the prophet Hosea says of Israel, that “he shall\ngrow as the lily.” “They shall revive as the corn, and grow as the\nvine.” Hosea 14:5, 7. And Jesus bids us “consider the lilies how\nthey grow.” Luke 12:27. The plants and flowers grow not by their[68]\nown care or anxiety or effort, but by receiving that which God has\nfurnished to minister to their life. The child cannot, by any anxiety\nor power of its own, add to its stature. No more can you, by anxiety\nor effort of yourself, secure spiritual growth. The plant, the child,\ngrows by receiving from its surroundings that which ministers to\nits life—air, sunshine, and food. What these gifts of nature are to\nanimal and plant, such is Christ to those who trust in Him. He is\ntheir “everlasting light,” “a sun and shield.” Isaiah 60:19; Psalm\n44\nGrowing Up Into Christ 45\n84:11. He shall be as “the dew unto Israel.” “He shall come down\nlike rain upon the mown grass.” Hosea 14:5; Psalm 72:6. He is the\nliving water, “the Bread of God ... which cometh down from heaven,\nand giveth life unto the world.” John 6:33.\nIn the matchless gift of His Son, God has encircled the whole\nworld with an atmosphere of grace as real as the air which circulates\naround the globe. All who choose to breathe this life-giving atmo-\nsphere will live and grow up to the stature of men and women in\nChrist Jesus.\nAs the flower turns to the sun, that the bright beams may aid in\nperfecting its beauty and symmetry, so should we turn to the Sun\nof Righteousness, that heaven’s light may shine upon us, that our\ncharacter may be developed into the likeness of Christ.\nJesus teaches the same thing when He says, “Abide in Me, and I\nin you. As the branch cannot bear fruit of itself, except it abide in the\nvine; no more can ye, except ye abide in Me.... Without Me ye can [69]\ndo nothing.” John 15:4, 5. You are just as dependent upon Christ,\nin order to live a holy life, as is the branch upon the parent stock\nfor growth and fruitfulness. Apart from Him you have no life. You\nhave no power to resist temptation or to grow in grace and holiness.\nAbiding in Him, you may flourish. Drawing your life from Him,\nyou will not wither nor be fruitless. You will be like a tree planted\nby the rivers of water.\nMany have an idea that they must do some part of the work\nalone. They have trusted in Christ for the forgiveness of sin, but now\nthey seek by their own efforts to live aright. But every such effort\nmust fail. Jesus says, “Without Me ye can do nothing.” Our growth\nin grace, our joy, our usefulness,—all depend upon our union with\nChrist. It is by communion with Him, daily, hourly,—by abiding in\nHim,—that we are to grow in grace. He is not only the Author, but\nthe Finisher of our faith. It is Christ first and last and always. He is\nto be with us, not only at the beginning and the end of our course,\nbut at every step of the way. David says, “I have set the Lord always\nbefore me: because He is at my right hand, I shall not be moved.”\nPsalm 16:8.\nDo you ask, “How am I to abide in Christ?” In the same way\nas you received Him at first. “As ye have therefore received Christ\nJesus the Lord, so walk ye in Him.” “The just shall live by faith.”\n46 Steps to Christ\nColossians 2:6; Hebrews 10:38. You gave yourself to God, to be\nHis wholly, to serve and obey Him, and you took Christ as your\nSaviour. You could not yourself atone for your sins or change your\nheart; but having given yourself to God, you believe that He for[70]\nChrist’s sake did all this for you. By faith you became Christ’s, and\nby faith you are to grow up in Him—by giving and taking. You are\nto give all,—your heart, your will, your service,—give yourself to\nHim to obey all His requirements; and you must take all,—Christ,\nthe fullness of all blessing, to abide in your heart, to be your strength,\nyour righteousness, your everlasting helper,—to give you power to\nobey.\nConsecrate yourself to God in the morning; make this your\nvery first work. Let your prayer be, “Take me, O Lord, as wholly\nThine. I lay all my plans at Thy feet. Use me today in Thy service.\nAbide with me, and let all my work be wrought in Thee.” This is a\ndaily matter. Each morning consecrate yourself to God for that day.\nSurrender all your plans to Him, to be carried out or given up as His\nprovidence shall indicate. Thus day by day you may be giving your\nlife into the hands of God, and thus your life will be molded more\nand more after the life of Christ.\nA life in Christ is a life of restfulness. There may be no ecstasy\nof feeling, but there should be an abiding, peaceful trust. Your hope\nis not in yourself; it is in Christ. Your weakness is united to His\nstrength, your ignorance to His wisdom, your frailty to His enduring\nmight. So you are not to look to yourself, not to let the mind dwell\nupon self, but look to Christ. Let the mind dwell upon His love, upon\nthe beauty, the perfection, of His character. Christ in His self-denial,\nChrist in His humiliation, Christ in His purity and holiness, Christ in[71]\nHis matchless love—this is the subject for the soul’s contemplation.\nIt is by loving Him, copying Him, depending wholly upon Him, that\nyou are to be transformed into His likeness.\nJesus says, “Abide in Me.” These words convey the idea of rest,\nstability, confidence. Again He invites, “Come unto Me, ... and I will\ngive you rest.” Matthew 11:28. The words of the psalmist express\nthe same thought: “Rest in the Lord, and wait patiently for Him.”\nAnd Isaiah gives the assurance, “In quietness and in confidence shall\nbe your strength.” Psalm 37:7; Isaiah 30:15. This rest is not found in\ninactivity; for in the Saviour’s invitation the promise of rest is united\nGrowing Up Into Christ 47\nwith the call to labor: “Take My yoke upon you: ... and ye shall find\nrest.” Matthew 11:29. The heart that rests most fully upon Christ\nwill be most earnest and active in labor for Him.\nWhen the mind dwells upon self, it is turned away from Christ,\nthe source of strength and life. Hence it is Satan’s constant effort\nto keep the attention diverted from the Saviour and thus prevent the\nunion and communion of the soul with Christ. The pleasures of the\nworld, life’s cares and perplexities and sorrows, the faults of others,\nor your own faults and imperfections—to any or all of these he will\nseek to divert the mind. Do not be misled by his devices. Many who\nare really conscientious, and who desire to live for God, he too often\nleads to dwell upon their own faults and weaknesses, and thus by\nseparating them from Christ he hopes to gain the victory. We should [72]\nnot make self the center and indulge anxiety and fear as to whether\nwe shall be saved. All this turns the soul away from the Source of\nour strength. Commit the keeping of your soul to God, and trust in\nHim. Talk and think of Jesus. Let self be lost in Him. Put away all\ndoubt; dismiss your fears. Say with the apostle Paul, “I live; yet not\nI, but Christ liveth in me: and the life which I now live in the flesh I\nlive by the faith of the Son of God, who loved me, and gave Himself\nfor me.” Galatians 2:20. Rest in God. He is able to keep that which\nyou have committed to Him. If you will leave yourself in His hands,\nHe will bring you off more than conqueror through Him that has\nloved you.\nWhen Christ took human nature upon Him, He bound humanity\nto Himself by a tie of love that can never be broken by any power save\nthe choice of man himself. Satan will constantly present allurements\nto induce us to break this tie—to choose to separate ourselves from\nChrist. Here is where we need to watch, to strive, to pray, that\nnothing may entice us to choose another master; for we are always\nfree to do this. But let us keep our eyes fixed upon Christ, and He\nwill preserve us. Looking unto Jesus, we are safe. Nothing can pluck\nus out of His hand. In constantly beholding Him, we “are changed\ninto the same image from glory to glory, even as by the Spirit of the\nLord.” 2 Corinthians 3:18.\nIt was thus that the early disciples gained their likeness to the\ndear Saviour. When those disciples heard the words of Jesus, they\nfelt their need of Him. They sought, they found, they followed\n48 Steps to Christ\nHim. They were with Him in the house, at the table, in the closet,[73]\nin the field. They were with Him as pupils with a teacher, daily\nreceiving from His lips lessons of holy truth. They looked to Him,\nas servants to their master, to learn their duty. Those disciples were\nmen “subject to like passions as we are.” James 5:17. They had the\nsame battle with sin to fight. They needed the same grace, in order\nto live a holy life.\nEven John, the beloved disciple, the one who most fully reflected\nthe likeness of the Saviour, did not naturally possess that loveliness\nof character. He was not only self-assertive and ambitious for honor,\nbut impetuous, and resentful under injuries. But as the character of\nthe Divine One was manifested to him, he saw his own deficiency\nand was humbled by the knowledge. The strength and patience, the\npower and tenderness, the majesty and meekness, that he beheld\nin the daily life of the Son of God, filled his soul with admiration\nand love. Day by day his heart was drawn out toward Christ, until\nhe lost sight of self in love for his Master. His resentful, ambitious\ntemper was yielded to the molding power of Christ. The regenerating\ninfluence of the Holy Spirit renewed his heart. The power of the\nlove of Christ wrought a transformation of character. This is the\nsure result of union with Jesus. When Christ abides in the heart, the\nwhole nature is transformed. Christ’s Spirit, His love, softens the\nheart, subdues the soul, and raises the thoughts and desires toward\nGod and heaven.\nWhen Christ ascended to heaven, the sense of His presence was\nstill with His followers. It was a personal presence, full of love and[74]\nlight. Jesus, the Saviour, who had walked and talked and prayed\nwith them, who had spoken hope and comfort to their hearts, had,\nwhile the message of peace was still upon His lips, been taken up\nfrom them into heaven, and the tones of His voice had come back\nto them, as the cloud of angels received Him—“Lo, I am with you\nalway, even unto the end of the world.” Matthew 28:20. He had\nascended to heaven in the form of humanity. They knew that He\nwas before the throne of God, their Friend and Saviour still; that\nHis sympathies were unchanged; that He was still identified with\nsuffering humanity. He was presenting before God the merits of\nHis own precious blood, showing His wounded hands and feet, in\nremembrance of the price He had paid for His redeemed. They knew\nGrowing Up Into Christ 49\nthat He had ascended to heaven to prepare places for them, and that\nHe would come again and take them to Himself.\nAs they met together after the ascension they were eager to\npresent their requests to the Father in the name of Jesus. In solemn\nawe they bowed in prayer, repeating the assurance, “Whatsoever\nye shall ask the Father in My name, He will give it you. Hitherto\nhave ye asked nothing in My name: ask, and ye shall receive, that\nyour joy may be full.” John 16:23, 24. They extended the hand of\nfaith higher and higher with the mighty argument, “It is Christ that\ndied, yea rather, that is risen again, who is even at the right hand\nof God, who also maketh intercession for us.” Romans 8:34. And\nPentecost brought them the presence of the Comforter, of whom\nChrist had said, He “shall be in you.” And He had further said, “It is [75]\nexpedient for you that I go away: for if I go not away, the Comforter\nwill not come unto you; but if I depart, I will send Him unto you.”\nJohn 14:17; 16:7. Henceforth through the Spirit, Christ was to abide\ncontinually in the hearts of His children. Their union with Him was\ncloser than when He was personally with them. The light, and love,\nand power of the indwelling Christ shone out through them, so that\nmen, beholding, “marveled; and they took knowledge of them, that\nthey had been with Jesus.” Acts 4:13.\nAll that Christ was to the disciples, He desires to be to His\nchildren today; for in that last prayer, with the little band of disciples\ngathered about Him, He said, “Neither pray I for these alone, but\nfor them also which shall believe on Me through their word.” John\n17:20.\nJesus prayed for us, and He asked that we might be one with\nHim, even as He is one with the Father. What a union is this! The\nSaviour has said of Himself, “The Son can do nothing of Himself;”\n“the Father that dwelleth in Me, He doeth the works.” John 5:19;\n14:10. Then if Christ is dwelling in our hearts, He will work in us\n“both to will and to do of His good pleasure.” Philippians 2:13. We\nshall work as He worked; we shall manifest the same spirit. And\nthus, loving Him and abiding in Him, we shall “grow up into Him\nin all things, which is the head, even Christ.” Ephesians 4:15.\nChapter 9—The Work and the Life[76]\n[77]\nGod is the source of life and light and joy to the universe. Like\nrays of light from the sun, like the streams of water bursting from a\nliving spring, blessings flow out from Him to all His creatures. And\nwherever the life of God is in the hearts of men, it will flow out to\nothers in love and blessing.\nOur Saviour’s joy was in the uplifting and redemption of fallen\nmen. For this He counted not His life dear unto Himself, but endured\nthe cross, despising the shame. So angels are ever engaged in work-\ning for the happiness of others. This is their joy. That which selfish\nhearts would regard as humiliating service, ministering to those who\nare wretched and in every way inferior in character and rank, is the\nwork of sinless angels. The spirit of Christ’s self-sacrificing love is\nthe spirit that pervades heaven and is the very essence of its bliss.\nThis is the spirit that Christ’s followers will possess, the work that\nthey will do.\nWhen the love of Christ is enshrined in the heart, like sweet\nfragrance it cannot be hidden. Its holy influence will be felt by all\nwith whom we come in contact. The spirit of Christ in the heart is\nlike a spring in the desert, flowing to refresh all and making those\nwho are ready to perish, eager to drink of the water of life.\nLove to Jesus will be manifested in a desire to work as He\nworked for the blessing and uplifting of humanity. It will lead[78]\nto love, tenderness, and sympathy toward all the creatures of our\nheavenly Father’s care.\nThe Saviour’s life on earth was not a life of ease and devotion\nto Himself, but He toiled with persistent, earnest, untiring effort\nfor the salvation of lost mankind. From the manger to Calvary He\nfollowed the path of self-denial and sought not to be released from\narduous tasks, painful travels and exhausting care and labor. He said,\n“The Son of man came not to be ministered unto, but to minister,\nand to give His life a ransom for many.” Matthew 20:28. This was\nthe one great object of His life. Everything else was secondary and\n50\nWork and the Life 51\nsubservient. It was His meat and drink to do the will of God and to\nfinish His work. Self and self-interest had no part in His labor.\nSo those who are the partakers of the grace of Christ will be\nready to make any sacrifice, that others for whom He died may share\nthe heavenly gift. They will do all they can to make the world better\nfor their stay in it. This spirit is the sure outgrowth of a soul truly\nconverted. No sooner does one come to Christ than there is born in\nhis heart a desire to make known to others what a precious friend he\nhas found in Jesus; the saving and sanctifying truth cannot be shut\nup in his heart. If we are clothed with the righteousness of Christ\nand are filled with the joy of His indwelling Spirit, we shall not be\nable to hold our peace. If we have tasted and seen that the Lord is\ngood we shall have something to tell. Like Philip when he found the\nSaviour, we shall invite others into His presence. We shall seek to\npresent to them the attractions of Christ and the unseen realities of [79]\nthe world to come. There will be an intensity of desire to follow in\nthe path that Jesus trod. There will be an earnest longing that those\naround us may “behold the Lamb of God, which taketh away the sin\nof the world.” John 1:29.\nAnd the effort to bless others will react in blessings upon our-\nselves. This was the purpose of God in giving us a part to act in the\nplan of redemption. He has granted men the privilege of becoming\npartakers of the divine nature and, in their turn, of diffusing blessings\nto their fellow men. This is the highest honor, the greatest joy, that\nit is possible for God to bestow upon men. Those who thus become\nparticipants in labors of love are brought nearest to their Creator.\nGod might have committed the message of the gospel, and all\nthe work of loving ministry, to the heavenly angels. He might have\nemployed other means for accomplishing His purpose. But in His\ninfinite love He chose to make us co-workers with Himself, with\nChrist and the angels, that we might share the blessing, the joy, the\nspiritual uplifting, which results from this unselfish ministry.\nWe are brought into sympathy with Christ through the fellowship\nof His sufferings. Every act of self-sacrifice for the good of others\nstrengthens the spirit of beneficence in the giver’s heart, allying him\nmore closely to the Redeemer of the world, who “was rich, yet for\nyour sakes ... became poor, that ye through His poverty might be\n52 Steps to Christ\nrich.” 2 Corinthians 8:9. And it is only as we thus fulfill the divine\npurpose in our creation that life can be a blessing to us. [80]\nIf you will go to work as Christ designs that His disciples shall,\nand win souls for Him, you will feel the need of a deeper experience\nand a greater knowledge in divine things, and will hunger and thirst\nafter righteousness. You will plead with God, and your faith will\nbe strengthened, and your soul will drink deeper drafts at the well\nof salvation. Encountering opposition and trials will drive you to\nthe Bible and prayer. You will grow in grace and the knowledge of\nChrist, and will develop a rich experience.\nThe spirit of unselfish labor for others gives depth, stability, and\nChristlike loveliness to the character, and brings peace and happiness\nto its possessor. The aspirations are elevated. There is no room for\nsloth or selfishness. Those who thus exercise the Christian graces\nwill grow and will become strong to work for God. They will have\nclear spiritual perceptions, a steady, growing faith, and an increased\npower in prayer. The Spirit of God, moving upon their spirit, calls\nforth the sacred harmonies of the soul in answer to the divine touch.\nThose who thus devote themselves to unselfish effort for the good\nof others are most surely working out their own salvation.\nThe only way to grow in grace is to be disinterestedly doing the\nvery work which Christ has enjoined upon us—to engage, to the\nextent of our ability, in helping and blessing those who need the help\nwe can give them. Strength comes by exercise; activity is the very\ncondition of life. Those who endeavor to maintain Christian life\nby passively accepting the blessings that come through the means\nof grace, and doing nothing for Christ, are simply trying to live by[81]\neating without working. And in the spiritual as in the natural world,\nthis always results in degeneration and decay. A man who would\nrefuse to exercise his limbs would soon lose all power to use them.\nThus the Christian who will not exercise his God-given powers not\nonly fails to grow up into Christ, but he loses the strength that he\nalready had.\nThe church of Christ is God’s appointed agency for the salvation\nof men. Its mission is to carry the gospel to the world. And the\nobligation rests upon all Christians. Everyone, to the extent of his\ntalent and opportunity, is to fulfill the Saviour’s commission. The\nlove of Christ, revealed to us, makes us debtors to all who know\nWork and the Life 53\nHim not. God has given us light, not for ourselves alone, but to shed\nupon them.\nIf the followers of Christ were awake to duty, there would be\nthousands where there is one today proclaiming the gospel in heathen\nlands. And all who could not personally engage in the work, would\nyet sustain it with their means, their sympathy, and their prayers.\nAnd there would be far more earnest labor for souls in Christian\ncountries.\nWe need not go to heathen lands, or even leave the narrow circle\nof the home, if it is there that our duty lies, in order to work for\nChrist. We can do this in the home circle, in the church, among\nthose with whom we associate, and with whom we do business.\nThe greater part of our Saviour’s life on earth was spent in patient\ntoil in the carpenter’s shop at Nazareth. Ministering angels attended\nthe Lord of life as He walked side by side with peasants and laborers, [82]\nunrecognized and unhonored. He was as faithfully fulfilling His\nmission while working at His humble trade as when He healed the\nsick or walked upon the storm-tossed waves of Galilee. So in the\nhumblest duties and lowliest positions of life, we may walk and\nwork with Jesus.\nThe apostle says, “Let every man, wherein he is called, therein\nabide with God.” 1 Corinthians 7:24. The businessman may conduct\nhis business in a way that will glorify his Master because of his\nfidelity. If he is a true follower of Christ he will carry his religion\ninto everything that is done and reveal to men the spirit of Christ.\nThe mechanic may be a diligent and faithful representative of Him\nwho toiled in the lowly walks of life among the hills of Galilee.\nEveryone who names the name of Christ should so work that others,\nby seeing his good works, may be led to glorify their Creator and\nRedeemer.\nMany have excused themselves from rendering their gifts to\nthe service of Christ because others were possessed of superior\nendowments and advantages. The opinion has prevailed that only\nthose who are especially talented are required to consecrate their\nabilities to the service of God. It has come to be understood by many\nthat talents are given to only a certain favored class to the exclusion\nof others who of course are not called upon to share in the toils or\nthe rewards. But it is not so represented in the parable. When the\n54 Steps to Christ\nmaster of the house called his servants, he gave to every man his\nwork.\nWith a loving spirit we may perform life’s humblest duties “as to[83]\nthe Lord.” Colossians 3:23. If the love of God is in the heart, it will\nbe manifested in the life. The sweet savor of Christ will surround\nus, and our influence will elevate and bless.\nYou are not to wait for great occasions or to expect extraordinary\nabilities before you go to work for God. You need not have a thought\nof what the world will think of you. If your daily life is a testimony\nto the purity and sincerity of your faith, and others are convinced\nthat you desire to benefit them, your efforts will not be wholly lost.\nThe humblest and poorest of the disciples of Jesus can be a\nblessing to others. They may not realize that they are doing any\nspecial good, but by their unconscious influence they may start waves\nof blessing that will widen and deepen, and the blessed results they\nmay never know until the day of final reward. They do not feel or\nknow that they are doing anything great. They are not required to\nweary themselves with anxiety about success. They have only to\ngo forward quietly, doing faithfully the work that God’s providence\nassigns, and their life will not be in vain. Their own souls will be\ngrowing more and more into the likeness of Christ; they are workers\ntogether with God in this life and are thus fitting for the higher work\nand the unshadowed joy of the life to come.\nChapter 10—A Knowledge of God [84]\n[85]\nMany are the ways in which God is seeking to make Himself\nknown to us and bring us into communion with Him. Nature speaks\nto our senses without ceasing. The open heart will be impressed with\nthe love and glory of God as revealed through the works of His hands.\nThe listening ear can hear and understand the communications of\nGod through the things of nature. The green fields, the lofty trees,\nthe buds and flowers, the passing cloud, the falling rain, the babbling\nbrook, the glories of the heavens, speak to our hearts, and invite us\nto become acquainted with Him who made them all.\nOur Saviour bound up His precious lessons with the things of\nnature. The trees, the birds, the flowers of the valleys, the hills,\nthe lakes, and the beautiful heavens, as well as the incidents and\nsurroundings of daily life, were all linked with the words of truth,\nthat His lessons might thus be often recalled to mind, even amid the\nbusy cares of man’s life of toil.\nGod would have His children appreciate His works and delight\nin the simple, quiet beauty with which He has adorned our earthly\nhome. He is a lover of the beautiful, and above all that is outwardly\nattractive He loves beauty of character; He would have us cultivate\npurity and simplicity, the quiet graces of the flowers.\nIf we will but listen, God’s created works will teach us precious\nlessons of obedience and trust. From the stars that in their trackless [86]\ncourses through space follow from age to age their appointed path,\ndown to the minutest atom, the things of nature obey the Creator’s\nwill. And God cares for everything and sustains everything that He\nhas created. He who upholds the unnumbered worlds throughout\nimmensity, at the same time cares for the wants of the little brown\nsparrow that sings its humble song without fear. When men go forth\nto their daily toil, as when they engage in prayer; when they lie\ndown at night, and when they rise in the morning; when the rich\nman feasts in his palace, or when the poor man gathers his children\nabout the scanty board, each is tenderly watched by the heavenly\n55\n56 Steps to Christ\nFather. No tears are shed that God does not notice. There is no smile\nthat He does not mark.\nIf we would but fully believe this, all undue anxieties would be\ndismissed. Our lives would not be so filled with disappointment as\nnow; for everything, whether great or small, would be left in the\nhands of God, who is not perplexed by the multiplicity of cares, or\noverwhelmed by their weight. We should then enjoy a rest of soul to\nwhich many have long been strangers.\nAs your senses delight in the attractive loveliness of the earth,\nthink of the world that is to come, that shall never know the blight\nof sin and death; where the face of nature will no more wear the\nshadow of the curse. Let your imagination picture the home of the\nsaved, and remember that it will be more glorious than your brightest\nimagination can portray. In the varied gifts of God in nature we\nsee but the faintest gleaming of His glory. It is written, “Eye hath[87]\nnot seen, nor ear heard, neither have entered into the heart of man,\nthe things which God hath prepared for them that love Him.” 1\nCorinthians 2:9.\nThe poet and the naturalist have many things to say about nature,\nbut it is the Christian who enjoys the beauty of the earth with the\nhighest appreciation, because he recognizes his Father’s handiwork\nand perceives His love in flower and shrub and tree. No one can\nfully appreciate the significance of hill and vale, river and sea, who\ndoes not look upon them as an expression of God’s love to man.\nGod speaks to us through His providential workings and through\nthe influence of His Spirit upon the heart. In our circumstances and\nsurroundings, in the changes daily taking place around us, we may\nfind precious lessons if our hearts are but open to discern them. The\npsalmist, tracing the work of God’s providence, says, “The earth is\nfull of the goodness of the Lord.” “Whoso is wise, and will observe\nthese things, even they shall understand the loving-kindness of the\nLord.” Psalm 33:5; 107:43.\nGod speaks to us in His word. Here we have in clearer lines\nthe revelation of His character, of His dealings with men, and the\ngreat work of redemption. Here is open before us the history of\npatriarchs and prophets and other holy men of old. They were men\n“subject to like passions as we are.” James 5:17. We see how they\nstruggled through discouragements like our own, how they fell under\nKnowledge of God 57\ntemptation as we have done, and yet took heart again and conquered\nthrough the grace of God; and, beholding, we are encouraged in our [88]\nstriving after righteousness. As we read of the precious experiences\ngranted them, of the light and love and blessing it was theirs to\nenjoy, and of the work they wrought through the grace given them,\nthe spirit that inspired them kindles a flame of holy emulation in our\nhearts and a desire to be like them in character—like them to walk\nwith God.\nJesus said of the Old Testament Scriptures,—and how much\nmore is it true of the New,—“They are they which testify of Me,”\nthe Redeemer, Him in whom our hopes of eternal life are centered.\nJohn 5:39. Yes, the whole Bible tells of Christ. From the first record\nof creation—for “without Him was not anything made that was\nmade”—to the closing promise, “Behold, I come quickly,” we are\nreading of His works and listening to His voice. John 1:3; Revelation\n22:12. If you would become acquainted with the Saviour, study the\nHoly Scriptures.\nFill the whole heart with the words of God. They are the living\nwater, quenching your burning thirst. They are the living bread\nfrom heaven. Jesus declares, “Except ye eat the flesh of the Son of\nman, and drink His blood, ye have no life in you.” And He explains\nHimself by saying, “The words that I speak unto you, they are spirit,\nand they are life.” John 6:53, 63. Our bodies are built up from\nwhat we eat and drink; and as in the natural economy, so in the\nspiritual economy: it is what we meditate upon that will give tone\nand strength to our spiritual nature.\nThe theme of redemption is one that the angels desire to look\ninto; it will be the science and the song of the redeemed throughout\nthe ceaseless ages of eternity. Is it not worthy of careful thought [89]\nand study now? The infinite mercy and love of Jesus, the sacrifice\nmade in our behalf, call for the most serious and solemn reflection.\nWe should dwell upon the character of our dear Redeemer and Inter-\ncessor. We should meditate upon the mission of Him who came to\nsave His people from their sins. As we thus contemplate heavenly\nthemes, our faith and love will grow stronger, and our prayers will\nbe more and more acceptable to God, because they will be more and\nmore mixed with faith and love. They will be intelligent and fervent.\nThere will be more constant confidence in Jesus, and a daily, living\n58 Steps to Christ\nexperience in His power to save to the uttermost all that come unto\nGod by Him.\nAs we meditate upon the perfections of the Saviour, we shall\ndesire to be wholly transformed and renewed in the image of His\npurity. There will be a hungering and thirsting of soul to become\nlike Him whom we adore. The more our thoughts are upon Christ,\nthe more we shall speak of Him to others and represent Him to the\nworld.\nThe Bible was not written for the scholar alone; on the contrary,\nit was designed for the common people. The great truths necessary\nfor salvation are made as clear as noonday; and none will mistake\nand lose their way except those who follow their own judgment\ninstead of the plainly revealed will of God.\nWe should not take the testimony of any man as to what the\nScriptures teach, but should study the words of God for ourselves. If\nwe allow others to do our thinking, we shall have crippled energies\nand contracted abilities. The noble powers of the mind may be so[90]\ndwarfed by lack of exercise on themes worthy of their concentration\nas to lose their ability to grasp the deep meaning of the word of God.\nThe mind will enlarge if it is employed in tracing out the relation\nof the subjects of the Bible, comparing scripture with scripture and\nspiritual things with spiritual.\nThere is nothing more calculated to strengthen the intellect than\nthe study of the Scriptures. No other book is so potent to elevate\nthe thoughts, to give vigor to the faculties, as the broad, ennobling\ntruths of the Bible. If God’s word were studied as it should be, men\nwould have a breadth of mind, a nobility of character, and a stability\nof purpose rarely seen in these times.\nBut there is but little benefit derived from a hasty reading of the\nScriptures. One may read the whole Bible through and yet fail to\nsee its beauty or comprehend its deep and hidden meaning. One\npassage studied until its significance is clear to the mind and its\nrelation to the plan of salvation is evident, is of more value than the\nperusal of many chapters with no definite purpose in view and no\npositive instruction gained. Keep your Bible with you. As you have\nopportunity, read it; fix the texts in your memory. Even while you\nare walking the streets you may read a passage and meditate upon it,\nthus fixing it in the mind.\nKnowledge of God 59\nWe cannot obtain wisdom without earnest attention and prayer-\nful study. Some portions of Scripture are indeed too plain to be\nmisunderstood, but there are others whose meaning does not lie on\nthe surface to be seen at a glance. Scripture must be compared with [91]\nscripture. There must be careful research and prayerful reflection.\nAnd such study will be richly repaid. As the miner discovers veins\nof precious metal concealed beneath the surface of the earth, so will\nhe who perseveringly searches the word of God as for hid treasure\nfind truths of the greatest value, which are concealed from the view\nof the careless seeker. The words of inspiration, pondered in the\nheart, will be as streams flowing from the fountain of life.\nNever should the Bible be studied without prayer. Before open-\ning its pages we should ask for the enlightenment of the Holy Spirit,\nand it will be given. When Nathanael came to Jesus, the Saviour\nexclaimed, “Behold an Israelite indeed, in whom is no guile!”\nNathanael said, “Whence knowest Thou me?” Jesus answered, “Be-\nfore that Philip called thee, when thou wast under the fig tree, I saw\nthee.” John 1:47, 48. And Jesus will see us also in the secret places\nof prayer if we will seek Him for light that we may know what is\ntruth. Angels from the world of light will be with those who in\nhumility of heart seek for divine guidance.\nThe Holy Spirit exalts and glorifies the Saviour. It is His office\nto present Christ, the purity of His righteousness, and the great\nsalvation that we have through Him. Jesus says, “He shall receive of\nMine, and shall show it unto you.” John 16:14. The Spirit of truth is\nthe only effectual teacher of divine truth. How must God esteem the\nhuman race, since He gave His Son to die for them and appoints His\nSpirit to be man’s teacher and continual guide!\nChapter 11—The Privilege of Prayer[92]\n[93]\nThrough nature and revelation, through His providence, and by\nthe influence of His Spirit, God speaks to us. But these are not\nenough; we need also to pour out our hearts to Him. In order to have\nspiritual life and energy, we must have actual relationship with our\nheavenly Father. Our minds may be drawn out toward Him; we may\nmeditate upon His works, His mercies, His blessings; but this is not,\nin the fullest sense, communing with Him. In order to commune\nwith God, we must have something to say to Him concerning our\nactual life.\nPrayer is the opening of the heart to God as to a friend. Not that\nit is necessary in order to make known to God what we are, but in\norder to enable us to receive Him. Prayer does not bring God down\nto us, but brings us up to Him.\nWhen Jesus was upon the earth, He taught His disciples how to\npray. He directed them to present their daily needs before God, and\nto cast all their care upon Him. And the assurance He gave them\nthat their petitions should be heard, is assurance also to us.\nJesus Himself, while He dwelt among men, was often in prayer.\nOur Saviour identified Himself with our needs and weakness, in\nthat He became a suppliant, a petitioner, seeking from His Father\nfresh supplies of strength, that He might come forth braced for duty\nand trial. He is our example in all things. He is a brother in our\ninfirmities, “in all points tempted like as we are;” but as the sinless\none His nature recoiled from evil; He endured struggles and torture[94]\nof soul in a world of sin. His humanity made prayer a necessity and a\nprivilege. He found comfort and joy in communion with His Father.\nAnd if the Saviour of men, the Son of God, felt the need of prayer,\nhow much more should feeble, sinful mortals feel the necessity of\nfervent, constant prayer.\nOur heavenly Father waits to bestow upon us the fullness of\nHis blessing. It is our privilege to drink largely at the fountain of\nboundless love. What a wonder it is that we pray so little! God is\n60\nPrivilege of Prayer 61\nready and willing to hear the sincere prayer of the humblest of His\nchildren, and yet there is much manifest reluctance on our part to\nmake known our wants to God. What can the angels of heaven think\nof poor helpless human beings, who are subject to temptation, when\nGod’s heart of infinite love yearns toward them, ready to give them\nmore than they can ask or think, and yet they pray so little and have\nso little faith? The angels love to bow before God; they love to be\nnear Him. They regard communion with God as their highest joy;\nand yet the children of earth, who need so much the help that God\nonly can give, seem satisfied to walk without the light of His Spirit,\nthe companionship of His presence.\nThe darkness of the evil one encloses those who neglect to pray.\nThe whispered temptations of the enemy entice them to sin; and\nit is all because they do not make use of the privileges that God\nhas given them in the divine appointment of prayer. Why should\nthe sons and daughters of God be reluctant to pray, when prayer is\nthe key in the hand of faith to unlock heaven’s storehouse, where\nare treasured the boundless resources of Omnipotence? Without [95]\nunceasing prayer and diligent watching we are in danger of growing\ncareless and of deviating from the right path. The adversary seeks\ncontinually to obstruct the way to the mercy seat, that we may not\nby earnest supplication and faith obtain grace and power to resist\ntemptation.\nThere are certain conditions upon which we may expect that God\nwill hear and answer our prayers. One of the first of these is that we\nfeel our need of help from Him. He has promised, “I will pour water\nupon him that is thirsty, and floods upon the dry ground.” Isaiah\n44:3. Those who hunger and thirst after righteousness, who long\nafter God, may be sure that they will be filled. The heart must be\nopen to the Spirit’s influence, or God’s blessing cannot be received.\nOur great need is itself an argument and pleads most eloquently\nin our behalf. But the Lord is to be sought unto to do these things for\nus. He says, “Ask, and it shall be given you.” And “He that spared\nnot His own Son, but delivered Him up for us all, how shall He not\nwith Him also freely give us all things?” Matthew 7:7; Romans 8:32.\nIf we regard iniquity in our hearts, if we cling to any known sin,\nthe Lord will not hear us; but the prayer of the penitent, contrite soul\nis always accepted. When all known wrongs are righted, we may\n62 Steps to Christ\nbelieve that God will answer our petitions. Our own merit will never\ncommend us to the favor of God; it is the worthiness of Jesus that\nwill save us, His blood that will cleanse us; yet we have a work to\ndo in complying with the conditions of acceptance.\nAnother element of prevailing prayer is faith. “He that cometh[96]\nto God must believe that He is, and that He is a rewarder of them\nthat diligently seek Him.” Hebrews 11:6. Jesus said to His disciples,\n“What things soever ye desire, when ye pray, believe that ye receive\nthem, and ye shall have them.” Mark 11:24. Do we take Him at His\nword?\nThe assurance is broad and unlimited, and He is faithful who has\npromised. When we do not receive the very things we asked for, at\nthe time we ask, we are still to believe that the Lord hears and that\nHe will answer our prayers. We are so erring and short-sighted that\nwe sometimes ask for things that would not be a blessing to us, and\nour heavenly Father in love answers our prayers by giving us that\nwhich will be for our highest good—that which we ourselves would\ndesire if with vision divinely enlightened we could see all things as\nthey really are. When our prayers seem not to be answered, we are to\ncling to the promise; for the time of answering will surely come, and\nwe shall receive the blessing we need most. But to claim that prayer\nwill always be answered in the very way and for the particular thing\nthat we desire, is presumption. God is too wise to err, and too good\nto withhold any good thing from them that walk uprightly. Then\ndo not fear to trust Him, even though you do not see the immediate\nanswer to your prayers. Rely upon His sure promise, “Ask, and it\nshall be given you.”\nIf we take counsel with our doubts and fears, or try to solve\neverything that we cannot see clearly, before we have faith, perplex-\nities will only increase and deepen. But if we come to God, feeling[97]\nhelpless and dependent, as we really are, and in humble, trusting\nfaith make known our wants to Him whose knowledge is infinite,\nwho sees everything in creation, and who governs everything by His\nwill and word, He can and will attend to our cry, and will let light\nshine into our hearts. Through sincere prayer we are brought into\nconnection with the mind of the Infinite. We may have no remark-\nable evidence at the time that the face of our Redeemer is bending\nover us in compassion and love, but this is even so. We may not\nPrivilege of Prayer 63\nfeel His visible touch, but His hand is upon us in love and pitying\ntenderness.\nWhen we come to ask mercy and blessing from God we should\nhave a spirit of love and forgiveness in our own hearts. How can\nwe pray, “Forgive us our debts,as we forgive our debtors,” and yet\nindulge an unforgiving spirit? Matthew 6:12. If we expect our own\nprayers to be heard we must forgive others in the same manner and\nto the same extent as we hope to be forgiven.\nPerseverance in prayer has been made a condition of receiving.\nWe must pray always if we would grow in faith and experience. We\nare to be “instant in prayer,” to “continue in prayer, and watch in the\nsame with thanksgiving.” Romans 12:12; Colossians 4:2. Peter ex-\nhorts believers to be “sober, and watch unto prayer.” 1 Peter 4:7. Paul\ndirects, “In everything by prayer and supplication with thanksgiving\nlet your requests be made known unto God.” Philippians 4:6. “But\nye, beloved,” says Jude, “praying in the Holy Ghost, keep yourselves\nin the love of God.” Jude 20, 21. Unceasing prayer is the unbroken [98]\nunion of the soul with God, so that life from God flows into our life;\nand from our life, purity and holiness flow back to God.\nThere is necessity for diligence in prayer; let nothing hinder\nyou. Make every effort to keep open the communion between Jesus\nand your own soul. Seek every opportunity to go where prayer is\nwont to be made. Those who are really seeking for communion with\nGod will be seen in the prayer meeting, faithful to do their duty and\nearnest and anxious to reap all the benefits they can gain. They will\nimprove every opportunity of placing themselves where they can\nreceive the rays of light from heaven.\nWe should pray in the family circle, and above all we must not\nneglect secret prayer, for this is the life of the soul. It is impossible\nfor the soul to flourish while prayer is neglected. Family or public\nprayer alone is not sufficient. In solitude let the soul be laid open to\nthe inspecting eye of God. Secret prayer is to be heard only by the\nprayer-hearing God. No curious ear is to receive the burden of such\npetitions. In secret prayer the soul is free from surrounding influ-\nences, free from excitement. Calmly, yet fervently, will it reach out\nafter God. Sweet and abiding will be the influence emanating from\nHim who seeth in secret, whose ear is open to hear the prayer arising\nfrom the heart. By calm, simple faith the soul holds communion\n64 Steps to Christ\nwith God and gathers to itself rays of divine light to strengthen and\nsustain it in the conflict with Satan. God is our tower of strength.\nPray in your closet, and as you go about your daily labor let\nyour heart be often uplifted to God. It was thus that Enoch walked[99]\nwith God. These silent prayers rise like precious incense before the\nthrone of grace. Satan cannot overcome him whose heart is thus\nstayed upon God.\nThere is no time or place in which it is inappropriate to offer up a\npetition to God. There is nothing that can prevent us from lifting up\nour hearts in the spirit of earnest prayer. In the crowds of the street,\nin the midst of a business engagement, we may send up a petition to\nGod and plead for divine guidance, as did Nehemiah when he made\nhis request before King Artaxerxes. A closet of communion may be\nfound wherever we are. We should have the door of the heart open\ncontinually and our invitation going up that Jesus may come and\nabide as a heavenly guest in the soul.\nAlthough there may be a tainted, corrupted atmosphere around\nus, we need not breathe its miasma, but may live in the pure air of\nheaven. We may close every door to impure imaginings and unholy\nthoughts by lifting the soul into the presence of God through sincere\nprayer. Those whose hearts are open to receive the support and\nblessing of God will walk in a holier atmosphere than that of earth\nand will have constant communion with heaven.\nWe need to have more distinct views of Jesus and a fuller compre-\nhension of the value of eternal realities. The beauty of holiness is to\nfill the hearts of God’s children; and that this may be accomplished,\nwe should seek for divine disclosures of heavenly things.\nLet the soul be drawn out and upward, that God may grant us a\nbreath of the heavenly atmosphere. We may keep so near to God that\nin every unexpected trial our thoughts will turn to Him as naturally [100]\nas the flower turns to the sun.\nKeep your wants, your joys, your sorrows, your cares, and your\nfears before God. You cannot burden Him; you cannot weary Him.\nHe who numbers the hairs of your head is not indifferent to the\nwants of His children. “The Lord is very pitiful, and of tender\nmercy.” James 5:11. His heart of love is touched by our sorrows\nand even by our utterances of them. Take to Him everything that\nperplexes the mind. Nothing is too great for Him to bear, for He\nPrivilege of Prayer 65\nholds up worlds, He rules over all the affairs of the universe. Nothing\nthat in any way concerns our peace is too small for Him to notice.\nThere is no chapter in our experience too dark for Him to read;\nthere is no perplexity too difficult for Him to unravel. No calamity\ncan befall the least of His children, no anxiety harass the soul, no\njoy cheer, no sincere prayer escape the lips, of which our heavenly\nFather is unobservant, or in which He takes no immediate interest.\n“He healeth the broken in heart, and bindeth up their wounds.” Psalm\n147:3. The relations between God and each soul are as distinct and\nfull as though there were not another soul upon the earth to share\nHis watchcare, not another soul for whom He gave His beloved Son.\nJesus said, “Ye shall ask in My name: and I say not unto you,\nthat I will pray the Father for you: for the Father Himself loveth\nyou.” “I have chosen you: ... that whatsoever ye shall ask of the\nFather in My name, He may give it you.” John 16:26, 27; 15:16. But\nto pray in the name of Jesus is something more than a mere mention\nof that name at the beginning and the ending of a prayer. It is to pray [101]\nin the mind and spirit of Jesus, while we believe His promises, rely\nupon His grace, and work His works.\nGod does not mean that any of us should become hermits or\nmonks and retire from the world in order to devote ourselves to\nacts of worship. The life must be like Christ’s life—between the\nmountain and the multitude. He who does nothing but pray will soon\ncease to pray, or his prayers will become a formal routine. When\nmen take themselves out of social life, away from the sphere of\nChristian duty and cross bearing; when they cease to work earnestly\nfor the Master, who worked earnestly for them, they lose the subject\nmatter of prayer and have no incentive to devotion. Their prayers\nbecome personal and selfish. They cannot pray in regard to the\nwants of humanity or the upbuilding of Christ’s kingdom, pleading\nfor strength wherewith to work.\nWe sustain a loss when we neglect the privilege of associating\ntogether to strengthen and encourage one another in the service of\nGod. The truths of His word lose their vividness and importance\nin our minds. Our hearts cease to be enlightened and aroused by\ntheir sanctifying influence, and we decline in spirituality. In our\nassociation as Christians we lose much by lack of sympathy with\none another. He who shuts himself up to himself is not filling the\n66 Steps to Christ\nposition that God designed he should. The proper cultivation of the\nsocial elements in our nature brings us into sympathy with others\nand is a means of development and strength to us in the service of\nGod.\nIf Christians would associate together, speaking to each other of\nthe love of God and of the precious truths of redemption, their own[102]\nhearts would be refreshed and they would refresh one another. We\nmay be daily learning more of our heavenly Father, gaining a fresh\nexperience of His grace; then we shall desire to speak of His love;\nand as we do this, our own hearts will be warmed and encouraged.\nIf we thought and talked more of Jesus, and less of self, we should\nhave far more of His presence.\nIf we would but think of God as often as we have evidence of\nHis care for us we should keep Him ever in our thoughts and should\ndelight to talk of Him and to praise Him. We talk of temporal things\nbecause we have an interest in them. We talk of our friends because\nwe love them; our joys and our sorrows are bound up with them. Yet\nwe have infinitely greater reason to love God than to love our earthly\nfriends; it should be the most natural thing in the world to make Him\nfirst in all our thoughts, to talk of His goodness and tell of His power.\nThe rich gifts He has bestowed upon us were not intended to absorb\nour thoughts and love so much that we should have nothing to give\nto God; they are constantly to remind us of Him and to bind us in\nbonds of love and gratitude to our heavenly Benefactor. We dwell\ntoo near the lowlands of earth. Let us raise our eyes to the open door\nof the sanctuary above, where the light of the glory of God shines in\nthe face of Christ, who “is able also to save them to the uttermost\nthat come unto God by Him.” Hebrews 7:25.\nWe need to praise God more “for His goodness, and for His won-\nderful works to the children of men.” Psalm 107:8. Our devotional\nexercises should not consist wholly in asking and receiving. Let us[103]\nnot be always thinking of our wants and never of the benefits we\nreceive. We do not pray any too much, but we are too sparing of\ngiving thanks. We are the constant recipients of God’s mercies, and\nyet how little gratitude we express, how little we praise Him for\nwhat He has done for us.\nAnciently the Lord bade Israel, when they met together for His\nservice, “Ye shall eat before the Lord your God, and ye shall rejoice\nPrivilege of Prayer 67\nin all that ye put your hand unto, ye and your households, wherein\nthe Lord thy God hath blessed thee.” Deuteronomy 12:7. That which\nis done for the glory of God should be done with cheerfulness, with\nsongs of praise and thanksgiving, not with sadness and gloom.\nOur God is a tender, merciful Father. His service should not be\nlooked upon as a heart-saddening, distressing exercise. It should be\na pleasure to worship the Lord and to take part in His work. God\nwould not have His children, for whom so great salvation has been\nprovided, act as if He were a hard, exacting taskmaster. He is their\nbest friend; and when they worship Him, He expects to be with\nthem, to bless and comfort them, filling their hearts with joy and\nlove. The Lord desires His children to take comfort in His service\nand to find more pleasure than hardship in His work. He desires\nthat those who come to worship Him shall carry away with them\nprecious thoughts of His care and love, that they may be cheered in\nall the employments of daily life, that they may have grace to deal\nhonestly and faithfully in all things.\nWe must gather about the cross. Christ and Him crucified should [104]\nbe the theme of contemplation, of conversation, and of our most\njoyful emotion. We should keep in our thoughts every blessing we\nreceive from God, and when we realize His great love we should be\nwilling to trust everything to the hand that was nailed to the cross\nfor us.\nThe soul may ascend nearer heaven on the wings of praise. God\nis worshiped with song and music in the courts above, and as we\nexpress our gratitude we are approximating to the worship of the\nheavenly hosts. “Whoso offereth praise glorifieth” God. Psalm\n50:23. Let us with reverent joy come before our Creator, with\n“thanksgiving, and the voice of melody.” Isaiah 51:3.\nChapter 12—What to Do with Doubt[105]\nMany, especially those who are young in the Christian life, are at\ntimes troubled with the suggestions of skepticism. There are in the\nBible many things which they cannot explain, or even understand,\nand Satan employs these to shake their faith in the Scriptures as a\nrevelation from God. They ask, “How shall I know the right way? If\nthe Bible is indeed the word of God, how can I be freed from these\ndoubts and perplexities?”\nGod never asks us to believe, without giving sufficient evidence\nupon which to base our faith. His existence, His character, the\ntruthfulness of His word, are all established by testimony that appeals\nto our reason; and this testimony is abundant. Yet God has never\nremoved the possibility of doubt. Our faith must rest upon evidence,\nnot demonstration. Those who wish to doubt will have opportunity;\nwhile those who really desire to know the truth will find plenty of\nevidence on which to rest their faith.\nIt is impossible for finite minds fully to comprehend the character\nor the works of the Infinite One. To the keenest intellect, the most\nhighly educated mind, that holy Being must ever remain clothed in\nmystery. “Canst thou by searching find out God? canst thou find out\nthe Almighty unto perfection? It is as high as heaven; what canst\nthou do? deeper than hell; what canst thou know?” Job 11:7, 8.\nThe apostle Paul exclaims, “O the depth of the riches both of[106]\nthe wisdom and knowledge of God! how unsearchable are His\njudgments, and His ways past finding out!” Romans 11:33. But\nthough “clouds and darkness are round about Him,” “righteousness\nand judgment are the foundation of His throne.” Psalm 97:2, R.V .\nWe can so far comprehend His dealings with us, and the motives\nby which He is actuated, that we may discern boundless love and\nmercy united to infinite power. We can understand as much of His\npurposes as it is for our good to know; and beyond this we must still\ntrust the hand that is omnipotent, the heart that is full of love.\n68\nWhat to Do with Doubt 69\nThe word of God, like the character of its divine Author, presents\nmysteries that can never be fully comprehended by finite beings. The\nentrance of sin into the world, the incarnation of Christ, regeneration,\nthe resurrection, and many other subjects presented in the Bible, are\nmysteries too deep for the human mind to explain, or even fully to\ncomprehend. But we have no reason to doubt God’s word because\nwe cannot understand the mysteries of His providence. In the natural\nworld we are constantly surrounded with mysteries that we cannot\nfathom. The very humblest forms of life present a problem that\nthe wisest of philosophers is powerless to explain. Everywhere are\nwonders beyond our ken. Should we then be surprised to find that in\nthe spiritual world also there are mysteries that we cannot fathom?\nThe difficulty lies solely in the weakness and narrowness of the\nhuman mind. God has given us in the Scriptures sufficient evidence\nof their divine character, and we are not to doubt His word because [107]\nwe cannot understand all the mysteries of His providence.\nThe apostle Peter says that there are in Scripture “things hard\nto be understood, which they that are unlearned and unstable wrest\n... unto their own destruction.” 2 Peter 3:16. The difficulties of\nScripture have been urged by skeptics as an argument against the\nBible; but so far from this, they constitute a strong evidence of\nits divine inspiration. If it contained no account of God but that\nwhich we could easily comprehend; if His greatness and majesty\ncould be grasped by finite minds, then the Bible would not bear the\nunmistakable credentials of divine authority. The very grandeur and\nmystery of the themes presented should inspire faith in it as the word\nof God.\nThe Bible unfolds truth with a simplicity and a perfect adaptation\nto the needs and longings of the human heart, that has astonished\nand charmed the most highly cultivated minds, while it enables the\nhumblest and uncultured to discern the way of salvation. And yet\nthese simply stated truths lay hold upon subjects so elevated, so far-\nreaching, so infinitely beyond the power of human comprehension,\nthat we can accept them only because God has declared them. Thus\nthe plan of redemption is laid open to us, so that every soul may see\nthe steps he is to take in repentance toward God and faith toward\nour Lord Jesus Christ, in order to be saved in God’s appointed way;\nyet beneath these truths, so easily understood, lie mysteries that are\n70 Steps to Christ\nthe hiding of His glory—mysteries that overpower the mind in its\nresearch, yet inspire the sincere seeker for truth with reverence and\nfaith. The more he searches the Bible, the deeper is his conviction[108]\nthat it is the word of the living God, and human reason bows before\nthe majesty of divine revelation.\nTo acknowledge that we cannot fully comprehend the great truths\nof the Bible is only to admit that the finite mind is inadequate to\ngrasp the infinite; that man, with his limited, human knowledge,\ncannot understand the purposes of Omniscience.\nBecause they cannot fathom all its mysteries, the skeptic and\nthe infidel reject God’s word; and not all who profess to believe the\nBible are free from danger on this point. The apostle says, “Take\nheed, brethren, lest there be in any of you an evil heart of unbelief,\nin departing from the living God.” Hebrews 3:12. It is right to study\nclosely the teachings of the Bible and to search into “the deep things\nof God” so far as they are revealed in Scripture. 1 Corinthians 2:10.\nWhile “the secret things belong unto the Lord our God,” “those\nthings which are revealed belong unto us.” Deuteronomy 29:29. But\nit is Satan’s work to pervert the investigative powers of the mind.\nA certain pride is mingled with the consideration of Bible truth, so\nthat men feel impatient and defeated if they cannot explain every\nportion of Scripture to their satisfaction. It is too humiliating to\nthem to acknowledge that they do not understand the inspired words.\nThey are unwilling to wait patiently until God shall see fit to reveal\nthe truth to them. They feel that their unaided human wisdom is\nsufficient to enable them to comprehend the Scripture, and failing to\ndo this, they virtually deny its authority. It is true that many theories\nand doctrines popularly supposed to be derived from the Bible have\nno foundation in its teaching, and indeed are contrary to the whole[109]\ntenor of inspiration. These things have been a cause of doubt and\nperplexity to many minds. They are not, however, chargeable to\nGod’s word, but to man’s perversion of it.\nIf it were possible for created beings to attain to a full under-\nstanding of God and His works, then, having reached this point,\nthere would be for them no further discovery of truth, no growth in\nknowledge, no further development of mind or heart. God would no\nlonger be supreme; and man, having reached the limit of knowledge\nand attainment, would cease to advance. Let us thank God that it is\nWhat to Do with Doubt 71\nnot so. God is infinite; in Him are “all the treasures of wisdom and\nknowledge.” Colossians 2:3. And to all eternity men may be ever\nsearching, ever learning, and yet never exhaust the treasures of His\nwisdom, His goodness, and His power.\nGod intends that even in this life the truths of His word shall be\never unfolding to His people. There is only one way in which this\nknowledge can be obtained. We can attain to an understanding of\nGod’s word only through the illumination of that Spirit by which the\nword was given. “The things of God knoweth no man, but the Spirit\nof God;” “for the Spirit searcheth all things, yea, the deep things\nof God.” 1 Corinthians 2:11, 10. And the Saviour’s promise to His\nfollowers was, “When He, the Spirit of truth, is come, He will guide\nyou into all truth.... For He shall receive of Mine, and shall show it\nunto you.” John 16:13, 14.\nGod desires man to exercise his reasoning powers; and the study\nof the Bible will strengthen and elevate the mind as no other study\ncan. Yet we are to beware of deifying reason, which is subject to [110]\nthe weakness and infirmity of humanity. If we would not have the\nScriptures clouded to our understanding, so that the plainest truths\nshall not be comprehended, we must have the simplicity and faith\nof a little child, ready to learn, and beseeching the aid of the Holy\nSpirit. A sense of the power and wisdom of God, and of our inability\nto comprehend His greatness, should inspire us with humility, and\nwe should open His word, as we would enter His presence, with\nholy awe. When we come to the Bible, reason must acknowledge an\nauthority superior to itself, and heart and intellect must bow to the\ngreat I AM.\nThere are many things apparently difficult or obscure, which God\nwill make plain and simple to those who thus seek an understanding\nof them. But without the guidance of the Holy Spirit we shall be\ncontinually liable to wrest the Scriptures or to misinterpret them.\nThere is much reading of the Bible that is without profit and in many\ncases a positive injury. When the word of God is opened without\nreverence and without prayer; when the thoughts and affections\nare not fixed upon God, or in harmony with His will, the mind is\nclouded with doubts; and in the very study of the Bible, skepticism\nstrengthens. The enemy takes control of the thoughts, and he sug-\ngests interpretations that are not correct. Whenever men are not in\n72 Steps to Christ\nword and deed seeking to be in harmony with God, then, however\nlearned they may be, they are liable to err in their understanding\nof Scripture, and it is not safe to trust to their explanations. Those\nwho look to the Scriptures to find discrepancies, have not spiritual\ninsight. With distorted vision they will see many causes for doubt[111]\nand unbelief in things that are really plain and simple.\nDisguise it as they may, the real cause of doubt and skepticism,\nin most cases, is the love of sin. The teachings and restrictions of\nGod’s word are not welcome to the proud, sin-loving heart, and\nthose who are unwilling to obey its requirements are ready to doubt\nits authority. In order to arrive at truth, we must have a sincere\ndesire to know the truth and a willingness of heart to obey it. And all\nwho come in this spirit to the study of the Bible will find abundant\nevidence that it is God’s word, and they may gain an understanding\nof its truths that will make them wise unto salvation.\nChrist has said, “If any man willeth to do His will, he shall know\nof the teaching.” John 7:17, R.V . Instead of questioning and caviling\nconcerning that which you do not understand, give heed to the light\nthat already shines upon you, and you will receive greater light. By\nthe grace of Christ, perform every duty that has been made plain\nto your understanding, and you will be enabled to understand and\nperform those of which you are now in doubt.\nThere is an evidence that is open to all,—the most highly ed-\nucated, and the most illiterate,—the evidence of experience. God\ninvites us to prove for ourselves the reality of His word, the truth\nof His promises. He bids us “taste and see that the Lord is good.”\nPsalm 34:8. Instead of depending upon the word of another, we\nare to taste for ourselves. He declares, “Ask, and ye shall receive.”\nJohn 16:24. His promises will be fulfilled. They have never failed;[112]\nthey never can fail. And as we draw near to Jesus, and rejoice in the\nfullness of His love, our doubt and darkness will disappear in the\nlight of His presence.\nThe apostle Paul says that God “hath delivered us from the power\nof darkness, and hath translated us into the kingdom of His dear\nSon.” Colossians 1:13. And everyone who has passed from death\nunto life is able to “set to his seal that God is true.” John 3:33. He\ncan testify, “I needed help, and I found it in Jesus. Every want was\nsupplied, the hunger of my soul was satisfied; and now the Bible\nWhat to Do with Doubt 73\nis to me the revelation of Jesus Christ. Do you ask why I believe\nin Jesus? Because He is to me a divine Saviour. Why do I believe\nthe Bible? Because I have found it to be the voice of God to my\nsoul.” We may have the witness in ourselves that the Bible is true,\nthat Christ is the Son of God. We know that we are not following\ncunningly devised fables.\nPeter exhorts his brethren to “grow in grace, and in the knowl-\nedge of our Lord and Saviour Jesus Christ.” 2 Peter 3:18. When\nthe people of God are growing in grace, they will be constantly\nobtaining a clearer understanding of His word. They will discern\nnew light and beauty in its sacred truths. This has been true in the\nhistory of the church in all ages, and thus it will continue to the end.\n“The path of the righteous is as the light of dawn, that shineth more\nand more unto the perfect day.” Proverbs 4:18, R.V ., margin.\nBy faith we may look to the hereafter and grasp the pledge of\nGod for a growth of intellect, the human faculties uniting with the [113]\ndivine, and every power of the soul being brought into direct contact\nwith the Source of light. We may rejoice that all which has perplexed\nus in the providences of God will then be made plain, things hard\nto be understood will then find an explanation; and where our finite\nminds discovered only confusion and broken purposes, we shall see\nthe most perfect and beautiful harmony. “Now we see through a\nglass, darkly; but then face to face: now I know in part; but then\nshall I know even as also I am known.” 1 Corinthians 13:12.\nChapter 13—Rejoicing in the Lord[114]\n[115]\nThe children of God are called to be representatives of Christ,\nshowing forth the goodness and mercy of the Lord. As Jesus has\nrevealed to us the true character of the Father, so we are to reveal\nChrist to a world that does not know His tender, pitying love. “As\nThou hast sent Me into the world,” said Jesus, “even so have I\nalso sent them into the world.” “I in them, and Thou in Me; ...\nthat the world may know that Thou hast sent Me.” John 17:18, 23.\nThe apostle Paul says to the disciples of Jesus, “Ye are manifestly\ndeclared to be the epistle of Christ,” “known and read of all men.” 2\nCorinthians 3:3, 2. In every one of His children, Jesus sends a letter\nto the world. If you are Christ’s follower, He sends in you a letter to\nthe family, the village, the street, where you live. Jesus, dwelling in\nyou, desires to speak to the hearts of those who are not acquainted\nwith Him. Perhaps they do not read the Bible, or do not hear the\nvoice that speaks to them in its pages; they do not see the love of\nGod through His works. But if you are a true representative of Jesus,\nit may be that through you they will be led to understand something\nof His goodness and be won to love and serve Him.\nChristians are set as light bearers on the way to heaven. They\nare to reflect to the world the light shining upon them from Christ.\nTheir life and character should be such that through them others will\nget a right conception of Christ and of His service.\nIf we do represent Christ, we shall make His service appear[116]\nattractive, as it really is. Christians who gather up gloom and sadness\nto their souls, and murmur and complain, are giving to others a\nfalse representation of God and the Christian life. They give the\nimpression that God is not pleased to have His children happy, and\nin this they bear false witness against our heavenly Father.\nSatan is exultant when he can lead the children of God into\nunbelief and despondency. He delights to see us mistrusting God,\ndoubting His willingness and power to save us. He loves to have us\nfeel that the Lord will do us harm by His providences. It is the work\n74\nRejoicing in the Lord 75\nof Satan to represent the Lord as lacking in compassion and pity. He\nmisstates the truth in regard to Him. He fills the imagination with\nfalse ideas concerning God; and instead of dwelling upon the truth\nin regard to our heavenly Father, we too often fix our minds upon the\nmisrepresentations of Satan and dishonor God by distrusting Him\nand murmuring against Him. Satan ever seeks to make the religious\nlife one of gloom. He desires it to appear toilsome and difficult; and\nwhen the Christian presents in his own life this view of religion, he\nis, through his unbelief, seconding the falsehood of Satan.\nMany, walking along the path of life, dwell upon their mistakes\nand failures and disappointments, and their hearts are filled with grief\nand discouragement. While I was in Europe, a sister who had been\ndoing this, and who was in deep distress, wrote to me, asking for\nsome word of encouragement. The night after I had read her letter I\ndreamed that I was in a garden, and one who seemed to be the owner\nof the garden was conducting me through its paths. I was gathering [117]\nthe flowers and enjoying their fragrance, when this sister, who had\nbeen walking by my side, called my attention to some unsightly\nbriers that were impeding her way. There she was mourning and\ngrieving. She was not walking in the pathway, following the guide,\nbut was walking among the briers and thorns. “Oh,” she mourned,\n“is it not a pity that this beautiful garden is spoiled with thorns?”\nThen the guide said, “Let the thorns alone, for they will only wound\nyou. Gather the roses, the lilies, and the pinks.”\nHave there not been some bright spots in your experience? Have\nyou not had some precious seasons when your heart throbbed with\njoy in response to the Spirit of God? When you look back into\nthe chapters of your life experience do you not find some pleasant\npages? Are not God’s promises, like the fragrant flowers, growing\nbeside your path on every hand? Will you not let their beauty and\nsweetness fill your heart with joy?\nThe briers and thorns will only wound and grieve you; and if\nyou gather only these things, and present them to others, are you not,\nbesides slighting the goodness of God yourself, preventing those\naround you from walking in the path of life?\nIt is not wise to gather together all the unpleasant recollections\nof a past life,—its iniquities and disappointments,—to talk over\nthem and mourn over them until we are overwhelmed with discour-\n76 Steps to Christ\nagement. A discouraged soul is filled with darkness, shutting out\nthe light of God from his own soul and casting a shadow upon the\npathway of others.\nThank God for the bright pictures which He has presented to[118]\nus. Let us group together the blessed assurances of His love, that\nwe may look upon them continually: The Son of God leaving His\nFather’s throne, clothing His divinity with humanity, that He might\nrescue man from the power of Satan; His triumph in our behalf,\nopening heaven to men, revealing to human vision the presence\nchamber where the Deity unveils His glory; the fallen race uplifted\nfrom the pit of ruin into which sin had plunged it, and brought again\ninto connection with the infinite God, and having endured the divine\ntest through faith in our Redeemer, clothed in the righteousness of\nChrist, and exalted to His throne—these are the pictures which God\nwould have us contemplate.\nWhen we seem to doubt God’s love and distrust His promises we\ndishonor Him and grieve His Holy Spirit. How would a mother feel\nif her children were constantly complaining of her, just as though\nshe did not mean them well, when her whole life’s effort had been\nto forward their interests and to give them comfort? Suppose they\nshould doubt her love; it would break her heart. How would any\nparent feel to be thus treated by his children? And how can our\nheavenly Father regard us when we distrust His love, which has\nled Him to give His only-begotten Son that we might have life?\nThe apostle writes, “He that spared not His own Son, but delivered\nHim up for us all, how shall He not with Him also freely give us all\nthings?” Romans 8:32. And yet how many, by their actions, if not in\nword, are saying, “The Lord does not mean this for me. Perhaps He[119]\nloves others, but He does not love me.”\nAll this is harming your own soul; for every word of doubt you\nutter is inviting Satan’s temptations; it is strengthening in you the\ntendency to doubt, and it is grieving from you the ministering angels.\nWhen Satan tempts you, breathe not a word of doubt or darkness. If\nyou choose to open the door to his suggestions, your mind will be\nfilled with distrust and rebellious questioning. If you talk out your\nfeelings, every doubt you express not only reacts upon yourself, but\nit is a seed that will germinate and bear fruit in the life of others,\nand it may be impossible to counteract the influence of your words.\nRejoicing in the Lord 77\nYou yourself may be able to recover from the season of temptation\nand from the snare of Satan, but others who have been swayed by\nyour influence may not be able to escape from the unbelief you have\nsuggested. How important that we speak only those things that will\ngive spiritual strength and life!\nAngels are listening to hear what kind of report you are bearing\nto the world about your heavenly Master. Let your conversation be\nof Him who liveth to make intercession for you before the Father.\nWhen you take the hand of a friend, let praise to God be on your lips\nand in your heart. This will attract his thoughts to Jesus.\nAll have trials; griefs hard to bear, temptations hard to resist. Do\nnot tell your troubles to your fellow mortals, but carry everything\nto God in prayer. Make it a rule never to utter one word of doubt or\ndiscouragement. You can do much to brighten the life of others and [120]\nstrengthen their efforts, by words of hope and holy cheer.\nThere is many a brave soul sorely pressed by temptation, almost\nready to faint in the conflict with self and with the powers of evil.\nDo not discourage such a one in his hard struggle. Cheer him with\nbrave, hopeful words that shall urge him on his way. Thus the light of\nChrist may shine from you. “None of us liveth to himself.” Romans\n14:7. By our unconscious influence others may be encouraged and\nstrengthened, or they may be discouraged, and repelled from Christ\nand the truth.\nThere are many who have an erroneous idea of the life and\ncharacter of Christ. They think that He was devoid of warmth and\nsunniness, that He was stern, severe, and joyless. In many cases the\nwhole religious experience is colored by these gloomy views.\nIt is often said that Jesus wept, but that He was never known to\nsmile. Our Saviour was indeed a Man of Sorrows, and acquainted\nwith grief, for He opened His heart to all the woes of men. But\nthough His life was self-denying and shadowed with pain and care,\nHis spirit was not crushed. His countenance did not wear an expres-\nsion of grief and repining, but ever one of peaceful serenity. His\nheart was a wellspring of life, and wherever He went He carried rest\nand peace, joy and gladness.\nOur Saviour was deeply serious and intensely in earnest, but\nnever gloomy or morose. The life of those who imitate Him will\nbe full of earnest purpose; they will have a deep sense of personal\n78 Steps to Christ\nresponsibility. Levity will be repressed; there will be no boisterous[121]\nmerriment, no rude jesting; but the religion of Jesus gives peace\nlike a river. It does not quench the light of joy; it does not restrain\ncheerfulness nor cloud the sunny, smiling face. Christ came not to\nbe ministered unto but to minister; and when His love reigns in the\nheart, we shall follow His example.\nIf we keep uppermost in our minds the unkind and unjust acts of\nothers we shall find it impossible to love them as Christ has loved us;\nbut if our thoughts dwell upon the wondrous love and pity of Christ\nfor us, the same spirit will flow out to others. We should love and\nrespect one another, notwithstanding the faults and imperfections\nthat we cannot help seeing. Humility and self-distrust should be\ncultivated, and a patient tenderness with the faults of others. This\nwill kill out all narrowing selfishness and make us large-hearted and\ngenerous.\nThe psalmist says, “Trust in the Lord, and do good; so shalt thou\ndwell in the land, and verily thou shalt be fed.” Psalm 37:3. “Trust\nin the Lord.” Each day has its burdens, its cares and perplexities; and\nwhen we meet how ready we are to talk of our difficulties and trials.\nSo many borrowed troubles intrude, so many fears are indulged,\nsuch a weight of anxiety is expressed, that one might suppose we\nhad no pitying, loving Saviour ready to hear all our requests and to\nbe to us a present help in every time of need.\nSome are always fearing, and borrowing trouble. Every day they\nare surrounded with the tokens of God’s love; every day they are\nenjoying the bounties of His providence; but they overlook these\npresent blessings. Their minds are continually dwelling upon some-[122]\nthing disagreeable which they fear may come; or some difficulty\nmay really exist which, though small, blinds their eyes to the many\nthings that demand gratitude. The difficulties they encounter, instead\nof driving them to God, the only source of their help, separate them\nfrom Him because they awaken unrest and repining.\nDo we well to be thus unbelieving? Why should we be ungrate-\nful and distrustful? Jesus is our friend; all heaven is interested in\nour welfare. We should not allow the perplexities and worries of\neveryday life to fret the mind and cloud the brow. If we do we shall\nalways have something to vex and annoy. We should not indulge a\nRejoicing in the Lord 79\nsolicitude that only frets and wears us, but does not help us to bear\ntrials.\nYou may be perplexed in business; your prospects may grow\ndarker and darker, and you may be threatened with loss; but do not\nbecome discouraged; cast your care upon God, and remain calm and\ncheerful. Pray for wisdom to manage your affairs with discretion,\nand thus prevent loss and disaster. Do all you can on your part to\nbring about favorable results. Jesus has promised His aid, but not\napart from our effort. When, relying upon our Helper, you have\ndone all you can, accept the result cheerfully.\nIt is not the will of God that His people should be weighed down\nwith care. But our Lord does not deceive us. He does not say to us,\n“Do not fear; there are no dangers in your path.” He knows there are\ntrials and dangers, and He deals with us plainly. He does not propose\nto take His people out of a world of sin and evil, but He points them\nto a never-failing refuge. His prayer for His disciples was, “I pray [123]\nnot that Thou shouldest take them out of the world, but that Thou\nshouldest keep them from the evil.” “In the world,” He says, “ye\nshall have tribulation: but be of good cheer; I have overcome the\nworld.” John 17:15; 16:33.\nIn His Sermon on the Mount, Christ taught His disciples precious\nlessons in regard to the necessity of trusting in God. These lessons\nwere designed to encourage the children of God through all ages,\nand they have come down to our time full of instruction and comfort.\nThe Saviour pointed His followers to the birds of the air as they\nwarbled their carols of praise, unencumbered with thoughts of care,\nfor “they sow not, neither do they reap.” And yet the great Father\nprovides for their needs. The Saviour asks, “Are ye not much better\nthan they?” Matthew 6:26. The great Provider for man and beast\nopens His hand and supplies all His creatures. The birds of the air\nare not beneath His notice. He does not drop the food into their bills,\nbut He makes provision for their needs. They must gather the grains\nHe has scattered for them. They must prepare the material for their\nlittle nests. They must feed their young. They go forth singing to\ntheir labor, for “your heavenly Father feedeth them.” And “are ye\nnot much better than they?” Are not you, as intelligent, spiritual\nworshipers, of more value than the birds of the air? Will not the\nAuthor of our being, the Preserver of our life, the One who formed\n80 Steps to Christ\nus in His own divine image, provide for our necessities if we but\ntrust in Him?\nChrist pointed His disciples to the flowers of the field, growing in[124]\nrich profusion and glowing in the simple beauty which the heavenly\nFather had given them, as an expression of His love to man. He\nsaid, “Consider the lilies of the field, how they grow.” The beauty\nand simplicity of these natural flowers far outrival the splendor of\nSolomon. The most gorgeous attire produced by the skill of art\ncannot bear comparison with the natural grace and radiant beauty of\nthe flowers of God’s creation. Jesus asks, “If God so clothe the grass\nof the field, which today is, and tomorrow is cast into the oven, shall\nHe not much more clothe you, O ye of little faith?” Matthew 6:28,\n30. If God, the divine Artist, gives to the simple flowers that perish\nin a day their delicate and varied colors, how much greater care will\nHe have for those who are created in His own image? This lesson of\nChrist’s is a rebuke to the anxious thought, the perplexity and doubt,\nof the faithless heart.\nThe Lord would have all His sons and daughters happy, peaceful,\nand obedient. Jesus says, “My peace I give unto you: not as the\nworld giveth, give I unto you. Let not your heart be troubled, neither\nlet it be afraid.” “These things have I spoken unto you, that My joy\nmight remain in you, and that your joy might be full.” John 14:27;\n15:11.\nHappiness that is sought from selfish motives, outside of the path\nof duty, is ill-balanced, fitful, and transitory; it passes away, and\nthe soul is filled with loneliness and sorrow; but there is joy and\nsatisfaction in the service of God; the Christian is not left to walk in\nuncertain paths; he is not left to vain regrets and disappointments.\nIf we do not have the pleasures of this life we may still be joyful in[125]\nlooking to the life beyond.\nBut even here Christians may have the joy of communion with\nChrist; they may have the light of His love, the perpetual comfort\nof His presence. Every step in life may bring us closer to Jesus,\nmay give us a deeper experience of His love, and may bring us one\nstep nearer to the blessed home of peace. Then let us not cast away\nour confidence, but have firm assurance, firmer than ever before.\n“Hitherto hath the Lord helped us,” and He will help us to the end. 1\nSamuel 7:12. Let us look to the monumental pillars, reminders of\nRejoicing in the Lord 81\nwhat the Lord has done to comfort us and to save us from the hand of\nthe destroyer. Let us keep fresh in our memory all the tender mercies\nthat God has shown us,—the tears He has wiped away, the pains He\nhas soothed, the anxieties removed, the fears dispelled, the wants\nsupplied, the blessings bestowed,—thus strengthening ourselves for\nall that is before us through the remainder of our pilgrimage.\nWe cannot but look forward to new perplexities in the coming\nconflict, but we may look on what is past as well as on what is to\ncome, and say, “Hitherto hath the Lord helped us.” “As thy days, so\nshall thy strength be.” Deuteronomy 33:25. The trial will not exceed\nthe strength that shall be given us to bear it. Then let us take up\nour work just where we find it, believing that whatever may come,\nstrength proportionate to the trial will be given.\nAnd by and by the gates of heaven will be thrown open to admit\nGod’s children, and from the lips of the King of glory the benediction\nwill fall on their ears like richest music, “Come, ye blessed of My [126]\nFather, inherit the kingdom prepared for you from the foundation of\nthe world.” Matthew 25:34.\nThen the redeemed will be welcomed to the home that Jesus\nis preparing for them. There their companions will not be the vile\nof earth, liars, idolaters, the impure, and unbelieving; but they will\nassociate with those who have overcome Satan and through divine\ngrace have formed perfect characters. Every sinful tendency, ev-\nery imperfection, that afflicts them here has been removed by the\nblood of Christ, and the excellence and brightness of His glory, far\nexceeding the brightness of the sun, is imparted to them. And the\nmoral beauty, the perfection of His character, shines through them,\nin worth far exceeding this outward splendor. They are without fault\nbefore the great white throne, sharing the dignity and the privileges\nof the angels.\nIn view of the glorious inheritance that may be his, “what shall\na man give in exchange for his soul?” Matthew 16:26. He may be\npoor, yet he possesses in himself a wealth and dignity that the world\ncould never bestow. The soul redeemed and cleansed from sin, with\nall its noble powers dedicated to the service of God, is of surpassing\nworth; and there is joy in heaven in the presence of God and the holy\nangels over one soul redeemed, a joy that is expressed in songs of\nholy triumph.",
      "metadata": {
        "source_id": "steps_to_christ",
        "title": "Steps to Christ",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "",
        "chunk_index": 0,
        "page_reference": "unknown-85",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:43:52.675655"
      }
    }
  ]
}