{
  "source_id": "thoughts_mount_blessing",
  "title": "Thoughts from the Mount of Blessing",
  "chunks": [
    {
      "id": "thoughts_mount_blessing_000001",
      "text": "Thoughts from the\nMount of Blessing\nEllen G. White\n1896\nCopyright © 2017\nEllen G. White Estate, Inc.\nInformation about this Book\nOverview\nThis eBook is provided by the Ellen G. White Estate. It is included\nin the larger free Online Books collection on the Ellen G. White\nEstate Web site.\nAbout the Author\nEllen G. White (1827-1915) is considered the most widely translated\nAmerican author, her works having been published in more than 160\nlanguages. She wrote more than 100,000 pages on a wide variety of\nspiritual and practical topics. Guided by the Holy Spirit, she exalted\nJesus and pointed to the Scriptures as the basis of one’s faith.\nFurther Links\nA Brief Biography of Ellen G. White\nAbout the Ellen G. White Estate\nEnd User License Agreement\nThe viewing, printing or downloading of this book grants you only\na limited, nonexclusive and nontransferable license for use solely\nby you for your own personal use. This license does not permit\nrepublication, distribution, assignment, sublicense, sale, preparation\nof derivative works, or other use. Any unauthorized use of this book\nterminates the license granted hereby.\nFurther Information\nFor more information about the author, publishers, or how you\ncan support this service, please contact the Ellen G. White Estate\nat mail@whiteestate.org. We are thankful for your interest and\nfeedback and wish you God’s blessing as you read.\ni\nii\nForeword\nHundreds of thousands of copies of Thoughts from the Mount\nof Blessinghave been printed and distributed in nearly a score of\nlanguages since it was first published in 1896. In English-reading\ncountries several editions with identical textual content but with\nvariations in format and pagination have been widely distributed.\nTo eliminate confusion in the use of the volume in reference work,\na standard page has been adopted which will serve as the basis of\npresent and subsequent printings.\nIn several former editions, in an endeavor to achieve a certain\nformat, selections from verses of poetry were, with the consent of the\nauthor, inserted by the publishers in a number of places throughout\nthe text. In this edition, only poetry selected and made a part of the\ntext by the author herself is retained. The addition of both scripture\nand subject indexes makes this volume more useful.\nThat the lessons drawn from the teachings of the master herein\nset forth may continue to enlighten, encourage, and bless mankind,\nis the sincere wish of the publishers and\nThe Trustees of the\nEllen G. White Publications.\nWashington, D.C.\nJune 22, 1955.\niii\nPreface[vi]\n[vii]\nThe Sermon on the Mount is Heaven’s benediction to the world—\na voice from the throne of God.\nIt was given to mankind to be to them the law of duty and the\nlight of heaven, their hope and consolation in despondency, their joy\nand comfort in all the vicissitudes and walks of life. Here the Prince\nof preachers, the Master Teacher, utters the words that the Father\ngave Him to speak.\nThe Beatitudes are Christ’s greeting, not only to those who\nbelieve, but to the whole human family. He seems to have forgotten\nfor a moment that He is in the world, not in heaven; and He uses the\nfamiliar salutation of the world of light. Blessings flow from His\nlips as the gushing forth of a long-sealed current of rich life.\nChrist leaves us in no doubt as to the traits of character that He\nwill always recognize and bless. From the ambitious favorites of the\nworld, He turns to those whom they disown, pronouncing all blessed\nwho receive His light and life. To the poor in spirit, the meek, the\nlowly, the sorrowful, the despised, the persecuted, He opens His\narms of refuge, saying, “Come unto Me, ... and I will give you rest.”\nChrist can look upon the misery of the world without a shade of\nsorrow for having created man. In the human heart He sees more\nthan sin, more than misery. In His infinite wisdom and love He sees\nman’s possibilities, the height to which he may attain. He knows that,\neven though human beings have abused their mercies and destroyed[viii]\ntheir God-given dignity, yet the Creator is to be glorified in their\nredemption.\nThroughout all time the words that Christ spoke from the mount\nof Beatitudes will retain their power. Every sentence is a jewel\nfrom the treasure house of truth. The principles enunciated in this\ndiscourse are for all ages and for all classes of men. With divine\nenergy, Christ expressed His faith and hope as He pointed out class\nafter class as blessed because of having formed righteous characters.\niv\nLiving the life of the Life-giver, through faith in Him, everyone can\nreach the standard held up in His words.",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "",
        "chunk_index": 0,
        "page_reference": "unknown-8",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110378"
      }
    },
    {
      "id": "thoughts_mount_blessing_000002",
      "text": "Contents\nInformation about this Book . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . i\nForeword . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . iii\nPreface . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . iv\nChapter 1—On the Mountainside . . . . . . . . . . . . . . . . . . . . . . . . . . 9\nChapter 2—The Beatitudes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n“He opened His mouth, and taught them, saying, Blessed\nare the poor in spirit: for theirs is the kingdom of\nheaven.”—Matthew 5:2, 3. . . . . . . . . . . . . . . . . . . . . . . . . 13\n“Blessed are they that mourn: for they shall be\ncomforted.”—Matthew 5:4. . . . . . . . . . . . . . . . . . . . . . . . 15\n“Blessed are the meek.”—Matthew 5:5. . . . . . . . . . . . . . . . . . 18\n“Blessed are they which do hunger and thirst after\nrighteousness: for they shall be filled.”—Matthew 5:6. . 21\n“Blessed are the merciful: for they shall obtain\nmercy.”—Matthew 5:7. . . . . . . . . . . . . . . . . . . . . . . . . . . 23\n“Blessed are the pure in heart: for they shall see\nGod.”—Matthew 5:8. . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n“Blessed are the peacemakers: for they shall be called the\nchildren of God.”—Matthew 5:9. . . . . . . . . . . . . . . . . . . . 27\n“Blessed are they which are persecuted for righteousness’\nsake: for theirs is the kingdom of heaven.”—Matthew\n5:10. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 28\n“Blessed are ye, when men shall revile you.”—Matthew 5:11. 30\n“Ye are the salt of the earth.”—Matthew 5:13. . . . . . . . . . . . . 33\n“Ye are the light of the world.”—Matthew 5:14. . . . . . . . . . . 35\nChapter 3—The Spirituality of the Law . . . . . . . . . . . . . . . . . . . 40\n“I am not come to destroy, but to fulfill.”—Matthew 5:17. . . 40\n“Whosoever ... shall break one of these least\ncommandments, and shall teach men so, he shall be\ncalled the least in the kingdom of heaven.”—Matthew\n5:19. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 44\n“Except your righteousness shall exceed the righteousness\nof the scribes and Pharisees, ye shall in no case enter\ninto the kingdom of heaven.”—Matthew 5:20. . . . . . . . 45\nvi\nContents vii\n“Everyone who is angry with his brother shall be in danger\nof the judgment.”—Matthew 5:22, R. V . . . . . . . . . . . . . . 47\n“Be reconciled to thy brother.”—Matthew 5:24. . . . . . . . . . . 48\n“Whosoever looketh on a woman to lust after her hath\ncommitted adultery with her already in his\nheart.”—Matthew 5:28. . . . . . . . . . . . . . . . . . . . . . . . . . . 49\n“If thy right hand causeth thee to stumble, cut it off, and\ncast it from thee.”—Matthew 5:30, R. V . . . . . . . . . . . . . 50\n“Is it lawful for a man to put away his wife?”—Matthew 19:3. 52\n“Swear not at all.”—Matthew 5:34.. . . . . . . . . . . . . . . . . . . . . 54\n“Resist not him that is evil: but whosoever smiteth thee on\nthy right cheek, turn to him the other also.”—Matthew",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "E.G.W.",
        "chunk_index": 0,
        "page_reference": "9-10",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110389"
      }
    },
    {
      "id": "thoughts_mount_blessing_000003",
      "text": "“Love your enemies.”—Matthew 5:44. . . . . . . . . . . . . . . . . . . 59\n“Be ye therefore perfect, even as your Father which is in\nheaven is perfect.”—Matthew 5:48. . . . . . . . . . . . . . . . . 60\nChapter 4—The True Motive in Service . . . . . . . . . . . . . . . . . . . 63\n“Take heed that ye do not your righteousness before men,\nto be seen of them.”—Matthew 6:1, margin. . . . . . . . . . 63\n“When thou prayest, thou shalt not be as the hypocrites\nare.”—Matthew 6:5. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 66\n“When ye pray, use not vain repetitions, as the heathen\ndo.”—Matthew 6:7. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 67\n“When ye fast, be not, as the hypocrites.”—Matthew 6:16. . 68\n“Lay not up for yourselves treasures upon\nearth.”—Matthew 6:19. . . . . . . . . . . . . . . . . . . . . . . . . . . 69\n“If ... thine eye be single, thy whole body shall be full of\nlight.”—Matthew 6:22. . . . . . . . . . . . . . . . . . . . . . . . . . . . . 71\n“No man can serve two masters.”—Matthew 6:24. . . . . . . . . 72\n“Be not anxious.”—Matthew 6:25, R. V . . . . . . . . . . . . . . . . . 74\n“Seek ye first the kingdom of God.”—Matthew 6:33. . . . . . . 76\n“Be not therefore anxious for the morrow.... Sufficient unto\nthe day is the evil thereof.”—Matthew 6:34, R. V . . . . . . 77\nChapter 5—The Lord’s Prayer . . . . . . . . . . . . . . . . . . . . . . . . . . . 79\n“After this manner therefore pray ye.”—Matthew 6:9. . . . . . 79\n“When ye pray, say, Our Father.”—Luke 11:2. . . . . . . . . . . . 80\n“Hallowed be Thy name.”—Matthew 6:9. . . . . . . . . . . . . . . . 82\n“Thy kingdom come.”—Matthew 6:10. . . . . . . . . . . . . . . . . . 83\nviii Thoughts from the Mount of Blessing\n“Thy will be done in earth, as it is in heaven.”—Matthew 6:10.84\n“Give us this day our daily bread.”—Matthew 6:11. . . . . . . . 84\n“Forgive us our sins; for we also forgive everyone that is\nindebted to us.”—Luke 11:4. . . . . . . . . . . . . . . . . . . . . . . 86\n“Bring us not into temptation, but deliver us from the evil\none.”—Matthew 6:13, R. V . . . . . . . . . . . . . . . . . . . . . . . . 88\n“Thine is the kingdom, and the power, and the\nglory.”—Matthew 6:13. . . . . . . . . . . . . . . . . . . . . . . . . . . . 91\nChapter 6—Not Judging, but Doing . . . . . . . . . . . . . . . . . . . . . . 93\n“Judge not, that ye be not judged.”—Matthew 7:1. . . . . . . . . 93\n“Why beholdest thou the mote that is in thy brother’s\neye?”—Matthew 7:3. . . . . . . . . . . . . . . . . . . . . . . . . . . . . 94\n“Give not that which is holy unto the dogs.”—Matthew 7:6. . 97\n“Ask, and it shall be given you; seek, and ye shall find;\nknock, and it shall be opened unto you.”—Matthew 7:7. 98\n“Therefore all things whatsoever ye would that men\nshould do to you, do ye even so to them.”—Matthew\n7:12. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 100\n“Strait is the gate, and narrow is the way, which leadeth\nunto life.”—Matthew 7:14. . . . . . . . . . . . . . . . . . . . . . . 103\n“Strive to enter in at the strait gate.”—Luke 13:24. . . . . . . . 105\n“Beware of false prophets.”—Matthew 7:15. . . . . . . . . . . . . 107\n“It fell not; for it was founded upon the rock.”—Matthew",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "5:39, R. V . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 56",
        "chunk_index": 0,
        "page_reference": "11-11",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110395"
      }
    },
    {
      "id": "thoughts_mount_blessing_000004",
      "text": "Chapter 1—On the Mountainside [ix]\nMore than fourteen centuries before Jesus was born in Bethle-\nhem, the children of Israel gathered in the fair vale of Shechem, and\nfrom the mountains on either side the voices of the priests were heard\nproclaiming the blessings and the curses—“a blessing, if ye obey the\ncommandments of the Lord your God: ... and a curse, if ye will not\nobey.” Deuteronomy 11:27, 28. And thus the mountain from which\nthe words of benediction were spoken came to be known as the\nmount of blessing. But it was not upon Gerizim that the words were\nspoken which have come as a benediction to a sinning and sorrowing\nworld. Israel fell short of the high ideal which had been set before\nher. Another than Joshua must guide His people to the true rest of\nfaith. No longer is Gerizim known as the mount of the Beatitudes,\nbut that unnamed mountain beside the Lake of Gennesaret, where\nJesus spoke the words of blessing to His disciples and the multitude.\nLet us in imagination go back to that scene, and, as we sit with the\ndisciples on the mountainside, enter into the thoughts and feelings\nthat filled their hearts. Understanding what the words of Jesus meant\nto those who heard them, we may discern in them a new vividness\nand beauty, and may also gather for ourselves their deeper lessons.\nWhen the Saviour began His ministry, the popular conception of\nthe Messiah and His work was such as wholly unfitted the people to\nreceive Him. The spirit of true devotion had been lost in tradition and [2]\nceremonialism, and the prophecies were interpreted at the dictate of\nproud, world-loving hearts. The Jews looked for the coming One,\nnot as a Saviour from sin, but as a great prince who should bring\nall nations under the supremacy of the Lion of the tribe of Judah.\nIn vain had John the Baptist, with the heart-searching power of the\nancient prophets, called them to repentance. In vain had he, beside\nthe Jordan, pointed to Jesus as the Lamb of God, that taketh away the\nsin of the world. God was seeking to direct their minds to Isaiah’s\nprophecy of the suffering Saviour, but they would not hear.\n9\n10 Thoughts from the Mount of Blessing\nHad the teachers and leaders in Israel yielded to His transforming\ngrace, Jesus would have made them His ambassadors among men.\nIn Judea first the coming of the kingdom had been proclaimed, and\nthe call to repentance had been given. In the act of driving out\nthe desecrators from the temple at Jerusalem, Jesus had announced\nHimself as the Messiah—the One who should cleanse the soul from\nthe defilement of sin and make His people a holy temple unto the\nLord. But the Jewish leaders would not humble themselves to receive\nthe lowly Teacher from Nazareth. At His second visit to Jerusalem\nHe was arraigned before the Sanhedrin, and fear of the people alone\nprevented these dignitaries from trying to take His life. Then it was\nthat, leaving Judea, He entered upon His ministry in Galilee.\nHis work there had continued some months before the Sermon on\nthe Mount was given. The message He had proclaimed throughout\nthe land, “The kingdom of heaven is at hand” (Matthew 4:17), had[3]\narrested the attention of all classes, and had still further fanned\nthe flame of their ambitious hopes. The fame of the new Teacher\nhad spread beyond the limits of Palestine, and, notwithstanding the\nattitude of the hierarchy, the feeling was widespread that this might\nbe the hoped-for Deliverer. Great multitudes thronged the steps of\nJesus, and the popular enthusiasm ran high.\nThe time had come for the disciples who had been most closely\nassociated with Christ to unite more directly in His work, that these\nvast throngs might not be left uncared for, as sheep without a shep-\nherd. Some of these disciples had joined themselves to Him at the\nbeginning of His ministry, and nearly all the twelve had been asso-\nciated together as members of the family of Jesus. Yet they also,\nmisled by the teaching of the rabbis, shared the popular expectation\nof an earthly kingdom. They could not comprehend the movements\nof Jesus. Already they had been perplexed and troubled that He\nmade no effort to strengthen His cause by securing the support of\nthe priests and rabbis, that He did nothing to establish His authority\nas an earthly king. A great work was yet to be accomplished for\nthese disciples before they would be prepared for the sacred trust\nthat would be theirs when Jesus should ascend to heaven. Yet they\nhad responded to the love of Christ, and, though slow of heart to\nbelieve, Jesus saw in them those whom He could train and discipline\nfor His great work. And now that they had been long enough with\nOn the Mountainside 11\nHim to establish, in a measure, their faith in the divine character\nof His mission, and the people also had received evidence of His\npower which they could not question, the way was prepared for an [4]\navowal of the principles of His kingdom that would help them to\ncomprehend its true nature.\nAlone upon a mountain near the Sea of Galilee, Jesus had spent\nall night in prayer for these chosen ones. At the dawn He called them\nto Him, and, with words of prayer and instruction, laid His hands\nupon their heads in benediction, setting them apart to the gospel\nwork. Then He repaired with them to the seaside, where in the early\nmorning a great multitude had already begun to assemble.\nBesides the usual crowd from the Galilean towns, there were\ngreat numbers from Judea, and from Jerusalem itself; from Perea,\nand from the half-heathen population of Decapolis; from Idumea,\naway to the south of Judea, and from Tyre and Sidon, the Phoenician\ncities on the shore of the Mediterranean. “Hearing what great things\nHe did,” they “came to hear Him, and to be healed of their diseases;\nand ... power came forth from Him, and healed them all.” Mark 3:8 ,\nR.V .; Luke 6:17-19 , R.V .\nThen, as the narrow beach did not afford even standing room\nwithin reach of His voice for all who desired to hear Him, Jesus\nled the way back to the mountainside. Reaching a level space that\nafforded a pleasant gathering place for the vast assembly, He seated\nHimself upon the grass, and His disciples and the multitude followed\nHis example.\nWith a feeling that something more than usual might be expected,\nthe disciples had pressed about their Master. From the events of the\nmorning they gathered assurance that some announcement was about [5]\nto be made in regard to the kingdom which, as they fondly hoped,\nHe was soon to establish. A feeling of expectancy pervaded the\nmultitude also, and eager faces gave evidence of the deep interest.\nAs they sat upon the green hillside, awaiting the words of the\ndivine Teacher, their hearts were filled with thoughts of future glory.\nThere were scribes and Pharisees who looked forward to the day\nwhen they should have dominion over the hated Romans and possess\nthe riches and splendor of the world’s great empire. The poor peas-\nants and fishermen hoped to hear the assurance that their wretched\nhovels, the scanty food, the life of toil, and fear of want, were to\n12 Thoughts from the Mount of Blessing\nbe exchanged for mansions of plenty and days of ease. In place of\nthe one coarse garment which was their covering by day and their\nblanket at night, they hoped that Christ would give them the rich and\ncostly robes of their conquerors.\nAll hearts thrilled with the proud hope that Israel was soon to be\nhonored before the nations as the chosen of the Lord, and Jerusalem\nexalted as the head of a universal kingdom.\nChapter 2—The Beatitudes [6]\n“He opened His mouth, and taught them, saying, Blessed are\nthe poor in spirit: for theirs is the kingdom of\nheaven.”—Matthew 5:2, 3.\nAs something strange and new, these words fall upon the ears\nof the wondering multitude. Such teaching is contrary to all they\nhave ever heard from priest or rabbi. They see in it nothing to flatter\ntheir pride or to feed their ambitious hopes. But there is about this\nnew Teacher a power that holds them spellbound. The sweetness of\ndivine love flows from His very presence as the fragrance from a\nflower. His words fall like “rain upon the mown grass: as showers\nthat water the earth.” Psalm 72:6. All feel instinctively that here is\nOne who reads the secrets of the soul, yet who comes near to them\nwith tender compassion. Their hearts open to Him, and, as they\nlisten, the Holy Spirit unfolds to them something of the meaning of\nthat lesson which humanity in all ages so needs to learn.\nIn the days of Christ the religious leaders of the people felt that\nthey were rich in spiritual treasure. The prayer of the Pharisee,\n“God, I thank Thee, that I am not as the rest of men” (Luke 18:11\n, R.V .), expressed the feeling of his class and, to a great degree,\nof the whole nation. But in the throng that surrounded Jesus there\nwere some who had a sense of their spiritual poverty. When in the\nmiraculous draft of fishes the divine power of Christ was revealed, [7]\nPeter fell at the Saviour’s feet, exclaiming, “Depart from me; for I\nam a sinful man, O Lord” (Luke 5:8); so in the multitude gathered\nupon the mount there were souls who, in the presence of His purity,\nfelt that they were “wretched, and miserable, and poor, and blind,\nand naked” (Revelation 3:17); and they longed for “the grace of God\nthat bringeth salvation” (Titus 2:11). In these souls, Christ’s words\nof greeting awakened hope; they saw that their lives were under the\nbenediction of God.\n13\n14 Thoughts from the Mount of Blessing\nJesus had presented the cup of blessing to those who felt that they\nwere “rich, and increased with goods” (Revelation 3:17), and had\nneed of nothing, and they had turned with scorn from the gracious\ngift. He who feels whole, who thinks that he is reasonably good, and\nis contented with his condition, does not seek to become a partaker\nof the grace and righteousness of Christ. Pride feels no need, and so\nit closes the heart against Christ and the infinite blessings He came\nto give. There is no room for Jesus in the heart of such a person.\nThose who are rich and honorable in their own eyes do not ask in\nfaith, and receive the blessing of God. They feel that they are full,\ntherefore they go away empty. Those who know that they cannot\npossibly save themselves, or of themselves do any righteous action,\nare the ones who appreciate the help that Christ can bestow. They\nare the poor in spirit, whom He declares to be blessed.\nWhom Christ pardons, He first makes penitent, and it is the office\nof the Holy Spirit to convince of sin. Those whose hearts have been\nmoved by the convicting Spirit of God see that there is nothing good[8]\nin themselves. They see that all they have ever done is mingled with\nself and sin. Like the poor publican, they stand afar off, not daring\nto lift up so much as their eyes to heaven, and cry, “God, be merciful\nto me the sinner.” Luke 18:13 , R.V ., margin. And they are blessed.\nThere is forgiveness for the penitent; for Christ is “the Lamb of God,\nwhich taketh away the sin of the world.” John 1:29. God’s promise\nis: “Though your sins be as scarlet, they shall be as white as snow;\nthough they be red like crimson, they shall be as wool.”” A new\nheart also will I give you.... And I will put My Spirit within you.”\nIsaiah 1:18; Ezekiel 36:26, 27.\nOf the poor in spirit Jesus says, “Theirs is the kingdom of\nheaven.” This kingdom is not, as Christ’s hearers had hoped, a\ntemporal and earthly dominion. Christ was opening to men the spir-\nitual kingdom of His love, His grace, His righteousness. The ensign\nof the Messiah’s reign is distinguished by the likeness of the Son of\nman. His subjects are the poor in spirit, the meek, the persecuted for\nrighteousness’ sake. The kingdom of heaven is theirs. Though not\nyet fully accomplished, the work is begun in them which will make\nthem “meet to be partakers of the inheritance of the saints in light.”\nColossians 1:12.\nBeatitudes 15\nAll who have a sense of their deep soul poverty, who feel that\nthey have nothing good in themselves, may find righteousness and\nstrength by looking unto Jesus. He says, “Come unto Me, all ye that\nlabor and are heavy-laden.” Matthew 11:28. He bids you exchange\nyour poverty for the riches of His grace. We are not worthy of God’s [9]\nlove, but Christ, our surety, is worthy, and is abundantly able to save\nall who shall come unto Him. Whatever may have been your past\nexperience, however discouraging your present circumstances, if you\nwill come to Jesus just as you are, weak, helpless, and despairing,\nour compassionate Saviour will meet you a great way off, and will\nthrow about you His arms of love and His robe of righteousness. He\npresents us to the Father clothed in the white raiment of His own\ncharacter. He pleads before God in our behalf, saying: I have taken\nthe sinner’s place. Look not upon this wayward child, but look on\nMe. Does Satan plead loudly against our souls, accusing of sin,\nand claiming us as his prey, the blood of Christ pleads with greater\npower.\n“Surely, shall one say, in the Lord have I righteousness and\nstrength.... In the Lord shall all the seed of Israel be justified, and\nshall glory.” Isaiah 45:24, 25.\n“Blessed are they that mourn: for they shall be\ncomforted.”—Matthew 5:4.\nThe mourning here brought to view is true heart sorrow for sin.\nJesus says, “I, if I be lifted up from the earth, will draw all men unto\nMe.” John 12:32. And as one is drawn to behold Jesus uplifted on the\ncross, he discerns the sinfulness of humanity. He sees that it is sin\nwhich scourged and crucified the Lord of glory. He sees that, while\nhe has been loved with unspeakable tenderness, his life has been a\ncontinual scene of ingratitude and rebellion. He has forsaken his\nbest Friend and abused heaven’s most precious gift. He has crucified [10]\nto himself the Son of God afresh and pierced anew that bleeding\nand stricken heart. He is separated from God by a gulf of sin that is\nbroad and black and deep, and he mourns in brokenness of heart.\nSuch mourning “shall be comforted.” God reveals to us our guilt\nthat we may flee to Christ, and through Him be set free from the\nbondage of sin, and rejoice in the liberty of the sons of God. In true\n16 Thoughts from the Mount of Blessing\ncontrition we may come to the foot of the cross, and there leave our\nburdens.\nThe Saviour’s words have a message of comfort to those also\nwho are suffering affliction or bereavement. Our sorrows do not\nspring out of the ground. God “doth not afflict willingly nor grieve\nthe children of men.” Lamentations 3:33. When He permits trials\nand afflictions, it is “for our profit, that we might be partakers of His\nholiness.” Hebrews 12:10. If received in faith, the trial that seems\nso bitter and hard to bear will prove a blessing. The cruel blow that\nblights the joys of earth will be the means of turning our eyes to\nheaven. How many there are who would never have known Jesus\nhad not sorrow led them to seek comfort in Him!\nThe trials of life are God’s workmen, to remove the impurities\nand roughness from our character. Their hewing, squaring, and\nchiseling, their burnishing and polishing, is a painful process; it is\nhard to be pressed down to the grinding wheel. But the stone is\nbrought forth prepared to fill its place in the heavenly temple. Upon\nno useless material does the Master bestow such careful, thorough\nwork. Only His precious stones are polished after the similitude of a\npalace.\nThe Lord will work for all who put their trust in Him. Precious[11]\nvictories will be gained by the faithful. Precious lessons will be\nlearned. Precious experiences will be realized.\nOur heavenly Father is never unmindful of those whom sorrow\nhas touched. When David went up the Mount Olivet, “and wept\nas he went up, and had his head covered, and he went barefoot” (2\nSamuel 15:30), the Lord was looking pityingly upon him. David was\nclothed in sackcloth, and his conscience was scourging him. The\noutward signs of humiliation testified of his contrition. In tearful,\nheartbroken utterances he presented his case to God, and the Lord\ndid not forsake His servant. Never was David dearer to the heart\nof Infinite Love than when, conscience-smitten, he fled for his life\nfrom his enemies, who had been stirred to rebellion by his own son.\nThe Lord says, “As many as I love, I rebuke and chasten: be zealous\ntherefore, and repent.” Revelation 3:19. Christ lifts up the contrite\nheart and refines the mourning soul until it becomes His abode.\nBut when tribulation comes upon us, how many of us are like\nJacob! We think it the hand of an enemy; and in the darkness we\nBeatitudes 17\nwrestle blindly until our strength is spent, and we find no comfort or\ndeliverance. To Jacob the divine touch at break of day revealed the\nOne with whom he had been contending—the Angel of the covenant;\nand, weeping and helpless, he fell upon the breast of Infinite Love,\nto receive the blessing for which his soul longed. We also need to\nlearn that trials mean benefit, and not to despise the chastening of\nthe Lord nor faint when we are rebuked of Him.\n“Happy is the man whom God correcteth: ... He maketh sore, [12]\nand bindeth up: He woundeth, and His hands make whole. He shall\ndeliver thee in six troubles: yea, in seven there shall no evil touch\nthee.” Job 5:17-19. To every stricken one, Jesus comes with the\nministry of healing. The life of bereavement, pain, and suffering\nmay be brightened by precious revealings of His presence.\nGod would not have us remain pressed down by dumb sorrow,\nwith sore and breaking hearts. He would have us look up and behold\nHis dear face of love. The blessed Saviour stands by many whose\neyes are so blinded by tears that they do not discern Him. He longs\nto clasp our hands, to have us look to Him in simple faith, permitting\nHim to guide us. His heart is open to our griefs, our sorrows, and\nour trials. He has loved us with an everlasting love and with loving-\nkindness compassed us about. We may keep the heart stayed upon\nHim and meditate upon His loving-kindness all the day. He will lift\nthe soul above the daily sorrow and perplexity, into a realm of peace.\nThink of this, children of suffering and sorrow, and rejoice in\nhope. “This is the victory that overcometh the world, even our faith.”\n1 John 5:4.\nBlessed are they also who weep with Jesus in sympathy with the\nworld’s sorrow and in sorrow for its sin. In such mourning there\nis intermingled no thought of self. Jesus was the Man of Sorrows,\nenduring heart anguish such as no language can portray. His spirit\nwas torn and bruised by the transgressions of men. He toiled with\nself-consuming zeal to relieve the wants and woes of humanity, and\nHis heart was heavy with sorrow as He saw multitudes refuse to [13]\ncome to Him that they might have life. All who are followers of\nChrist will share in this experience. As they partake of His love they\nwill enter into His travail for the saving of the lost. They share in the\nsufferings of Christ, and they will share also in the glory that shall\n18 Thoughts from the Mount of Blessing\nbe revealed. One with Him in His work, drinking with Him the cup\nof sorrow, they are partakers also of His joy.\nIt was through suffering that Jesus obtained the ministry of con-\nsolation. In all the affliction of humanity He is afflicted; and “in\nthat He Himself hath suffered being tempted, He is able to succor\nthem that are tempted.” Isaiah 63:9; Hebrews 2:18. In this ministry\nevery soul that has entered into the fellowship of His sufferings is\nprivileged to share. “As the sufferings of Christ abound in us, so our\nconsolation also aboundeth by Christ.” 2 Corinthians 1:5. The Lord\nhas special grace for the mourner, and its power is to melt hearts, to\nwin souls. His love opens a channel into the wounded and bruised\nsoul, and becomes a healing balsam to those who sorrow. “The\nFather of mercies, and the God of all comfort ... comforteth us in all\nour tribulation, that we may be able to comfort them which are in\nany trouble, by the comfort wherewith we ourselves are comforted\nof God.” 2 Corinthians 1:3, 4.\n“Blessed are the meek.”—Matthew 5:5.\nThroughout the Beatitudes there is an advancing line of Christian\nexperience. Those who have felt their need of Christ, those who\nhave mourned because of sin and have sat with Christ in the school[14]\nof affliction, will learn meekness from the divine Teacher.\nPatience and gentleness under wrong were not characteristics\nprized by the heathen or by the Jews. The statement made by Moses\nunder the inspiration of the Holy Spirit, that he was the meekest\nman upon the earth, would not have been regarded by the people\nof his time as a commendation; it would rather have excited pity or\ncontempt. But Jesus places meekness among the first qualifications\nfor His kingdom. In His own life and character the divine beauty of\nthis precious grace is revealed.\nJesus, the brightness of the Father’s glory, thought “it not a\nthing to be grasped to be on an equality with God, but emptied\nHimself, taking the form of a servant.” Philippians 2:6, 7 , R.V .,\nmargin. Through all the lowly experiences of life He consented to\npass, walking among the children of men, not as a king, to demand\nhomage, but as one whose mission it was to serve others. There was\nin His manner no taint of bigotry, no cold austerity. The world’s\nBeatitudes 19\nRedeemer had a greater than angelic nature, yet united with His\ndivine majesty were meekness and humility that attracted all to\nHimself.\nJesus emptied Himself, and in all that He did, self did not appear.\nHe subordinated all things to the will of His Father. When His\nmission on earth was about to close, He could say, “I have glorified\nThee on the earth: I have finished the work which Thou gavest Me\nto do.” John 17:4. And He bids us, “Learn of Me; for I am meek\nand lowly in heart.” “If any man will come after Me, let him deny\nhimself” (Matthew 11:29; 16:24); let self be dethroned and no longer [15]\nhold the supremacy of the soul.\nHe who beholds Christ in His self-denial, His lowliness of heart,\nwill be constrained to say, as did Daniel, when he beheld One like\nthe sons of men, “My comeliness was turned in me into corruption.”\nDaniel 10:8. The independence and self-supremacy in which we\nglory are seen in their true vileness as tokens of servitude to Satan.\nHuman nature is ever struggling for expression, ready for contest;\nbut he who learns of Christ is emptied of self, of pride, of love of\nsupremacy, and there is silence in the soul. Self is yielded to the\ndisposal of the Holy Spirit. Then we are not anxious to have the\nhighest place. We have no ambition to crowd and elbow ourselves\ninto notice; but we feel that our highest place is at the feet of our\nSaviour. We look to Jesus, waiting for His hand to lead, listening\nfor His voice to guide. The apostle Paul had this experience, and he\nsaid, “I am crucified with Christ: nevertheless I live; yet not I, but\nChrist liveth in me: and the life which I now live in the flesh I live\nby the faith of the Son of God, who loved me, and gave Himself for\nme.” Galatians 2:20.\nWhen we receive Christ as an abiding guest in the soul, the peace\nof God, which passeth all understanding, will keep our hearts and\nminds through Christ Jesus. The Saviour’s life on earth, though lived\nin the midst of conflict, was a life of peace. While angry enemies\nwere constantly pursuing Him, He said, “He that sent Me is with\nMe: the Father hath not left Me alone; for I do always those things\nthat please Him.” John 8:29. No storm of human or satanic wrath\ncould disturb the calm of that perfect communion with God. And [16]\nHe says to us, “Peace I leave with you, My peace I give unto you.”\n“Take My yoke upon you, and learn of Me; for I am meek and lowly\n20 Thoughts from the Mount of Blessing\nin heart: and ye shall find rest.” John 14:27; Matthew 11:29. Bear\nwith Me the yoke of service for the glory of God and the uplifting\nof humanity, and you will find the yoke easy and the burden light.\nIt is the love of self that destroys our peace. While self is all alive,\nwe stand ready continually to guard it from mortification and insult;\nbut when we are dead, and our life is hid with Christ in God, we shall\nnot take neglects or slights to heart. We shall be deaf to reproach\nand blind to scorn and insult. “Love suffereth long, and is kind;\nlove envieth not; love vaunteth not itself, is not puffed up, doth not\nbehave itself unseemly, seeketh not its own, is not provoked, taketh\nnot account of evil; rejoiceth not in unrighteousness, but rejoiceth\nwith the truth; beareth all things, believeth all things, hopeth all\nthings, endureth all things. Love never faileth.” 1 Corinthians 13:4-8",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "7:25, R. V . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 109",
        "chunk_index": 0,
        "page_reference": "12-23",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110409"
      }
    },
    {
      "id": "thoughts_mount_blessing_000005",
      "text": "Happiness drawn from earthly sources is as changeable as vary-\ning circumstances can make it; but the peace of Christ is a constant\nand abiding peace. It does not depend upon any circumstances in\nlife, on the amount of worldly goods or the number of earthly friends.\nChrist is the fountain of living water, and happiness drawn from\nHim can never fail.\nThe meekness of Christ, manifested in the home, will make the\ninmates happy; it provokes no quarrel, gives back no angry answer,\nbut soothes the irritated temper and diffuses a gentleness that is felt\nby all within its charmed circle. Wherever cherished, it makes the[17]\nfamilies of earth a part of the one great family above.\nFar better would it be for us to suffer under false accusation than\nto inflict upon ourselves the torture of retaliation upon our enemies.\nThe spirit of hatred and revenge originated with Satan, and can bring\nonly evil to him who cherishes it. Lowliness of heart, that meekness\nwhich is the fruit of abiding in Christ, is the true secret of blessing.\n“He will beautify the meek with salvation.” Psalm 149:4.\nThe meek “shall inherit the earth.” It was through the desire for\nself-exaltation that sin entered into the world, and our first parents\nlost the dominion over this fair earth, their kingdom. It is through\nself-abnegation that Christ redeems what was lost. And He says we\nare to overcome as He did. Revelation 3:21. Through humility and\nself-surrender we may become heirs with Him when “the meek shall\ninherit the earth.” Psalm 37:11.\nBeatitudes 21\nThe earth promised to the meek will not be like this, darkened\nwith the shadow of death and the curse. “We, according to His\npromise, look for new heavens and a new earth, wherein dwelleth\nrighteousness.” “There shall be no more curse: but the throne of God\nand of the Lamb shall be in it; and His servants shall serve Him.” 2\nPeter 3:13; Revelation 22:3.\nThere is no disappointment, no sorrow, no sin, no one who shall\nsay, I am sick; there are no burial trains, no mourning, no death, no\npartings, no broken hearts; but Jesus is there, peace is there. There\n“they shall not hunger nor thirst; neither shall the heat nor sun smite\nthem: for He that hath mercy on them shall lead them, even by the [18]\nsprings of water shall He guide them.” Isaiah 49:10.\n“Blessed are they which do hunger and thirst after\nrighteousness: for they shall be filled.”—Matthew 5:6.\nRighteousness is holiness, likeness to God, and “God is love.”\n1 John 4:16. It is conformity to the law of God, for “all Thy com-\nmandments are righteousness” (Psalm 119:172), and “love is the\nfulfilling of the law” (Romans 13:10). Righteousness is love, and\nlove is the light and the life of God. The righteousness of God is\nembodied in Christ. We receive righteousness by receiving Him.\nNot by painful struggles or wearisome toil, not by gift or sacrifice,\nis righteousness obtained; but it is freely given to every soul who\nhungers and thirsts to receive it. “Ho, every one that thirsteth, come\nye to the waters, and he that hath no money; come ye, buy, and eat,\n... without money and without price.” “Their righteousness is of Me,\nsaith the Lord,” and, “This is His name whereby He shall be called,\nThe Lord Our Righteousness.” Isaiah 55:1; 54:17; Jeremiah 23:6.\nNo human agent can supply that which will satisfy the hunger\nand thirst of the soul. But Jesus says, “Behold, I stand at the door,\nand knock: if any man hear My voice, and open the door, I will\ncome in to him, and will sup with him, and he with Me.” “I am the\nbread of life: he that cometh to Me shall never hunger; and he that [19]\nbelieveth on Me shall never thirst.” Revelation 3:20; John 6:35.\nAs we need food to sustain our physical strength, so do we need\nChrist, the Bread from heaven, to sustain spiritual life and impart\nstrength to work the works of God. As the body is continually\n22 Thoughts from the Mount of Blessing\nreceiving the nourishment that sustains life and vigor, so the soul\nmust be constantly communing with Christ, submitting to Him and\ndepending wholly upon Him.\nAs the weary traveler seeks the spring in the desert and, finding\nit, quenches his burning thirst, so will the Christian thirst for and\nobtain the pure water of life, of which Christ is the fountain.\nAs we discern the perfection of our Saviour’s character we shall\ndesire to become wholly transformed and renewed in the image of\nHis purity. The more we know of God, the higher will be our ideal\nof character and the more earnest our longing to reflect His likeness.\nA divine element combines with the human when the soul reaches\nout after God and the longing heart can say, “My soul, wait thou\nonly upon God; for my expectation is from Him.” Psalm 62:5.\nIf you have a sense of need in your soul, if you hunger and\nthirst after righteousness, this is an evidence that Christ has wrought\nupon your heart, in order that He may be sought unto to do for you,\nthrough the endowment of the Holy Spirit, those things which it is\nimpossible for you to do for yourself. We need not seek to quench\nour thirst at shallow streams; for the great fountain is just above us,\nof whose abundant waters we may freely drink, if we will rise a little\nhigher in the pathway of faith.\nThe words of God are the wellsprings of life. As you seek unto[20]\nthose living springs you will, through the Holy Spirit, be brought\ninto communion with Christ. Familiar truths will present themselves\nto your mind in a new aspect, texts of Scripture will burst upon you\nwith a new meaning as a flash of light, you will see the relation of\nother truths to the work of redemption, and you will know that Christ\nis leading you, a divine Teacher is at your side.\nJesus said, “The water that I shall give him shall be in him a well\nof water springing up into everlasting life.” John 4:14. As the Holy\nSpirit opens to you the truth you will treasure up the most precious\nexperiences and will long to speak to others of the comforting things\nthat have been revealed to you. When brought into association with\nthem you will communicate some fresh thought in regard to the\ncharacter or the work of Christ. You will have some fresh revelation\nof His pitying love to impart to those who love Him and to those\nwho love Him not.\nBeatitudes 23\n“Give, and it shall be given unto you” (Luke 6:38); for the word\nof God is “a fountain of gardens, a well of living waters, and streams\nof Lebanon” (Song of Solomon 4:15). The heart that has once tasted\nthe love of Christ, cries out continually for a deeper draft, and as\nyou impart you will receive in richer and more abundant measure.\nEvery revelation of God to the soul increases the capacity to know\nand to love. The continual cry of the heart is, “More of Thee,” and\never the Spirit’s answer is, “Much more.” Romans 5:9, 10. For\nour God delights to do “exceeding abundantly above all that we\nask or think.” Ephesians 3:20. To Jesus, who emptied Himself for [21]\nthe salvation of lost humanity, the Holy Spirit was given without\nmeasure. So it will be given to every follower of Christ when the\nwhole heart is surrendered for His indwelling. Our Lord Himself\nhas given the command, “Be filled with the Spirit” (Ephesians 5:18),\nand this command is also a promise of its fulfillment. It was the\ngood pleasure of the Father that in Christ should “all the fullness\ndwell,” and “in Him ye are made full.” Colossians 1:19 , R.V .; 2:10,",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": ", R.V .",
        "chunk_index": 0,
        "page_reference": "24-26",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110415"
      }
    },
    {
      "id": "thoughts_mount_blessing_000006",
      "text": "God has poured out His love unstintedly, as the showers that\nrefresh the earth. He says, “Let the skies pour down righteousness:\nlet the earth open, and let them bring forth salvation, and let righ-\nteousness spring up together.” “When the poor and needy seek water,\nand there is none, and their tongue faileth for thirst, I the Lord will\nhear them, I the God of Israel will not forsake them. I will open\nrivers in high places, and fountains in the midst of the valleys: I will\nmake the wilderness a pool of water, and the dry land springs of\nwater.” Isaiah 45:8; 41:17, 18.\n“Of His fullness have all we received, and grace for grace.” John\n1:16.\n“Blessed are the merciful: for they shall obtain\nmercy.”—Matthew 5:7.\nThe heart of man is by nature cold and dark and unloving; when-\never one manifests a spirit of mercy and forgiveness, he does it not\nof himself, but through the influence of the divine Spirit moving [22]\nupon his heart. “We love, because He first loved us.” 1 John 4:19 ,",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "R.V .",
        "chunk_index": 0,
        "page_reference": "27-unknown",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110419"
      }
    },
    {
      "id": "thoughts_mount_blessing_000007",
      "text": "24 Thoughts from the Mount of Blessing\nGod is Himself the source of all mercy. His name is “merciful\nand gracious.” Exodus 34:6. He does not treat us according to\nour desert. He does not ask if we are worthy of His love, but He\npours upon us the riches of His love, to make us worthy. He is not\nvindictive. He seeks not to punish, but to redeem. Even the severity\nwhich He manifests through His providences is manifested for the\nsalvation of the wayward. He yearns with intense desire to relieve\nthe woes of men and to apply His balsam to their wounds. It is true\nthat God “will by no means clear the guilty” (Exodus 34:7), but He\nwould take away the guilt.\nThe merciful are “partakers of the divine nature,” and in them the\ncompassionate love of God finds expression. All whose hearts are in\nsympathy with the heart of Infinite Love will seek to reclaim and not\nto condemn. Christ dwelling in the soul is a spring that never runs\ndry. Where He abides, there will be an overflowing of beneficence.\nTo the appeal of the erring, the tempted, the wretched victims of\nwant and sin, the Christian does not ask, Are they worthy? but, How\ncan I benefit them? In the most wretched, the most debased, he sees\nsouls whom Christ died to save and for whom God has given to His\nchildren the ministry of reconciliation.\nThe merciful are those who manifest compassion to the poor,\nthe suffering, and the oppressed. Job declares, “I delivered the poor[23]\nthat cried, and the fatherless, and him that had none to help him.\nThe blessing of him that was ready to perish came upon me: and I\ncaused the widow’s heart to sing for joy. I put on righteousness, and\nit clothed me: my judgment was as a robe and a diadem. I was eyes\nto the blind, and feet was I to the lame. I was a father to the poor:\nand the cause which I knew not I searched out.” Job 29:12-16.\nThere are many to whom life is a painful struggle; they feel their\ndeficiencies and are miserable and unbelieving; they think they have\nnothing for which to be grateful. Kind words, looks of sympathy,\nexpressions of appreciation, would be to many a struggling and\nlonely one as the cup of cold water to a thirsty soul. A word of\nsympathy, an act of kindness, would lift burdens that rest heavily\nupon weary shoulders. And every word or deed of unselfish kindness\nis an expression of the love of Christ for lost humanity.\nThe merciful “shall obtain mercy.” “The soul of blessing shall\nbe made fat: and he that watereth shall be watered also himself.”\nBeatitudes 25\nProverbs 11:25 , margin. There is sweet peace for the compassionate\nspirit, a blessed satisfaction in the life of self-forgetful service for\nthe good of others. The Holy Spirit that abides in the soul and is\nmanifest in the life will soften hard hearts and awaken sympathy\nand tenderness. You will reap that which you sow. “Blessed is he\nthat considereth the poor.... The Lord will preserve him, and keep\nhim alive; and he shall be blessed upon the earth: and Thou wilt not\ndeliver him unto the will of his enemies. The Lord will strengthen\nhim upon the bed of languishing: Thou wilt make all his bed in his [24]\nsickness.” Psalm 41:1-3.\nHe who has given his life to God in ministry to His children is\nlinked with Him who has all the resources of the universe at His\ncommand. His life is bound up by the golden chain of the immutable\npromises with the life of God. The Lord will not fail him in the hour\nof suffering and need. “My God shall supply all your need according\nto His riches in glory by Christ Jesus.” Philippians 4:19. And in\nthe hour of final need the merciful shall find refuge in the mercy\nof the compassionate Saviour and shall be received into everlasting\nhabitations.\n“Blessed are the pure in heart: for they shall see\nGod.”—Matthew 5:8.\nThe Jews were so exacting in regard to ceremonial purity that\ntheir regulations were extremely burdensome. Their minds were oc-\ncupied with rules and restrictions and the fear of outward defilement,\nand they did not perceive the stain that selfishness and malice impart\nto the soul.\nJesus does not mention this ceremonial purity as one of the con-\nditions of entering into His kingdom, but points out the need of\npurity of heart. The wisdom that is from above “is first pure.” James\n3:17. Into the city of God there will enter nothing that defiles. All\nwho are to be dwellers there will here have become pure in heart. In\none who is learning of Jesus, there will be manifest a growing dis-\ntaste for careless manners, unseemly language, and coarse thought. [25]\nWhen Christ abides in the heart, there will be purity and refinement\nof thought and manner.\n26 Thoughts from the Mount of Blessing\nBut the words of Jesus, “Blessed are the pure in heart,” have a\ndeeper meaning—not merely pure in the sense in which the world\nunderstands purity, free from that which is sensual, pure from lust,\nbut true in the hidden purposes and motives of the soul, free from\npride and self-seeking, humble, unselfish, childlike.\nOnly like can appreciate like. Unless you accept in your own\nlife the principle of self-sacrificing love, which is the principle of\nHis character, you cannot know God. The heart that is deceived by\nSatan, looks upon God as a tyrannical, relentless being; the selfish\ncharacteristics of humanity, even of Satan himself, are attributed\nto the loving Creator. “Thou thoughtest,” He says, “that I was\naltogether such an one as thyself.” Psalm 50:21. His providences\nare interpreted as the expression of an arbitrary, vindictive nature.\nSo with the Bible, the treasure house of the riches of His grace. The\nglory of its truths, that are as high as heaven and compass eternity, is\nundiscerned. To the great mass of mankind, Christ Himself is “as a\nroot out of a dry ground,” and they see in Him “no beauty that” they\n“should desire Him.” Isaiah 53:2. When Jesus was among men, the\nrevelation of God in humanity, the scribes and Pharisees declared to\nHim, “Thou art a Samaritan, and hast a devil.” John 8:48. Even His\ndisciples were so blinded by the selfishness of their hearts that they\nwere slow to understand Him who had come to manifest to them the\nFather’s love. This was why Jesus walked in solitude in the midst of[26]\nmen. He was understood fully in heaven alone.\nWhen Christ shall come in His glory, the wicked cannot endure\nto behold Him. The light of His presence, which is life to those who\nlove Him, is death to the ungodly. The expectation of His coming\nis to them a “fearful looking for of judgment and fiery indignation.”\nHebrews 10:27. When He shall appear, they will pray to be hidden\nfrom the face of Him who died to redeem them.\nBut to hearts that have become purified through the indwelling\nof the Holy Spirit, all is changed. These can know God. Moses was\nhid in the cleft of the rock when the glory of the Lord was revealed\nto him; and it is when we are hid in Christ that we behold the love\nof God.\n“He that loveth pureness of heart, for the grace of his lips the\nKing shall be his friend.” Proverbs 22:11. By faith we behold Him\nhere and now. In our daily experience we discern His goodness and\nBeatitudes 27\ncompassion in the manifestation of His providence. We recognize\nHim in the character of His Son. The Holy Spirit takes the truth\nconcerning God and Him whom He hath sent, and opens it to the\nunderstanding and to the heart. The pure in heart see God in a new\nand endearing relation, as their Redeemer; and while they discern\nthe purity and loveliness of His character, they long to reflect His\nimage. They see Him as a Father longing to embrace a repenting\nson, and their hearts are filled with joy unspeakable and full of glory.\nThe pure in heart discern the Creator in the works of His mighty [27]\nhand, in the things of beauty that comprise the universe. In His\nwritten word they read in clearer lines the revelation of His mercy,\nHis goodness, and His grace. The truths that are hidden from the\nwise and prudent are revealed to babes. The beauty and preciousness\nof truth, which are undiscerned by the worldly-wise, are constantly\nunfolding to those who have a trusting, childlike desire to know and\nto do the will of God. We discern the truth by becoming, ourselves,\npartakers of the divine nature.\nThe pure in heart live as in the visible presence of God during\nthe time He apportions them in this world. And they will also see\nHim face to face in the future, immortal state, as did Adam when he\nwalked and talked with God in Eden. “Now we see through a glass,\ndarkly; but then face to face.” 1 Corinthians 13:12.\n“Blessed are the peacemakers: for they shall be called the\nchildren of God.”—Matthew 5:9.\nChrist is “the Prince of Peace” (Isaiah 9:6), and it is His mission\nto restore to earth and heaven the peace that sin has broken. “Being\njustified by faith, we have peace with God through our Lord Jesus\nChrist.” Romans 5:1. Whoever consents to renounce sin and open\nhis heart to the love of Christ, becomes a partaker of this heavenly\npeace.\nThere is no other ground of peace than this. The grace of Christ\nreceived into the heart, subdues enmity; it allays strife and fills\nthe soul with love. He who is at peace with God and his fellow [28]\nmen cannot be made miserable. Envy will not be in his heart; evil\nsurmisings will find no room there; hatred cannot exist. The heart\nthat is in harmony with God is a partaker of the peace of heaven and\n28 Thoughts from the Mount of Blessing\nwill diffuse its blessed influence on all around. The spirit of peace\nwill rest like dew upon hearts weary and troubled with worldly strife.\nChrist’s followers are sent to the world with the message of\npeace. Whoever, by the quiet, unconscious influence of a holy life,\nshall reveal the love of Christ; whoever, by word or deed, shall lead\nanother to renounce sin and yield his heart to God, is a peacemaker.\nAnd “blessed are the peacemakers: for they shall be called the\nchildren of God.” The spirit of peace is evidence of their connec-\ntion with heaven. The sweet savor of Christ surrounds them. The\nfragrance of the life, the loveliness of the character, reveal to the\nworld the fact that they are children of God. Men take knowledge\nof them that they have been with Jesus. “Everyone that loveth is\nborn of God.” “If any man have not the Spirit of Christ, he is none\nof His;” but “as many as are led by the Spirit of God, they are the\nsons of God.” 1 John 4:7; Romans 8:9, 14.\n“And the remnant of Jacob shall be in the midst of many people\nas a dew from the Lord, as the showers upon the grass, that tarrieth\nnot for man, nor waiteth for the sons of men.” Micah 5:7.\n“Blessed are they which are persecuted for righteousness’[29]\nsake: for theirs is the kingdom of heaven.”—Matthew 5:10.\nJesus does not present to His followers the hope of attaining\nearthly glory and riches, and of having a life free from trial, but He\npresents to them the privilege of walking with their Master in the\npaths of self-denial and reproach, because the world knows them\nnot.\nHe who came to redeem the lost world was opposed by the\nunited forces of the adversaries of God and man. In an unpitying\nconfederacy, evil men and evil angels arrayed themselves against\nthe Prince of Peace. Though His every word and act breathed of\ndivine compassion, His unlikeness to the world provoked the bitterest\nhostility. Because He would give no license for the exercise of the\nevil passions of our nature, He aroused the fiercest opposition and\nenmity. So it is with all who will live godly in Christ Jesus. Between\nrighteousness and sin, love and hatred, truth and falsehood, there is\nan irrepressible conflict. When one presents the love of Christ and\nthe beauty of holiness, he is drawing away the subjects of Satan’s\nBeatitudes 29\nkingdom, and the prince of evil is aroused to resist it. Persecution\nand reproach await all who are imbued with the Spirit of Christ.\nThe character of the persecution changes with the times, but the\nprinciple—the spirit that underlies it—is the same that has slain the\nchosen of the Lord ever since the days of Abel.\nAs men seek to come into harmony with God, they will find that [30]\nthe offense of the cross has not ceased. Principalities and powers\nand wicked spirits in high places are arrayed against all who yield\nobedience to the law of heaven. Therefore, so far from causing grief,\npersecution should bring joy to the disciples of Christ, for it is an\nevidence that they are following in the steps of their Master.\nWhile the Lord has not promised His people exemption from\ntrials, He has promised that which is far better. He has said, “As thy\ndays, so shall thy strength be.” “My grace is sufficient for thee: for\nMy strength is made perfect in weakness.” Deuteronomy 33:25; 2\nCorinthians 12:9. If you are called to go through the fiery furnace for\nHis sake, Jesus will be by your side even as He was with the faithful\nthree in Babylon. Those who love their Redeemer will rejoice at\nevery opportunity of sharing with Him humiliation and reproach.\nThe love they bear their Lord makes suffering for His sake sweet.\nIn all ages Satan has persecuted the people of God. He has\ntortured them and put them to death, but in dying they became\nconquerors. They revealed in their steadfast faith a mightier One\nthan Satan. Satan could torture and kill the body, but he could not\ntouch the life that was hid with Christ in God. He could incarcerate\nin prison walls, but he could not bind the spirit. They could look\nbeyond the gloom to the glory, saying, “I reckon that the sufferings\nof this present time are not worthy to be compared with the glory\nwhich shall be revealed in us.” “Our light affliction, which is but for\na moment, worketh for us a far more exceeding and eternal weight\nof glory.” Romans 8:18; 2 Corinthians 4:17.\nThrough trials and persecution, the glory—character—of God [31]\nis revealed in His chosen ones. The church of God, hated and\npersecuted by the world, are educated and disciplined in the school\nof Christ. They walk in narrow paths on earth; they are purified in the\nfurnace of affliction. They follow Christ through sore conflicts; they\nendure self-denial and experience bitter disappointments; but their\npainful experience teaches them the guilt and woe of sin, and they\n30 Thoughts from the Mount of Blessing\nlook upon it with abhorrence. Being partakers of Christ’s sufferings,\nthey are destined to be partakers of His glory. In holy vision the\nprophet saw the triumph of the people of God. He says, “I saw as\nit were a sea of glass mingled with fire: and them that had gotten\nthe victory, ... stand on the sea of glass, having the harps of God.\nAnd they sing the song of Moses the servant of God, and the song\nof the Lamb, saying, Great and marvelous are Thy works, Lord God\nAlmighty; just and true are Thy ways, Thou King of saints.” “These\nare they which came out of great tribulation, and have washed their\nrobes, and made them white in the blood of the Lamb. Therefore are\nthey before the throne of God, and serve Him day and night in His\ntemple: and He that sitteth on the throne shall dwell among them.”\nRevelation 15:2, 3; 7:14, 15.\n“Blessed are ye, when men shall revile you.”—Matthew 5:11.\nEver since his fall, Satan has worked by means of deception. As\nhe has misrepresented God, so, through his agents, he misrepresents\nthe children of God. The Saviour says, “The reproaches of them that\nreproached Thee are fallen upon Me.” Psalm 69:9. In like manner[32]\nthey fall upon His disciples.\nThere was never one who walked among men more cruelly\nslandered than the Son of man. He was derided and mocked because\nof His unswerving obedience to the principles of God’s holy law.\nThey hated Him without a cause. Yet He stood calmly before His\nenemies, declaring that reproach is a part of the Christian’s legacy,\ncounseling His followers how to meet the arrows of malice, bidding\nthem not to faint under persecution.\nWhile slander may blacken the reputation, it cannot stain the\ncharacter. That is in God’s keeping. So long as we do not consent to\nsin, there is no power, whether human or satanic, that can bring a\nstain upon the soul. A man whose heart is stayed upon God is just the\nsame in the hour of his most afflicting trials and most discouraging\nsurroundings as when he was in prosperity, when the light and favor\nof God seemed to be upon him. His words, his motives, his actions,\nmay be misrepresented and falsified, but he does not mind it, because\nhe has greater interests at stake. Like Moses, he endures as “seeing\nHim who is invisible” (Hebrews 11:27); looking “not at the things\nBeatitudes 31\nwhich are seen, but at the things which are not seen” (2 Corinthians\n4:18).\nChrist is acquainted with all that is misunderstood and misrep-\nresented by men. His children can afford to wait in calm patience\nand trust, no matter how much maligned and despised; for nothing\nis secret that shall not be made manifest, and those who honor God\nshall be honored by Him in the presence of men and angels.\n“When men shall revile you, and persecute you,” said Jesus, [33]\n“rejoice, and be exceeding glad.” And He pointed His hearers to the\nprophets who had spoken in the name of the Lord, as “an example\nof suffering affliction, and of patience.” James 5:10. Abel, the very\nfirst Christian of Adam’s children, died a martyr. Enoch walked\nwith God, and the world knew him not. Noah was mocked as a\nfanatic and an alarmist. “Others had trial of cruel mockings and\nscourgings, yea, moreover of bonds and imprisonment.” “Others\nwere tortured, not accepting deliverance; that they might obtain a\nbetter resurrection.” Hebrews 11:36, 35.\nIn every age God’s chosen messengers have been reviled and\npersecuted, yet through their affliction the knowledge of God has\nbeen spread abroad. Every disciple of Christ is to step into the\nranks and carry forward the same work, knowing that its foes can do\nnothing against the truth, but for the truth. God means that truth shall\nbe brought to the front and become the subject of examination and\ndiscussion, even through the contempt placed upon it. The minds of\nthe people must be agitated; every controversy, every reproach, every\neffort to restrict liberty of conscience, is God’s means of awakening\nminds that otherwise might slumber.\nHow often this result has been seen in the history of God’s\nmessengers! When the noble and eloquent Stephen was stoned to\ndeath at the instigation of the Sanhedrin council, there was no loss\nto the cause of the gospel. The light of heaven that glorified his face,\nthe divine compassion breathed in his dying prayer, were as a sharp\narrow of conviction to the bigoted Sanhedrist who stood by, and Saul, [34]\nthe persecuting Pharisee, became a chosen vessel to bear the name\nof Christ before Gentiles and kings and the children of Israel. And\nlong afterward Paul the aged wrote from his prison house at Rome:\n“Some indeed preach Christ even of envy and strife: ... not sincerely,\nsupposing to add affliction to my bonds.... Notwithstanding, every\n32 Thoughts from the Mount of Blessing\nway, whether in pretense, or in truth, Christ is preached.” Philippians\n1:15-18. Through Paul’s imprisonment the gospel was spread abroad,\nand souls were won for Christ in the very palace of the Caesars. By\nthe efforts of Satan to destroy it, the “incorruptible” seed of the word\nof God, “which liveth and abideth forever” (1 Peter 1:23), is sown\nin the hearts of men; through the reproach and persecution of His\nchildren the name of Christ is magnified and souls are saved.\nGreat is the reward in heaven of those who are witnesses for\nChrist through persecution and reproach. While the people are\nlooking for earthly good, Jesus points them to a heavenly reward.\nBut He does not place it all in the future life; it begins here. The\nLord appeared of old time to Abraham and said, “I am thy shield,\nand thy exceeding great reward.” Genesis 15:1. This is the reward\nof all who follow Christ. Jehovah Immanuel—He “in whom are\nhid all the treasures of wisdom and knowledge,” in whom dwells\n“all the fullness of the Godhead bodily” (Colossians 2:3, 9)—to be\nbrought into sympathy with Him, to know Him, to possess Him, as\nthe heart opens more and more to receive His attributes; to know\nHis love and power, to possess the unsearchable riches of Christ, to[35]\ncomprehend more and more “what is the breadth, and length, and\ndepth, and height; and to know the love of Christ, which passeth\nknowledge, that ye might be filled with all the fullness of God”\n(Ephesians 3:18, 19)—“this is the heritage of the servants of the\nLord, and their righteousness is of Me, saith the Lord.” Isaiah 54:17.\nIt was this joy that filled the hearts of Paul and Silas when they\nprayed and sang praises to God at midnight in the Philippian dun-\ngeon. Christ was beside them there, and the light of His presence\nirradiated the gloom with the glory of the courts above. From Rome,\nPaul wrote, unmindful of his fetters as he saw the spread of the\ngospel, “I therein do rejoice, yea, and will rejoice.” Philippians 1:18.\nAnd the very words of Christ upon the mount are re-echoed in Paul’s\nmessage to the Philippian church, in the midst of their persecutions,\n“Rejoice in the Lord alway: and again I say, Rejoice.” Philippians\n4:4.\nBeatitudes 33\n“Ye are the salt of the earth.”—Matthew 5:13.\nSalt is valued for its preservative properties; and when God calls\nHis children salt, He would teach them that His purpose in making\nthem the subjects of His grace is that they may become agents in\nsaving others. The object of God in choosing a people before all\nthe world was not only that He might adopt them as His sons and\ndaughters, but that through them the world might receive the grace\nthat bringeth salvation. Titus 2:11. When the Lord chose Abraham,\nit was not simply to be the special friend of God, but to be a medium [36]\nof the peculiar privileges the Lord desired to bestow upon the nations.\nJesus, in that last prayer with His disciples before His crucifixion,\nsaid, “For their sakes I sanctify Myself, that they also might be\nsanctified through the truth.” John 17:19. In like manner Christians\nwho are purified through the truth will possess saving qualities that\npreserve the world from utter moral corruption.\nSalt must be mingled with the substance to which it is added;\nit must penetrate and infuse in order to preserve. So it is through\npersonal contact and association that men are reached by the saving\npower of the gospel. They are not saved in masses, but as individuals.\nPersonal influence is a power. We must come close to those whom\nwe desire to benefit.\nThe savor of the salt represents the vital power of the Christian—\nthe love of Jesus in the heart, the righteousness of Christ pervading\nthe life. The love of Christ is diffusive and aggressive. If it is\ndwelling in us, it will flow out to others. We shall come close to\nthem till their hearts are warmed by our unselfish interest and love.\nThe sincere believers diffuse vital energy, which is penetrating and\nimparts new moral power to the souls for whom they labor. It is not\nthe power of the man himself, but the power of the Holy Spirit that\ndoes the transforming work.\nJesus added the solemn warning: “If the salt have lost his savor,\nwherewith shall it be salted? It is thenceforth good for nothing, but\nto be cast out, and to be trodden under foot of men.”\nAs they listened to the words of Christ, the people could see [37]\nthe white salt glistening in the pathways where it had been cast\nout because it had lost its savor and was therefore useless. It well\nrepresented the condition of the Pharisees and the effect of their\n34 Thoughts from the Mount of Blessing\nreligion upon society. It represents the life of every soul from whom\nthe power of the grace of God has departed and who has become\ncold and Christless. Whatever may be his profession, such a one is\nlooked upon by men and angels as insipid and disagreeable. It is\nto such that Christ says: “I would thou wert cold or hot. So then\nbecause thou art lukewarm, and neither cold nor hot, I will spue thee\nout of My mouth.” Revelation 3:15, 16.\nWithout a living faith in Christ as a personal Saviour it is impos-\nsible to make our influence felt in a skeptical world. We cannot give\nto others that which we do not ourselves possess. It is in proportion\nto our own devotion and consecration to Christ that we exert an\ninfluence for the blessing and uplifting of mankind. If there is no\nactual service, no genuine love, no reality of experience, there is\nno power to help, no connection with heaven, no savor of Christ in\nthe life. Unless the Holy Spirit can use us as agents through whom\nto communicate to the world the truth as it is in Jesus, we are as\nsalt that has lost its savor and is entirely worthless. By our lack\nof the grace of Christ we testify to the world that the truth which\nwe claim to believe has no sanctifying power; and thus, so far as\nour influence goes, we make of no effect the word of God. “If I\nspeak with the tongues of men and of angels, but have not love, I\nam become sounding brass, or a clanging cymbal. And if I have the\ngift of prophecy, and know all mysteries and all knowledge; and if I[38]\nhave all faith, so as to remove mountains, but have not love, I am\nnothing. And if I bestow all my goods to feed the poor, and if I give\nmy body to be burned, but have not love, it profiteth me nothing.” 1\nCorinthians 13:1-3 , A.R.V .\nWhen love fills the heart, it will flow out to others, not because of\nfavors received from them, but because love is the principle of action.\nLove modifies the character, governs the impulses, subdues enmity,\nand ennobles the affections. This love is as broad as the universe,\nand is in harmony with that of the angel workers. Cherished in\nthe heart, it sweetens the entire life and sheds its blessing upon all\naround. It is this, and this only, that can make us the salt of the earth.\nBeatitudes 35\n“Ye are the light of the world.”—Matthew 5:14.\nAs Jesus taught the people, He made His lessons interesting and\nheld the attention of His hearers by frequent illustrations from the\nscenes of nature about them. The people had come together while it\nwas yet morning. The glorious sun, climbing higher and higher in\nthe blue sky, was chasing away the shadows that lurked in the valleys\nand among the narrow defiles of the mountains. The glory of the\neastern heavens had not yet faded out. The sunlight flooded the land\nwith its splendor; the placid surface of the lake reflected the golden\nlight and mirrored the rosy clouds of morning. Every bud and flower\nand leafy spray glistened with dewdrops. Nature smiled under the [39]\nbenediction of a new day, and the birds sang sweetly among the\ntrees. The Saviour looked upon the company before Him, and then\nto the rising sun, and said to His disciples, “Ye are the light of the\nworld.” As the sun goes forth on its errand of love, dispelling the\nshades of night and awakening the world to life, so the followers of\nChrist are to go forth on their mission, diffusing the light of heaven\nupon those who are in the darkness of error and sin.\nIn the brilliant light of the morning, the towns and villages upon\nthe surrounding hills stood forth clearly, making an attractive feature\nof the scene. Pointing to them, Jesus said, “A city set on a hill cannot\nbe hid.” And He added, “Neither do men light a lamp, and put it\nunder the bushel, but on the stand; and it shineth unto all that are in\nthe house.” R.V . Most of those who listened to the words of Jesus\nwere peasants and fishermen whose lowly dwellings contained but\none room, in which the single lamp on its stand shone to all in the\nhouse. Even so, said Jesus, “Let your light so shine before men, that\nthey may see your good works, and glorify your Father which is in\nheaven.”\nNo other light ever has shone or ever will shine upon fallen man\nsave that which emanates from Christ. Jesus, the Saviour, is the only\nlight that can illuminate the darkness of a world lying in sin. Of\nChrist it is written, “In Him was life; and the life was the light of\nmen.” John 1:4. It was by receiving of His life that His disciples\ncould become light bearers. The life of Christ in the soul, His love\nrevealed in the character, would make them the light of the world. [40]\n36 Thoughts from the Mount of Blessing\nHumanity has in itself no light. Apart from Christ we are like\nan unkindled taper, like the moon when her face is turned away\nfrom the sun; we have not a single ray of brightness to shed into\nthe darkness of the world. But when we turn toward the Sun of\nRighteousness, when we come in touch with Christ, the whole soul\nis aglow with the brightness of the divine presence.\nChrist’s followers are to be more than a light in the midst of men.\nThey are the light of the world. Jesus says to all who have named\nHis name, You have given yourselves to Me, and I have given you\nto the world as My representatives. As the Father had sent Him into\nthe world, so, He declares, “have I also sent them into the world.”\nJohn 17:18. As Christ is the channel for the revelation of the Father,\nso we are to be the channel for the revelation of Christ. While our\nSaviour is the great source of illumination, forget not, O Christian,\nthat He is revealed through humanity. God’s blessings are bestowed\nthrough human instrumentality. Christ Himself came to the world as\nthe Son of man. Humanity, united to the divine nature, must touch\nhumanity. The church of Christ, every individual disciple of the\nMaster, is heaven’s appointed channel for the revelation of God to\nmen. Angels of glory wait to communicate through you heaven’s\nlight and power to souls that are ready to perish. Shall the human\nagent fail of accomplishing his appointed work? Oh, then to that\ndegree is the world robbed of the promised influence of the Holy\nSpirit!\nBut Jesus did not bid the disciples, “Strive to make your light[41]\nshine;” He said, “ Let it shine.” If Christ is dwelling in the heart,\nit is impossible to conceal the light of His presence. If those who\nprofess to be followers of Christ are not the light of the world, it is\nbecause the vital power has left them; if they have no light to give, it\nis because they have no connection with the Source of light.\nIn all ages the “Spirit of Christ which was in them” (1 Peter\n1:11) has made God’s true children the light of the people of their\ngeneration. Joseph was a light bearer in Egypt. In his purity and\nbenevolence and filial love he represented Christ in the midst of\na nation of idolaters. While the Israelites were on their way from\nEgypt to the Promised Land, the true-hearted among them were a\nlight to the surrounding nations. Through them God was revealed\nto the world. From Daniel and his companions in Babylon, and\nBeatitudes 37\nfrom Mordecai in Persia, bright beams of light shone out amid\nthe darkness of the kingly courts. In like manner the disciples of\nChrist are set as light bearers on the way to heaven; through them\nthe Father’s mercy and goodness are made manifest to a world\nenshrouded in the darkness of misapprehension of God. By seeing\ntheir good works, others are led to glorify the Father who is above;\nfor it is made manifest that there is a God on the throne of the\nuniverse whose character is worthy of praise and imitation. The\ndivine love glowing in the heart, the Christlike harmony manifested\nin the life, are as a glimpse of heaven granted to men of the world,\nthat they may appreciate its excellence.\nIt is thus that men are led to believe “the love that God hath to [42]\nus.” 1 John 4:16. Thus hearts once sinful and corrupt are purified\nand transformed, to be presented “faultless before the presence of\nHis glory with exceeding joy.” Jude 24.\nThe Saviour’s words, “Ye are the light of the world,” point to the\nfact that He has committed to His followers a world-wide mission.\nIn the days of Christ, selfishness and pride and prejudice had built\nstrong and high the wall of partition between the appointed guardians\nof the sacred oracles and every other nation on the globe. But the\nSaviour had come to change all this. The words which the people\nwere hearing from His lips were unlike anything to which they\nhad ever listened from priest or rabbi. Christ tears away the wall\nof partition, the self-love, the dividing prejudice of nationality, and\nteaches a love for all the human family. He lifts men from the narrow\ncircle that their selfishness prescribes; He abolishes all territorial\nlines and artificial distinctions of society. He makes no difference\nbetween neighbors and strangers, friends and enemies. He teaches\nus to look upon every needy soul as our neighbor and the world as\nour field.\nAs the rays of the sun penetrate to the remotest corners of the\nglobe, so God designs that the light of the gospel shall extend to\nevery soul upon the earth. If the church of Christ were fulfilling the\npurpose of our Lord, light would be shed upon all that sit in darkness\nand in the region and shadow of death. Instead of congregating\ntogether and shunning responsibility and cross bearing, the members\nof the church would scatter into all lands, letting the light of Christ\nshine out from them, working as He did for the salvation of souls, [43]\n38 Thoughts from the Mount of Blessing\nand this “gospel of the kingdom” would speedily be carried to all\nthe world.\nIt is thus that God’s purpose in calling His people, from Abra-\nham on the plains of Mesopotamia to us in this age, is to reach\nits fulfillment. He says, “I will bless thee, ... and thou shalt be a\nblessing.” Genesis 12:2. The words of Christ through the gospel\nprophet, which are but re-echoed in the Sermon on the Mount, are\nfor us in this last generation: “Arise, shine; for thy light is come, and\nthe glory of the Lord is risen upon thee.” Isaiah 60:1. If upon your\nspirit the glory of the Lord is risen, if you have beheld His beauty\nwho is “the chiefest among ten thousand” and the One “altogether\nlovely,” if your soul has become radiant in the presence of His glory,\nto you is this word from the Master sent. Have you stood with Christ\non the mount of transfiguration? Down in the plain there are souls\nenslaved by Satan; they are waiting for the word of faith and prayer\nto set them free.\nWe are not only to contemplate the glory of Christ, but also to\nspeak of His excellences. Isaiah not only beheld the glory of Christ,\nbut he also spoke of Him. While David mused, the fire burned; then\nspoke he with his tongue. While he mused upon the wondrous love\nof God he could not but speak of that which he saw and felt. Who\ncan by faith behold the wonderful plan of redemption, the glory\nof the only-begotten Son of God, and not speak of it? Who can\ncontemplate the unfathomable love that was manifested upon the\ncross of Calvary in the death of Christ, that we might not perish, but\nhave everlasting life—who can behold this and have no words with[44]\nwhich to extol the Saviour’s glory?\n“In His temple doth everyone speak of His glory.” Psalm 29:9.\nThe sweet singer of Israel praised Him upon the harp, saying, “I will\nspeak of the glorious honor of Thy majesty, and of Thy wondrous\nworks. And men shall speak of the might of Thy terrible acts: and I\nwill declare Thy greatness.” Psalm 145:5, 6.\nThe cross of Calvary is to be lifted high above the people, ab-\nsorbing their minds and concentrating their thoughts. Then all the\nspiritual faculties will be charged with divine power direct from God.\nThen there will be a concentration of the energies in genuine work\nfor the Master. The workers will send forth to the world beams of\nlight, as living agencies to enlighten the earth.\nBeatitudes 39\nChrist accepts, oh, so gladly, every human agency that is surren-\ndered to Him. He brings the human into union with the divine, that\nHe may communicate to the world the mysteries of incarnate love.\nTalk it, pray it, sing it; proclaim abroad the message of His glory,\nand keep pressing onward to the regions beyond.\nTrials patiently borne, blessings gratefully received, temptations\nmanfully resisted, meekness, kindness, mercy, and love habitually\nrevealed, are the lights that shine forth in the character in contrast\nwith the darkness of the selfish heart, into which the light of life has\nnever shone.\nChapter 3—The Spirituality of the Law[45]\n“I am not come to destroy, but to fulfill.”—Matthew 5:17.\nIt was Christ who, amid thunder and flame, had proclaimed the\nlaw upon Mount Sinai. The glory of God, like devouring fire, rested\nupon its summit, and the mountain quaked at the presence of the\nLord. The hosts of Israel, lying prostrate upon the earth, had listened\nin awe to the sacred precepts of the law. What a contrast to the scene\nupon the mount of the Beatitudes! Under the summer sky, with no\nsound to break the stillness but the song of birds, Jesus unfolded the\nprinciples of His kingdom. Yet He who spoke to the people that day\nin accents of love, was opening to them the principles of the law\nproclaimed upon Sinai.\nWhen the law was given, Israel, degraded by the long bondage\nin Egypt, had need to be impressed with the power and majesty of\nGod; yet He revealed Himself to them no less as a God of love.\n“The Lord came from Sinai,\nAnd rose from Seir unto them;\nHe shined forth from Mount Paran,\nAnd He came from the ten thousands of holy ones:\nAt His right hand was a fiery law unto them.\nYea, He loveth the tribes;\nAll their holy ones are in Thy hand:\nAnd they sat down at Thy feet;\nEveryone received of Thy words.”\nDeuteronomy 33:2, 3 ,\nR.V ., margin.\nIt was to Moses that God revealed His glory in those wonderful[46]\nwords that have been the treasured heritage of the ages: “The Lord,\nThe Lord God, merciful and gracious, long-suffering, and abun-\ndant in goodness and truth, keeping mercy for thousands, forgiving\niniquity and transgression and sin.” Exodus 34:6, 7.\n40\nSpirituality of the Law 41\nThe law given upon Sinai was the enunciation of the principle\nof love, a revelation to earth of the law of heaven. It was ordained\nin the hand of a Mediator—spoken by Him through whose power\nthe hearts of men could be brought into harmony with its principles.\nGod had revealed the purpose of the law when He declared to Israel,\n“Ye shall be holy men unto Me.” Exodus 22:31.\nBut Israel had not perceived the spiritual nature of the law, and\ntoo often their professed obedience was but an observance of forms\nand ceremonies, rather than a surrender of the heart to the sovereignty\nof love. As Jesus in His character and work represented to men the\nholy, benevolent, and paternal attributes of God, and presented the\nworthlessness of mere ceremonial obedience, the Jewish leaders did\nnot receive or understand His words. They thought that He dwelt too\nlightly upon the requirements of the law; and when He set before\nthem the very truths that were the soul of their divinely appointed\nservice, they, looking only at the external, accused Him of seeking\nto overthrow it.\nThe words of Christ, though calmly spoken, were uttered with\nan earnestness and power that stirred the hearts of the people. They\nlistened for a repetition of the lifeless traditions and exactions of [47]\nthe rabbis, but in vain. They “were astonished at His teaching: for\nHe taught them as one having authority, and not as their scribes.”\nMatthew 7:29 , R.V . The Pharisees noted the vast difference between\ntheir manner of instruction and that of Christ. They saw that the\nmajesty and purity and beauty of the truth, with its deep and gentle\ninfluence, was taking firm hold upon many minds. The Saviour’s\ndivine love and tenderness drew the hearts of men to Him. The\nrabbis saw that by His teaching the whole tenor of the instruction\nthey had given to the people was set at nought. He was tearing\ndown the partition wall that had been so flattering to their pride and\nexclusiveness; and they feared that, if permitted, He would draw the\npeople entirely away from them. Therefore they followed Him with\ndetermined hostility, hoping to find some occasion for bringing Him\ninto disfavor with the multitudes and thus enabling the Sanhedrin to\nsecure His condemnation and death.\nOn the mount, Jesus was closely watched by spies; and as He\nunfolded the principles of righteousness, the Pharisees caused it\nto be whispered about that His teaching was in opposition to the\n42 Thoughts from the Mount of Blessing\nprecepts that God had given from Sinai. The Saviour said nothing\nto unsettle faith in the religion and institutions that had been given\nthrough Moses; for every ray of divine light that Israel’s great leader\ncommunicated to his people was received from Christ. While many\nare saying in their hearts that He has come to do away with the\nlaw, Jesus in unmistakable language reveals His attitude toward the\ndivine statutes. “Think not,“ He said, “that I am come to destroy the[48]\nlaw, or the prophets.”\nIt is the Creator of men, the Giver of the law, who declares that\nit is not His purpose to set aside its precepts. Everything in nature,\nfrom the mote in the sunbeam to the worlds on high, is under law.\nAnd upon obedience to these laws the order and harmony of the\nnatural world depend. So there are great principles of righteousness\nto control the life of all intelligent beings, and upon conformity to\nthese principles the well-being of the universe depends. Before this\nearth was called into being, God’s law existed. Angels are governed\nby its principles, and in order for earth to be in harmony with heaven,\nman also must obey the divine statutes. To man in Eden Christ made\nknown the precepts of the law “when the morning stars sang together,\nand all the sons of God shouted for joy.” Job 38:7. The mission of\nChrist on earth was not to destroy the law, but by His grace to bring\nman back to obedience to its precepts.\nThe beloved disciple, who listened to the words of Jesus on the\nmount, writing long afterward under the inspiration of the Holy\nSpirit, speaks of the law as of perpetual obligation. He says that “sin\nis the transgression of the law” and that “whosoever committeth sin\ntransgresseth also the law.” 1 John 3:4. He makes it plain that the\nlaw to which he refers is “an old commandment which ye had from\nthe beginning.” 1 John 2:7. He is speaking of the law that existed at\nthe creation and was reiterated upon Mount Sinai.\nSpeaking of the law, Jesus said, “I am not come to destroy,\nbut to fulfill.” He here used the word “fulfill” in the same sense[49]\nas when He declared to John the Baptist His purpose to “fulfill all\nrighteousness” (Matthew 3:15); that is, to fill up the measure of the\nlaw’s requirement, to give an example of perfect conformity to the\nwill of God.\nHis mission was to “magnify the law, and make it honorable.”\nIsaiah 42:21. He was to show the spiritual nature of the law, to\nSpirituality of the Law 43\npresent its far-reaching principles, and to make plain its eternal\nobligation.\nThe divine beauty of the character of Christ, of whom the noblest\nand most gentle among men are but a faint reflection; of whom\nSolomon by the Spirit of inspiration wrote, He is “the chiefest among\nten thousand, ... yea, He is altogether lovely” (Song of Solomon\n5:10-16); of whom David, seeing Him in prophetic vision, said,\n“Thou art fairer than the children of men” (Psalm 45:2); Jesus, the\nexpress image of the Father’s person, the effulgence of His glory; the\nself-denying Redeemer, throughout His pilgrimage of love on earth,\nwas a living representation of the character of the law of God. In His\nlife it is made manifest that heaven-born love, Christlike principles,\nunderlie the laws of eternal rectitude.\n“Till heaven and earth pass,” said Jesus, “one jot or one tittle\nshall in nowise pass from the law, till all be fulfilled.” By His own\nobedience to the law, Christ testified to its immutable character\nand proved that through His grace it could be perfectly obeyed by\nevery son and daughter of Adam. On the mount He declared that\nnot the smallest iota should pass from the law till all things should\nbe accomplished—all things that concern the human race, all that\nrelates to the plan of redemption. He does not teach that the law [50]\nis ever to be abrogated, but He fixes the eye upon the utmost verge\nof man’s horizon and assures us that until this point is reached\nthe law will retain its authority so that none may suppose it was\nHis mission to abolish the precepts of the law. So long as heaven\nand earth continue, the holy principles of God’s law will remain.\nHis righteousness, “like the great mountains” (Psalm 36:6), will\ncontinue, a source of blessing, sending forth streams to refresh the\nearth.\nBecause the law of the Lord is perfect, and therefore changeless,\nit is impossible for sinful men, in themselves, to meet the standard\nof its requirement. This was why Jesus came as our Redeemer. It\nwas His mission, by making men partakers of the divine nature, to\nbring them into harmony with the principles of the law of heaven.\nWhen we forsake our sins and receive Christ as our Saviour, the law\nis exalted. The apostle Paul asks, “Do we then make void the law\nthrough faith? God forbid: yea, we establish the law.” Romans 3:31.\n44 Thoughts from the Mount of Blessing\nThe new-covenant promise is, “I will put My laws into their\nhearts, and in their minds will I write them.” Hebrews 10:16. While\nthe system of types which pointed to Christ as the Lamb of God\nthat should take away the sin of the world was to pass away at His\ndeath, the principles of righteousness embodied in the Decalogue\nare as immutable as the eternal throne. Not one command has been\nannulled, not a jot or tittle has been changed. Those principles that\nwere made known to man in Paradise as the great law of life will[51]\nexist unchanged in Paradise restored. When Eden shall bloom on\nearth again, God’s law of love will be obeyed by all beneath the sun.\n“Forever, O Lord, Thy word is settled in heaven.” “All His com-\nmandments are sure. They stand fast for ever and ever, and are\ndone in truth and uprightness.” “Concerning Thy testimonies, I have\nknown of old that Thou hast founded them forever.” Psalm 119:89;\n111:7, 8; Psalm 119:152.\n“Whosoever ... shall break one of these least commandments,\nand shall teach men so, he shall be called the least in the\nkingdom of heaven.”—Matthew 5:19.\nThat is, he shall have no place therein. For he who willfully\nbreaks one commandment, does not, in spirit and truth, keep any of\nthem. “Whosoever shall keep the whole law, and yet offend in one\npoint, he is guilty of all.” James 2:10.\nIt is not the greatness of the act of disobedience that constitutes\nsin, but the fact of variance from God’s expressed will in the least\nparticular; for this shows that there is yet communion between the\nsoul and sin. The heart is divided in its service. There is a virtual\ndenial of God, a rebellion against the laws of His government.\nWere men free to depart from the Lord’s requirements and to set\nup a standard of duty for themselves, there would be a variety of\nstandards to suit different minds and the government would be taken\nout of the Lord’s hands. The will of man would be made supreme,[52]\nand the high and holy will of God—His purpose of love toward His\ncreatures—would be dishonored, disrespected.\nWhenever men choose their own way, they place themselves in\ncontroversy with God. They will have no place in the kingdom of\nheaven, for they are at war with the very principles of heaven. In\nSpirituality of the Law 45\ndisregarding the will of God, they are placing themselves on the\nside of Satan, the enemy of God and man. Not by one word, not by\nmany words, but by every word that God has spoken, shall man live.\nWe cannot disregard one word, however trifling it may seem to us,\nand be safe. There is not a commandment of the law that is not for\nthe good and happiness of man, both in this life and in the life to\ncome. In obedience to God’s law, man is surrounded as with a hedge\nand kept from the evil. He who breaks down this divinely erected\nbarrier at one point has destroyed its power to protect him; for he\nhas opened a way by which the enemy can enter to waste and ruin.\nBy venturing to disregard the will of God upon one point, our\nfirst parents opened the floodgates of woe upon the world. And every\nindividual who follows their example will reap a similar result. The\nlove of God underlies every precept of His law, and he who departs\nfrom the commandment is working his own unhappiness and ruin.\n“Except your righteousness shall exceed the righteousness of [53]\nthe scribes and Pharisees, ye shall in no case enter into the\nkingdom of heaven.”—Matthew 5:20.\nThe scribes and Pharisees had accused not only Christ but His\ndisciples as sinners because of their disregard of the rabbinical rites\nand observances. Often the disciples had been perplexed and trou-\nbled by censure and accusation from those whom they had been\naccustomed to revere as religious teachers. Jesus unveiled the decep-\ntion. He declared that the righteousness upon which the Pharisees\nset so great value was worthless. The Jewish nation had claimed to\nbe the special, loyal people who were favored of God; but Christ\nrepresented their religion as devoid of saving faith. All their pre-\ntensions of piety, their human inventions and ceremonies, and even\ntheir boasted performance of the outward requirements of the law,\ncould not avail to make them holy. They were not pure in heart or\nnoble and Christlike in character.\nA legal religion is insufficient to bring the soul into harmony\nwith God. The hard, rigid orthodoxy of the Pharisees, destitute of\ncontrition, tenderness, or love, was only a stumbling block to sinners.\nThey were like the salt that had lost its savor; for their influence had\nno power to preserve the world from corruption. The only true faith\n46 Thoughts from the Mount of Blessing\nis that which “worketh by love” (Galatians 5:6) to purify the soul. It\nis as leaven that transforms the character.\nAll this the Jews should have learned from the teachings of the[54]\nprophets. Centuries before, the cry of the soul for justification with\nGod had found voice and answer in the words of the prophet Micah:\n“Wherewith shall I come before the Lord, and bow myself before\nthe high God? shall I come before Him with burnt offerings, with\ncalves of a year old? Will the Lord be pleased with thousands of\nrams, or with ten thousands of rivers of oil? ... He hath showed thee,\nO man, what is good; and what doth the Lord require of thee, but\nto do justly, and to love mercy, and to walk humbly with thy God?”\nMicah 6:6-8.\nThe prophet Hosea had pointed out what constitutes the very\nessence of Pharisaism, in the words, “Israel is an empty vine, he\nbringeth forth fruit unto himself.” Hosea 10:1. In their professed\nservice to God, the Jews were really working for self. Their righ-\nteousness was the fruit of their own efforts to keep the law according\nto their own ideas and for their own selfish benefit. Hence it could be\nno better than they were. In their endeavor to make themselves holy,\nthey were trying to bring a clean thing out of an unclean. The law of\nGod is as holy as He is holy, as perfect as He is perfect. It presents to\nmen the righteousness of God. It is impossible for man, of himself,\nto keep this law; for the nature of man is depraved, deformed, and\nwholly unlike the character of God. The works of the selfish heart\nare “as an unclean thing;” and “all our righteousnesses are as filthy\nrags.” Isaiah 64:6.\nWhile the law is holy, the Jews could not attain righteousness by\ntheir own efforts to keep the law. The disciples of Christ must obtain\nrighteousness of a different character from that of the Pharisees,[55]\nif they would enter the kingdom of heaven. God offered them,\nin His Son, the perfect righteousness of the law. If they would\nopen their hearts fully to receive Christ, then the very life of God,\nHis love, would dwell in them, transforming them into His own\nlikeness; and thus through God’s free gift they would possess the\nrighteousness which the law requires. But the Pharisees rejected\nChrist; “being ignorant of God’s righteousness, and going about to\nestablish their own righteousness” (Romans 10:3), they would not\nsubmit themselves unto the righteousness of God.\nSpirituality of the Law 47\nJesus proceeded to show His hearers what it means to keep the\ncommandments of God—that it is a reproduction in themselves of\nthe character of Christ. For in Him, God was daily made manifest\nbefore them.\n“Everyone who is angry with his brother shall be in danger of\nthe judgment.”—Matthew 5:22, R. V .\nThrough Moses the Lord had said, “Thou shalt not hate thy\nbrother in thine heart.... Thou shalt not avenge, nor bear any grudge\nagainst the children of thy people, but thou shalt love thy neighbor\nas thyself.” Leviticus 19:17, 18. The truths which Christ presented\nwere the same that had been taught by the prophets, but they had\nbecome obscured through hardness of heart and love of sin.\nThe Saviour’s words revealed to His hearers the fact that, while\nthey were condemning others as transgressors, they were themselves [56]\nequally guilty; for they were cherishing malice and hatred.\nAcross the sea from the place where they were assembled was\nthe country of Bashan, a lonely region, whose wild gorges and\nwooded hills had long been a favorite lurking ground for criminals\nof all descriptions. Reports of robbery and murder committed there\nwere fresh in the minds of the people, and many were zealous in\ndenouncing these evildoers. At the same time they were themselves\npassionate and contentious; they cherished the most bitter hatred of\ntheir Roman oppressors and felt themselves at liberty to hate and\ndespise all other peoples, and even their own countrymen who did\nnot in all things conform to their ideas. In all this they were violating\nthe law which declares, “Thou shalt not kill.”\nThe spirit of hatred and revenge originated with Satan, and it led\nhim to put to death the Son of God. Whoever cherishes malice or\nunkindness is cherishing the same spirit, and its fruit will be unto\ndeath. In the revengeful thought the evil deed lies enfolded, as the\nplant in the seed. “Whosoever hateth his brother is a murderer: and\nye know that no murderer hath eternal life abiding in him.” 1 John\n3:15.\n“Whosoever shall say to his brother, Raca [vain fellow], shall be\nin danger of the council.” In the gift of His Son for our redemption,\nGod has shown how high a value He places upon every human soul,\n48 Thoughts from the Mount of Blessing\nand He gives to no man liberty to speak contemptuously of another.\nWe shall see faults and weaknesses in those about us, but God claims\nevery soul as His property—His by creation, and doubly His as\npurchased by the precious blood of Christ. All were created in His[57]\nimage, and even the most degraded are to be treated with respect and\ntenderness. God will hold us accountable for even a word spoken in\ncontempt of one soul for whom Christ laid down His life.\n“Who maketh thee to differ from another? and what hast thou\nthat thou didst not receive? now if thou didst receive it, why dost\nthou glory, as if thou hadst not received it?” “Who art thou that\njudgest another man’s servant? to his own master he standeth or\nfalleth.” 1 Corinthians 4:7; Romans 14:4.\n“Whosoever shall say, Thou fool, shall be in danger of the hell\nof fire.” R.V . In the Old Testament the word “fool” is used to desig-\nnate an apostate, or one who has abandoned himself to wickedness.\nJesus says that whoever shall condemn his brother as an apostate\nor a despiser of God shows that he himself is worthy of the same\ncondemnation.\nChrist Himself, when contending with Satan about the body of\nMoses, “durst not bring against him a railing accusation.” Jude 9.\nHad He done this, He would have placed Himself on Satan’s ground,\nfor accusation is the weapon of the evil one. He is called in Scripture,\n“the accuser of our brethren.” Revelation 12:10. Jesus would employ\nnone of Satan’s weapons. He met him with the words, “The Lord\nrebuke thee.” Jude 9.\nHis example is for us. When we are brought in conflict with the\nenemies of Christ, we should say nothing in a spirit of retaliation or\nthat would bear even the appearance of a railing accusation. He who\nstands as a mouthpiece for God should not utter words which even[58]\nthe Majesty of heaven would not use when contending with Satan.\nWe are to leave with God the work of judging and condemning.\n“Be reconciled to thy brother.”—Matthew 5:24.\nThe love of God is something more than a mere negation; it is a\npositive and active principle, a living spring, ever flowing to bless\nothers. If the love of Christ dwells in us, we shall not only cherish no\nSpirituality of the Law 49\nhatred toward our fellows, but we shall seek in every way to manifest\nlove toward them.\nJesus said, “If thou bring thy gift to the altar, and there remem-\nberest that thy brother hath aught against thee; leave there thy gift\nbefore the altar, and go thy way; first be reconciled to thy brother,\nand then come and offer thy gift.” The sacrificial offerings expressed\nfaith that through Christ the offerer had become a partaker of the\nmercy and love of God. But for one to express faith in God’s par-\ndoning love, while he himself indulged an unloving spirit, would be\na mere farce.\nWhen one who professes to serve God wrongs or injures a\nbrother, he misrepresents the character of God to that brother, and\nthe wrong must be confessed, he must acknowledge it to be sin, in\norder to be in harmony with God. Our brother may have done us\na greater wrong than we have done him, but this does not lessen\nour responsibility. If when we come before God we remember that\nanother has aught against us, we are to leave our gift of prayer, of [59]\nthanksgiving, of freewill offering, and go to the brother with whom\nwe are at variance, and in humility confess our own sin and ask to\nbe forgiven.\nIf we have in any manner defrauded or injured our brother, we\nshould make restitution. If we have unwittingly borne false witness,\nif we have misstated his words, if we have injured his influence in\nany way, we should go to the ones with whom we have conversed\nabout him, and take back all our injurious misstatements.\nIf matters of difficulty between brethren were not laid open\nbefore others, but frankly spoken of between themselves in the spirit\nof Christian love, how much evil might be prevented! How many\nroots of bitterness whereby many are defiled would be destroyed,\nand how closely and tenderly might the followers of Christ be united\nin His love!\n“Whosoever looketh on a woman to lust after her hath\ncommitted adultery with her already in his heart.”—Matthew\n5:28.\nThe Jews prided themselves on their morality and looked with\nhorror upon the sensual practices of the heathen. The presence of the\n50 Thoughts from the Mount of Blessing\nRoman officers whom the imperial rule had brought into Palestine\nwas a continual offense to the people, for with these foreigners\nhad come in a flood of heathen customs, lust, and dissipation. In\nCapernaum, Roman officials with their gay paramours haunted the\nparades and promenades, and often the sound of revelry broke upon[60]\nthe stillness of the lake as their pleasure boats glided over the quiet\nwaters. The people expected to hear from Jesus a stern denunciation\nof this class, but what was their astonishment as they listened to\nwords that laid bare the evil of their own hearts!\nWhen the thought of evil is loved and cherished, however se-\ncretly, said Jesus, it shows that sin still reigns in the heart. The soul\nis still in the gall of bitterness and in the bond of iniquity. He who\nfinds pleasure in dwelling upon scenes of impurity, who indulges\nthe evil thought, the lustful look, may behold in the open sin, with\nits burden of shame and heart-breaking grief, the true nature of the\nevil which he has hidden in the chambers of the soul. The season\nof temptation, under which, it may be, one falls into grievous sin,\ndoes not create the evil that is revealed, but only develops or makes\nmanifest that which was hidden and latent in the heart. As a man\n“thinketh in his heart, so is he;” for out of the heart “are the issues\nof life.” Proverbs 23:7; 4:23.\n“If thy right hand causeth thee to stumble, cut it off, and cast it\nfrom thee.”—Matthew 5:30, R. V .\nTo prevent disease from spreading to the body and destroying\nlife, a man would submit to part even with his right hand. Much\nmore should he be willing to surrender that which imperils the life\nof the soul.\nThrough the gospel, souls that are degraded and enslaved by[61]\nSatan are to be redeemed to share the glorious liberty of the sons of\nGod. God’s purpose is not merely to deliver from the suffering that\nis the inevitable result of sin, but to save from sin itself. The soul,\ncorrupted and deformed, is to be purified, transformed, that it may\nbe clothed in “the beauty of the Lord our God,” “conformed to the\nimage of His Son.” “Eye hath not seen, nor ear heard, neither have\nentered into the heart of man, the things which God hath prepared\nfor them that love Him.” Psalm 90:17; Romans 8:29; 1 Corinthians\nSpirituality of the Law 51\n2:9. Eternity alone can reveal the glorious destiny to which man,\nrestored to God’s image, may attain.\nIn order for us to reach this high ideal, that which causes the\nsoul to stumble must be sacrificed. It is through the will that sin\nretains its hold upon us. The surrender of the will is represented as\nplucking out the eye or cutting off the hand. Often it seems to us that\nto surrender the will to God is to consent to go through life maimed\nor crippled. But it is better, says Christ, for self to be maimed,\nwounded, crippled, if thus you may enter into life. That which you\nlook upon as disaster is the door to highest benefit.\nGod is the fountain of life, and we can have life only as we are\nin communion with Him. Separated from God, existence may be\nours for a little time, but we do not possess life. “She that liveth in\npleasure is dead while she liveth.” 1 Timothy 5:6. Only through the\nsurrender of our will to God is it possible for Him to impart life to\nus. Only by receiving His life through self-surrender is it possible,\nsaid Jesus, for these hidden sins, which I have pointed out, to be\novercome. It is possible that you may bury them in your hearts and [62]\nconceal them from human eyes, but how will you stand in God’s\npresence?\nIf you cling to self, refusing to yield your will to God, you are\nchoosing death. To sin, wherever found, God is a consuming fire. If\nyou choose sin, and refuse to separate from it, the presence of God,\nwhich consumes sin, must consume you.\nIt will require a sacrifice to give yourself to God; but it is a\nsacrifice of the lower for the higher, the earthly for the spiritual,\nthe perishable for the eternal. God does not design that our will\nshould be destroyed, for it is only through its exercise that we can\naccomplish what He would have us do. Our will is to be yielded to\nHim, that we may receive it again, purified and refined, and so linked\nin sympathy with the Divine that He can pour through us the tides of\nHis love and power. However bitter and painful this surrender may\nappear to the willful, wayward heart, yet “it is profitable for thee.”\nNot until he fell crippled and helpless upon the breast of the\ncovenant angel did Jacob know the victory of conquering faith and\nreceive the title of a prince with God. It was when he “halted upon\nhis thigh” (Genesis 32:31) that the armed bands of Esau were stilled\nbefore him, and the Pharaoh, proud heir of a kingly line, stooped\n52 Thoughts from the Mount of Blessing\nto crave his blessing. So the Captain of our salvation was made\n“perfect through sufferings” (Hebrews 2:10), and the children of\nfaith “out of weakness were made strong,” and “turned to flight the\narmies of the aliens” (Hebrews 11:34). So do “the lame take the\nprey” (Isaiah 33:23), and the weak become “as David,” and “the[63]\nhouse of David ... as the angel of the Lord” (Zechariah 12:8).\n“Is it lawful for a man to put away his wife?”—Matthew 19:3.\nAmong the Jews a man was permitted to put away his wife\nfor the most trivial offenses, and the woman was then at liberty to\nmarry again. This practice led to great wretchedness and sin. In\nthe Sermon on the Mount Jesus declared plainly that there could\nbe no dissolution of the marriage tie, except for unfaithfulness to\nthe marriage vow. “Everyone,” He said, “that putteth away his\nwife, saving for the cause of fornication, maketh her an adulteress:\nand whosoever shall marry her when she is put away committeth\nadultery.” R.V .\nWhen the Pharisees afterward questioned Him concerning the\nlawfulness of divorce, Jesus pointed His hearers back to the marriage\ninstitution as ordained at creation. “Because of the hardness of\nyour hearts,” He said, Moses “suffered you to put away your wives:\nbut from the beginning it was not so.” Matthew 19:8. He referred\nthem to the blessed days of Eden, when God pronounced all things\n“very good.” Then marriage and the Sabbath had their origin, twin\ninstitutions for the glory of God in the benefit of humanity. Then, as\nthe Creator joined the hands of the holy pair in wedlock, saying, A\nman shall “leave his father and his mother, and shall cleave unto his\nwife: and they shall be one” (Genesis 2:24), He enunciated the law[64]\nof marriage for all the children of Adam to the close of time. That\nwhich the Eternal Father Himself had pronounced good was the law\nof highest blessing and development for man.\nLike every other one of God’s good gifts entrusted to the keeping\nof humanity, marriage has been perverted by sin; but it is the purpose\nof the gospel to restore its purity and beauty. In both the Old and the\nNew Testament the marriage relation is employed to represent the\ntender and sacred union that exists between Christ and His people,\nthe redeemed ones whom He has purchased at the cost of Calvary.\nSpirituality of the Law 53\n“Fear not,” He says; “thy Maker is thine husband; the Lord of hosts\nis His name; and thy Redeemer, the Holy One of Israel.” “Turn, O\nbacksliding children, saith the Lord; for I am married unto you.”\nIsaiah 54:4, 5; Jeremiah 3:14. In the “Song of Songs” we hear the\nbride’s voice saying, “My Beloved is mine, and I am His.” And\nHe who is to her “the chiefest among ten thousand,” speaks to His\nchosen one, “Thou art all fair, My love; there is no spot in thee.”\nSong of Solomon 2:16; 5:10; 4:7.\nIn later times Paul the apostle, writing to the Ephesian Christians,\ndeclares that the Lord has constituted the husband the head of the\nwife, to be her protector, the house-band, binding the members of\nthe family together, even as Christ is the head of the church and the\nSaviour of the mystical body. Therefore he says, “As the church\nis subject unto Christ, so let the wives be to their own husbands in\neverything. Husbands, love your wives, even as Christ also loved the\nchurch, and gave Himself for it; that He might sanctify and cleanse [65]\nit with the washing of water by the word, that He might present it to\nHimself a glorious church, not having spot, or wrinkle, or any such\nthing; but that it should be holy and without blemish. So ought men\nto love their wives.” Ephesians 5:24-28.\nThe grace of Christ, and this alone, can make this institution what\nGod designed it should be—an agent for the blessing and uplifting\nof humanity. And thus the families of earth, in their unity and peace\nand love, may represent the family of heaven.\nNow, as in Christ’s day, the condition of society presents a sad\ncomment upon heaven’s ideal of this sacred relation. Yet even for\nthose who have found bitterness and disappointment where they\nhad hoped for companionship and joy, the gospel of Christ offers\na solace. The patience and gentleness which His Spirit can impart\nwill sweeten the bitter lot. The heart in which Christ dwells will\nbe so filled, so satisfied, with His love that it will not be consumed\nwith longing to attract sympathy and attention to itself. And through\nthe surrender of the soul to God, His wisdom can accomplish what\nhuman wisdom fails to do. Through the revelation of His grace,\nhearts that were once indifferent or estranged may be united in\nbonds that are firmer and more enduring than those of earth—the\ngolden bonds of a love that will bear the test of trial.\n54 Thoughts from the Mount of Blessing\n“Swear not at all.”—Matthew 5:34.[66]\nThe reason for this command is given: We are not to swear “by\nthe heaven, for it is the throne of God; nor by the earth, for it is the\nfootstool of His feet; nor by Jerusalem, for it is the city of the great\nKing. Neither shalt thou swear by thy head, for thou canst not make\none hair white or black.” R.V .\nAll things come of God. We have nothing that we have not\nreceived; and, more than this, we have nothing that has not been\npurchased for us by the blood of Christ. Everything we possess\ncomes to us stamped with the cross, bought with the blood that is\nprecious above all estimate, because it is the life of God. Hence\nthere is nothing that we have a right to pledge, as if it were our own,\nfor the fulfillment of our word.\nThe Jews understood the third commandment as prohibiting the\nprofane use of the name of God; but they thought themselves at\nliberty to employ other oaths. Oath taking was common among\nthem. Through Moses they had been forbidden to swear falsely, but\nthey had many devices for freeing themselves from the obligation\nimposed by an oath. They did not fear to indulge in what was really\nprofanity, nor did they shrink from perjury so long as it was veiled\nby some technical evasion of the law.\nJesus condemned their practices, declaring that their custom in\noath taking was a transgression of the commandment of God. Our\nSaviour did not, however, forbid the use of the judicial oath, in\nwhich God is solemnly called to witness that what is said is truth\nand nothing but the truth. Jesus Himself, at His trial before the[67]\nSanhedrin, did not refuse to testify under oath. The high priest said\nunto Him, “I adjure Thee by the living God, that Thou tell us whether\nThou be the Christ, the Son of God.” Jesus answered, “Thou hast\nsaid.” Matthew 26:63, 64. Had Christ in the Sermon on the Mount\ncondemned the judicial oath, He would at His trial have reproved the\nhigh priest and thus, for the benefit of His followers, have enforced\nHis own teaching.\nThere are very many who do not fear to deceive their fellow men,\nbut they have been taught, and have been impressed by the Spirit of\nGod, that it is a fearful thing to lie to their Maker. When put under\noath they are made to feel that they are not testifying merely before\nSpirituality of the Law 55\nmen, but before God; that if they bear false witness, it is to Him who\nreads the heart and who knows the exact truth. The knowledge of\nthe fearful judgments that have followed this sin has a restraining\ninfluence upon them.\nBut if there is anyone who can consistently testify under oath,\nit is the Christian. He lives constantly as in the presence of God,\nknowing that every thought is open to the eyes of Him with whom\nwe have to do; and when required to do so in a lawful manner, it is\nright for him to appeal to God as a witness that what he says is the\ntruth, and nothing but the truth.\nJesus proceeded to lay down a principle that would make oath\ntaking needless. He teaches that the exact truth should be the law of\nspeech. “Let your speech be, Yea, yea; Nay, nay: and whatsoever is\nmore than these is of the evil one.” R.V .\nThese words condemn all those meaningless phrases and exple- [68]\ntives that border on profanity. They condemn the deceptive compli-\nments, the evasion of truth, the flattering phrases, the exaggerations,\nthe misrepresentations in trade, that are current in society and in the\nbusiness world. They teach that no one who tries to appear what he\nis not, or whose words do not convey the real sentiment of his heart,\ncan be called truthful.\nIf these words of Christ were heeded, they would check the utter-\nance of evil surmising and unkind criticism; for in commenting upon\nthe actions and motives of another, who can be certain of speaking\nthe exact truth? How often pride, passion, personal resentment, color\nthe impression given! A glance, a word, even an intonation of the\nvoice, may be vital with falsehood. Even facts may be so stated as\nto convey a false impression. And “whatsoever is more than” truth,\n“is of the evil one.”\nEverything that Christians do should be as transparent as the\nsunlight. Truth is of God; deception, in every one of its myriad\nforms, is of Satan; and whoever in any way departs from the straight\nline of truth is betraying himself into the power of the wicked one.\nYet it is not a light or an easy thing to speak the exact truth. We\ncannot speak the truth unless we know the truth; and how often\npreconceived opinions, mental bias, imperfect knowledge, errors\nof judgment, prevent a right understanding of matters with which\n56 Thoughts from the Mount of Blessing\nwe have to do! We cannot speak the truth unless our minds are\ncontinually guided by Him who is truth.\nThrough the apostle Paul, Christ bids us, “Let your speech be[69]\nalway with grace.” “Let no corrupt communication proceed out of\nyour mouth, but that which is good to the use of edifying, that it may\nminister grace unto the hearers.” Colossians 4:6; Ephesians 4:29. In\nthe light of these scriptures the words of Christ upon the mount are\nseen to condemn jesting, trifling, and unchaste conversation. They\nrequire that our words should be not only truthful, but pure.\nThose who have learned of Christ will “have no fellowship with\nthe unfruitful works of darkness.” Ephesians 5:11. In speech, as\nin life, they will be simple, straightforward, and true; for they are\npreparing for the fellowship of those holy ones in whose mouth “was\nfound no guile.” Revelation 14:5.\n“Resist not him that is evil: but whosoever smiteth thee on thy\nright cheek, turn to him the other also.”—Matthew 5:39, R. V .\nOccasions of irritation to the Jews were constantly arising from\ntheir contact with the Roman soldiery. Detachments of troops were\nstationed at different points throughout Judea and Galilee, and their\npresence reminded the people of their own degradation as a nation.\nWith bitterness of soul they heard the loud blast of the trumpet and\nsaw the troops forming around the standard of Rome and bowing in\nhomage to this symbol of her power. Collisions between the people\nand the soldiers were frequent, and these inflamed the popular hatred.\nOften as some Roman official with his guard of soldiers hastened\nfrom point to point, he would seize upon the Jewish peasants who[70]\nwere laboring in the field and compel them to carry burdens up the\nmountainside or render any other service that might be needed. This\nwas in accordance with the Roman law and custom, and resistance\nto such demands only called forth taunts and cruelty. Every day\ndeepened in the hearts of the people the longing to cast off the\nRoman yoke. Especially among the bold, rough-handed Galileans\nthe spirit of insurrection was rife. Capernaum, being a border town,\nwas the seat of a Roman garrison, and even while Jesus was teaching,\nthe sight of a company of soldiers recalled to His hearers the bitter\nSpirituality of the Law 57\nthought of Israel’s humiliation. The people looked eagerly to Christ,\nhoping that He was the One who was to humble the pride of Rome.\nWith sadness Jesus looks into the upturned faces before Him.\nHe notes the spirit of revenge that has stamped its evil imprint upon\nthem, and knows how bitterly the people long for power to crush\ntheir oppressors. Mournfully He bids them, “Resist not him that is\nevil: but whosoever smiteth thee on thy right cheek, turn to him the\nother also.”\nThese words were but a reiteration of the teaching of the Old\nTestament. It is true that the rule, “Eye for eye, tooth for tooth”\n(Leviticus 24:20), was a provision in the laws given through Moses;\nbut it was a civil statute. None were justified in avenging themselves,\nfor they had the words of the Lord: “Say not thou, I will recompense\nevil.” “Say not, I will do so to him as he hath done to me.” “Rejoice\nnot when thine enemy falleth.” “If he that hateth thee be hungry, [71]\ngive him bread to eat; and if he be thirsty, give him water to drink.”\nProverbs 20:22; 24:29, 17; Proverbs 25:21, 22 , R.V ., margin.\nThe whole earthly life of Jesus was a manifestation of this princi-\nple. It was to bring the bread of life to His enemies that our Saviour\nleft His home in heaven. Though calumny and persecution were\nheaped upon Him from the cradle to the grave, they called forth from\nHim only the expression of forgiving love. Through the prophet\nIsaiah He says, “I gave My back to the smiters, and My cheeks to\nthem that plucked off the hair: I hid not My face from shame and\nspitting.” “He was oppressed, and He was afflicted, yet He opened\nnot His mouth: He is brought as a lamb to the slaughter, and as a\nsheep before her shearers is dumb, so He openeth not His mouth.”\nIsaiah 50:6; 53:7. And from the cross of Calvary there come down\nthrough the ages His prayer for His murderers and the message of\nhope to the dying thief.\nThe Father’s presence encircled Christ, and nothing befell Him\nbut that which infinite love permitted for the blessing of the world.\nHere was His source of comfort, and it is for us. He who is imbued\nwith the Spirit of Christ abides in Christ. The blow that is aimed at\nhim falls upon the Saviour, who surrounds him with His presence.\nWhatever comes to him comes from Christ. He has no need to resist\nevil, for Christ is his defense. Nothing can touch him except by our\n58 Thoughts from the Mount of Blessing\nLord’s permission, and “all things” that are permitted “work together\nfor good to them that love God.” Romans 8:28.\n“If any man would go to law with thee, and take away thy coat[72]\n[tunic], let him have thy cloak [mantle] also. And whosoever shall\nimpress thee to go one mile, go with him twain.” R.V ., margin.\nJesus bade His disciples, instead of resisting the demands of\nthose in authority, to do even more than was required of them. And,\nso far as possible, they should discharge every obligation, even\nif it were beyond what the law of the land required. The law, as\ngiven through Moses, enjoined a very tender regard for the poor.\nWhen a poor man gave his garment as a pledge, or as security for a\ndebt, the creditor was not permitted to enter the dwelling to obtain\nit; he must wait in the street for the pledge to be brought to him.\nAnd whatever the circumstances the pledge must be returned to its\nowner at nightfall. Deuteronomy 24:10-13. In the days of Christ\nthese merciful provisions were little regarded; but Jesus taught His\ndisciples to submit to the decision of the court, even though this\nshould demand more than the law of Moses authorized. Though\nit should demand a part of their raiment, they were to yield. More\nthan this, they were to give to the creditor his due, if necessary\nsurrendering even more than the court gave him authority to seize.\n“If any man would go to law with thee,” He said, “and take away thy\ncoat, let him have thy cloak also.” R.V . And if the couriers require\nyou to go a mile with them, go two miles.\nJesus added, “Give to him that asketh thee, and from him that\nwould borrow of thee turn not thou away.” The same lesson had been\ntaught through Moses: “Thou shalt not harden thine heart, nor shut\nthine hand from thy poor brother: but thou shalt open thine hand[73]\nwide unto him, and shalt surely lend him sufficient for his need, in\nthat which he wanteth.” Deuteronomy 15:7, 8. This scripture makes\nplain the meaning of the Saviour’s words. Christ does not teach us to\ngive indiscriminately to all who ask for charity; but He says, “Thou\nshalt surely lend him sufficient for his need;” and this is to be a gift,\nrather than a loan; for we are to “lend, hoping for nothing again.”.\n“Who gives himself with his alms feeds three,\nHimself, his hungering neighbor, and Me.”\nSpirituality of the Law 59\n“Love your enemies.”—Matthew 5:44.\nThe Saviour’s lesson, “Resist not him that is evil,” was a hard\nsaying for the revengeful Jews, and they murmured against it among\nthemselves. But Jesus now made a still stronger declaration:\n“Ye have heard that it hath been said, Thou shalt love thy neigh-\nbor, and hate thine enemy. But I say unto you, Love your enemies,\nbless them that curse you, do good to them that hate you, and pray\nfor them which despitefully use you and persecute you; that ye may\nbe the children of your Father which is in heaven.”\nSuch was the spirit of the law which the rabbis had misinterpreted\nas a cold and rigid code of exactions. They regarded themselves as\nbetter than other men, and as entitled to the special favor of God\nby virtue of their birth as Israelites; but Jesus pointed to the spirit\nof forgiving love as that which would give evidence that they were [74]\nactuated by any higher motives than even the publicans and sinners,\nwhom they despised.\nHe pointed His hearers to the Ruler of the universe, under the new\nname, “Our Father.” He would have them understand how tenderly\nthe heart of God yearned over them. He teaches that God cares for\nevery lost soul; that “like as a father pitieth his children, so the Lord\npitieth them that fear Him.” Psalm 103:13. Such a conception of\nGod was never given to the world by any religion but that of the\nBible. Heathenism teaches men to look upon the Supreme Being as\nan object of fear rather than of love—a malign deity to be appeased\nby sacrifices, rather than a Father pouring upon His children the\ngift of His love. Even the people of Israel had become so blinded\nto the precious teaching of the prophets concerning God that this\nrevelation of His paternal love was as an original subject, a new gift\nto the world.\nThe Jews held that God loved those who served Him,—according\nto their view, those who fulfilled the requirements of the rabbis,—\nand that all the rest of the world lay under His frown and curse. Not\nso, said Jesus; the whole world, the evil and the good, lies in the\nsunshine of His love. This truth you should have learned from nature\nitself; for God “maketh His sun to rise on the evil and on the good,\nand sendeth rain on the just and on the unjust.”\n60 Thoughts from the Mount of Blessing\nIt is not because of inherent power that year by year the earth\nproduces her bounties and continues her motion round the sun. The\nhand of God guides the planets and keeps them in position in their\norderly march through the heavens. It is through His power that[75]\nsummer and winter, seedtime and harvest, day and night follow each\nother in their regular succession. It is by His word that vegetation\nflourishes, that the leaves appear and the flowers bloom. Every good\nthing we have, each ray of sunshine and shower of rain, every morsel\nof food, every moment of life, is a gift of love.\nWhile we were yet unloving and unlovely in character, “hateful,\nand hating one another,” our heavenly Father had mercy on us. “After\nthat the kindness and love of God our Saviour toward man appeared,\nnot by works of righteousness which we have done, but according to\nHis mercy He saved us.” Titus 3:3-5. His love received, will make\nus, in like manner, kind and tender, not merely toward those who\nplease us, but to the most faulty and erring and sinful.\nThe children of God are those who are partakers of His nature. It\nis not earthly rank, nor birth, nor nationality, nor religious privilege,\nwhich proves that we are members of the family of God; it is love,\na love that embraces all humanity. Even sinners whose hearts are\nnot utterly closed to God’s Spirit, will respond to kindness; while\nthey may give hate for hate, they will also give love for love. But\nit is only the Spirit of God that gives love for hatred. To be kind to\nthe unthankful and to the evil, to do good hoping for nothing again,\nis the insignia of the royalty of heaven, the sure token by which the\nchildren of the Highest reveal their high estate.\n“Be ye therefore perfect, even as your Father which is in[76]\nheaven is perfect.”—Matthew 5:48.\nThe word “therefore” implies a conclusion, an inference from\nwhat has gone before. Jesus has been describing to His hearers the\nunfailing mercy and love of God, and He bids them therefore to be\nperfect. Because your heavenly Father “is kind unto the unthankful\nand to the evil” (Luke 6:35), because He has stooped to lift you up,\ntherefore, said Jesus, you may become like Him in character, and\nstand without fault in the presence of men and angels.\nSpirituality of the Law 61\nThe conditions of eternal life, under grace, are just what they\nwere in Eden—perfect righteousness, harmony with God, perfect\nconformity to the principles of His law. The standard of character\npresented in the Old Testament is the same that is presented in the\nNew Testament. This standard is not one to which we cannot attain.\nIn every command or injunction that God gives there is a promise,\nthe most positive, underlying the command. God has made provision\nthat we may become like unto Him, and He will accomplish this for\nall who do not interpose a perverse will and thus frustrate His grace.\nWith untold love our God has loved us, and our love awakens\ntoward Him as we comprehend something of the length and breadth\nand depth and height of this love that passeth knowledge. By the rev-\nelation of the attractive loveliness of Christ, by the knowledge of His\nlove expressed to us while we were yet sinners, the stubborn heart is\nmelted and subdued, and the sinner is transformed and becomes a [77]\nchild of heaven. God does not employ compulsory measures; love\nis the agent which He uses to expel sin from the heart. By it He\nchanges pride into humility, and enmity and unbelief into love and\nfaith.\nThe Jews had been wearily toiling to reach perfection by their\nown efforts, and they had failed. Christ had already told them that\ntheir righteousness could never enter the kingdom of heaven. Now\nHe points out to them the character of the righteousness that all who\nenter heaven will possess. Throughout the Sermon on the Mount\nHe describes its fruits, and now in one sentence He points out its\nsource and its nature: Be perfect as God is perfect. The law is but a\ntranscript of the character of God. Behold in your heavenly Father a\nperfect manifestation of the principles which are the foundation of\nHis government.\nGod is love. Like rays of light from the sun, love and light and\njoy flow out from Him to all His creatures. It is His nature to give.\nHis very life is the outflow of unselfish love.\n“His glory is His children’s good;\nHis joy, His tender Fatherhood.”\nHe tells us to be perfect as He is, in the same manner. We are\nto be centers of light and blessing to our little circle, even as He is\n62 Thoughts from the Mount of Blessing\nto the universe. We have nothing of ourselves, but the light of His\nlove shines upon us, and we are to reflect its brightness. “In His\nborrowed goodness good,” we may be perfect in our sphere, even as\nGod is perfect in His.\nJesus said, Be perfect as your Fatheris perfect. If you are the[78]\nchildren of God you are partakers of His nature, and you cannot but\nbe like Him. Every child lives by the life of his father. If you are\nGod’s children, begotten by His Spirit, you live by the life of God.\nIn Christ dwells “all the fullness of the Godhead bodily” (Colossians\n2:9); and the life of Jesus is made manifest “in our mortal flesh” (2\nCorinthians 4:11). That life in you will produce the same character\nand manifest the same works as it did in Him. Thus you will be in\nharmony with every precept of His law; for “the law of the Lord is\nperfect, restoring the soul.” Psalm 19:7 , margin. Through love “the\nrighteousness of the law” will be “fulfilled in us, who walk not after\nthe flesh, but after the Spirit.” Romans 8:4.\nChapter 4—The True Motive in Service [79]\n“Take heed that ye do not your righteousness before men, to be\nseen of them.”—Matthew 6:1, margin.\nThe words of Christ on the mount were an expression of that\nwhich had been the unspoken teaching of His life, but which the\npeople had failed to comprehend. They could not understand how,\nhaving such great power, He neglected to use it in securing what they\nregarded as the chief good. Their spirit and motives and methods\nwere the opposite of His. While they claimed to be very jealous\nfor the honor of the law, self-glory was the real object which they\nsought; and Christ would make it manifest to them that the lover of\nself is a transgressor of the law.\nBut the principles cherished by the Pharisees are such as are\ncharacteristic of humanity in all ages. The spirit of Pharisaism is\nthe spirit of human nature; and as the Saviour showed the contrast\nbetween His own spirit and methods and those of the rabbis, His\nteaching is equally applicable to the people of all time.\nIn the days of Christ the Pharisees were continually trying to\nearn the favor of Heaven in order to secure the worldly honor and\nprosperity which they regarded as the reward of virtue. At the same\ntime they paraded their acts of charity before the people in order to\nattract their attention and gain a reputation for sanctity.\nJesus rebuked their ostentation, declaring that God does not [80]\nrecognize such service and that the flattery and admiration of the\npeople, which they so eagerly sought, was the only reward they\nwould ever receive.\n“When thou doest alms,” He said, “let not thy left hand know\nwhat thy right hand doeth: that thine alms may be in secret: and thy\nFather which seeth in secret Himself shall reward thee openly.”\nIn these words Jesus did not teach that acts of kindness should\nalways be kept secret. Paul the apostle, writing by the Holy Spirit,\ndid not conceal the generous self-sacrifice of the Macedonian Chris-\n63\n64 Thoughts from the Mount of Blessing\ntians, but told of the grace that Christ had wrought in them, and\nthus others were imbued with the same spirit. He also wrote to the\nchurch at Corinth and said, “Your zeal hath stirred up very many.” 2\nCorinthians 9:2 , R.V .\nChrist’s own words make His meaning plain, that in acts of\ncharity the aim should not be to secure praise and honor from men.\nReal godliness never prompts an effort at display. Those who desire\nwords of praise and flattery, and feed upon them as a sweet morsel,\nare Christians in name only.\nBy their good works, Christ’s followers are to bring glory, not\nto themselves, but to Him through whose grace and power they\nhave wrought. It is through the Holy Spirit that every good work is\naccomplished, and the Spirit is given to glorify, not the receiver, but\nthe Giver. When the light of Christ is shining in the soul, the lips will\nbe filled with praise and thanksgiving to God. Your prayers, your\nperformance of duty, your benevolence, your self-denial, will not be\nthe theme of your thought or conversation. Jesus will be magnified,[81]\nself will be hidden, and Christ will appear as all in all.\nWe are to give in sincerity, not to make a show of our good deeds,\nbut from pity and love to the suffering ones. Sincerity of purpose,\nreal kindness of heart, is the motive that Heaven values. The soul\nthat is sincere in its love, wholehearted in its devotion, God regards\nas more precious than the golden wedge of Ophir.\nWe are not to think of reward, but of service; yet kindness shown\nin this spirit will not fail of its recompense. “Thy Father which seeth\nin secret Himself shall reward thee openly.” While it is true that God\nHimself is the great Reward, that embraces every other, the soul\nreceives and enjoys Him only as it becomes assimilated to Him in\ncharacter. Only like can appreciate like. It is as we give ourselves to\nGod for the service of humanity that He gives Himself to us.\nNo one can give place in his own heart and life for the stream\nof God’s blessing to flow to others, without receiving in himself a\nrich reward. The hillsides and plains that furnish a channel for the\nmountain streams to reach the sea suffer no loss thereby. That which\nthey give is repaid a hundredfold. For the stream that goes singing\non its way leaves behind its gift of verdure and fruitfulness. The\ngrass on its banks is a fresher green, the trees have a richer verdure,\nthe flowers are more abundant. When the earth lies bare and brown\nTrue Motive in Service 65\nunder the summer’s parching heat, a line of verdure marks the river’s\ncourse; and the plain that opened her bosom to bear the mountain’s [82]\ntreasure to the sea is clothed with freshness and beauty, a witness to\nthe recompense that God’s grace imparts to all who give themselves\nas a channel for its outflow to the world.\nThis is the blessing of those who show mercy to the poor. The\nprophet Isaiah says, “Is it not to deal thy bread to the hungry, and that\nthou bring the poor that are cast out to thy house? when thou seest\nthe naked, that thou cover him; and that thou hide not thyself from\nthine own flesh? Then shall thy light break forth as the morning, and\nthine health shall spring forth speedily.... And the Lord shall guide\nthee continually, and satisfy thy soul in drought: ... and thou shalt\nbe like a watered garden, and like a spring of water, whose waters\nfail not.” Isaiah 58:7-11.\nThe work of beneficence is twice blessed. While he that gives to\nthe needy blesses others, he himself is blessed in a still greater degree.\nThe grace of Christ in the soul is developing traits of character that\nare the opposite of selfishness,—traits that will refine, ennoble, and\nenrich the life. Acts of kindness performed in secret will bind hearts\ntogether, and will draw them closer to the heart of Him from whom\nevery generous impulse springs. The little attentions, the small acts\nof love and self-sacrifice, that flow out from the life as quietly as\nthe fragrance from a flower—these constitute no small share of the\nblessings and happiness of life. And it will be found at last that the\ndenial of self for the good and happiness of others, however humble\nand uncommended here, is recognized in heaven as the token of our\nunion with Him, the King of glory, who was rich, yet for our sake [83]\nbecame poor.\nThe deeds of kindness may have been done in secret, but the\nresult upon the character of the doer cannot be hidden. If we work\nwith wholehearted interest as a follower of Christ, the heart will be\nin close sympathy with God, and the Spirit of God, moving upon\nour spirit, will call forth the sacred harmonies of the soul in answer\nto the divine touch.\nHe who gives increased talents to those who have made a wise\nimprovement of the gifts entrusted to them is pleased to acknowledge\nthe service of His believing people in the Beloved, through whose\ngrace and strength they have wrought. Those who have sought for\n66 Thoughts from the Mount of Blessing\nthe development and perfection of Christian character by exercising\ntheir faculties in good works, will, in the world to come, reap that\nwhich they have sown. The work begun upon earth will reach its\nconsummation in that higher and holier life to endure throughout\neternity.\n“When thou prayest, thou shalt not be as the hypocrites\nare.”—Matthew 6:5.\nThe Pharisees had stated hours for prayer; and when, as often\ncame to pass, they were abroad at the appointed time, they would\npause wherever they might be—perhaps in the street or the market\nplace, amid the hurrying throngs of men—and there in a loud voice\nrehearse their formal prayers. Such worship, offered merely for self-\nglorification, called forth unsparing rebuke from Jesus. He did not,[84]\nhowever, discountenance public prayer, for He Himself prayed with\nHis disciples and in the presence of the multitude. But He teaches\nthat private prayer is not to be made public. In secret devotion our\nprayers are to reach the ears of none but the prayer-hearing God. No\ncurious ear is to receive the burden of such petitions.\n“When thou prayest, enter into thy closet.” Have a place for\nsecret prayer. Jesus had select places for communion with God, and\nso should we. We need often to retire to some spot, however humble,\nwhere we can be alone with God.\n“Pray to thy Father which is in secret.” In the name of Jesus we\nmay come into God’s presence with the confidence of a child. No\nman is needed to act as a mediator. Through Jesus we may open our\nhearts to God as to one who knows and loves us.\nIn the secret place of prayer, where no eye but God’s can see, no\near but His can hear, we may pour out our most hidden desires and\nlongings to the Father of infinite pity, and in the hush and silence\nof the soul that voice which never fails to answer the cry of human\nneed will speak to our hearts.\n“The Lord is very pitiful, and of tender mercy.” James 5:11. He\nwaits with unwearied love to hear the confessions of the wayward\nand to accept their penitence. He watches for some return of grat-\nitude from us, as the mother watches for the smile of recognition\nfrom her beloved child. He would have us understand how earnestly\nTrue Motive in Service 67\nand tenderly His heart yearns over us. He invites us to take our trials\nto His sympathy, our sorrows to His love, our wounds to His healing, [85]\nour weakness to His strength, our emptiness to His fullness. Never\nhas one been disappointed who came unto Him. “They looked unto\nHim, and were lightened: and their faces were not ashamed.” Psalm\n34:5.\nThose who seek God in secret telling the Lord their needs and\npleading for help, will not plead in vain. “Thy Father which seeth\nin secret Himself shall reward thee openly.” As we make Christ our\ndaily companion we shall feel that the powers of an unseen world are\nall around us; and by looking unto Jesus we shall become assimilated\nto His image. By beholding we become changed. The character\nis softened, refined, and ennobled for the heavenly kingdom. The\nsure result of our intercourse and fellowship with our Lord will\nbe to increase piety, purity, and fervor. There will be a growing\nintelligence in prayer. We are receiving a divine education, and this\nis illustrated in a life of diligence and zeal.\nThe soul that turns to God for its help, its support, its power, by\ndaily, earnest prayer, will have noble aspirations, clear perceptions\nof truth and duty, lofty purposes of action, and a continual hungering\nand thirsting after righteousness. By maintaining a connection with\nGod, we shall be enabled to diffuse to others, through our association\nwith them, the light, the peace, the serenity, that rule in our hearts.\nThe strength acquired in prayer to God, united with persevering effort\nin training the mind in thoughtfulness and care-taking, prepares one\nfor daily duties and keeps the spirit in peace under all circumstances.\nIf we draw near to God, He will put a word in our mouth to speak [86]\nfor Him, even praise unto His name. He will teach us a strain from\nthe song of the angels, even thanksgiving to our heavenly Father. In\nevery act of life, the light and love of an indwelling Saviour will be\nrevealed. Outward troubles cannot reach the life that is lived by faith\nin the Son of God.\n“When ye pray, use not vain repetitions, as the heathen\ndo.”—Matthew 6:7.\nThe heathen looked upon their prayers as having in themselves\nmerit to atone for sin. Hence the longer the prayer the greater the\n68 Thoughts from the Mount of Blessing\nmerit. If they could become holy by their own efforts they would\nhave something in themselves in which to rejoice, some ground for\nboasting. This idea of prayer is an outworking of the principle of\nself-expiation which lies at the foundation of all systems of false\nreligion. The Pharisees had adopted this pagan idea of prayer, and\nit is by no means extinct in our day, even among those who profess\nto be Christians. The repetition of set, customary phrases, when the\nheart feels no need of God, is of the same character as the “vain\nrepetitions” of the heathen.\nPrayer is not an expiation for sin; it has no virtue or merit of\nitself. All the flowery words at our command are not equivalent to\none holy desire. The most eloquent prayers are but idle words if they\ndo not express the true sentiments of the heart. But the prayer that\ncomes from an earnest heart, when the simple wants of the soul are\nexpressed, as we would ask an earthly friend for a favor, expecting[87]\nit to be granted—this is the prayer of faith. God does not desire our\nceremonial compliments, but the unspoken cry of the heart broken\nand subdued with a sense of its sin and utter weakness finds its way\nto the Father of all mercy.\n“When ye fast, be not, as the hypocrites.”—Matthew 6:16.\nThe fasting which the word of God enjoins is something more\nthan a form. It does not consist merely in refusing food, in wearing\nsackcloth, in sprinkling ashes upon the head. He who fasts in real\nsorrow for sin will never court display.\nThe object of the fast which God calls upon us to keep is not to\nafflict the body for the sin of the soul, but to aid us in perceiving\nthe grievous character of sin, in humbling the heart before God and\nreceiving His pardoning grace. His command to Israel was, “Rend\nyour heart, and not your garments, and turn unto the Lord your God.”\nJoel 2:13.\nIt will avail nothing for us to do penance or to flatter ourselves\nthat by our own works we shall merit or purchase an inheritance\namong the saints. When the question was asked Christ, “What shall\nwe do, that we might work the works of God?” He answered, “This\nis the work of God, that ye believe on Him whom He hath sent.”\nJohn 6:28, 29. Repentance is turning from self to Christ; and when\nTrue Motive in Service 69\nwe receive Christ so that through faith He can live His life in us,\ngood works will be manifest.\nJesus said, “When thou fastest, anoint thine head, and wash thy [88]\nface; that thou appear not unto men to fast, but unto thy Father which\nis in secret.” Matthew 6:17, 18. Whatever is done to the glory of God\nis to be done with cheerfulness, not with sadness and gloom. There\nis nothing gloomy in the religion of Jesus. If Christians give the\nimpression by a mournful attitude that they have been disappointed\nin their Lord, they misrepresent His character and put arguments\ninto the mouth of His enemies. Though in words they may claim\nGod as their Father, yet in gloom and sorrow they present to the\nworld the aspect of orphans.\nChrist desires us to make His service appear attractive, as it\nreally is. Let the self-denials and the secret heart trials be revealed\nto the compassionate Saviour. Let the burdens be left at the foot of\nthe cross, and go on your way rejoicing in His love who first loved\nyou. Men may never know of the work going on secretly between\nthe soul and God, but the result of the Spirit’s work upon the heart\nwill be manifest to all, for He “which seeth in secret, shall reward\nthee openly.”\n“Lay not up for yourselves treasures upon earth.”—Matthew\n6:19.\nTreasure laid up on earth will not endure; thieves break through\nand steal; moth and rust corrupt; fire and storm sweep away your\npossessions. And “where your treasure is, there will your heart be\nalso.” Treasure laid up on the earth will engross the mind to the\nexclusion of heavenly things.\nThe love of money was the ruling passion in the Jewish age. [89]\nWorldliness usurped the place of God and religion in the soul. So\nit is now. Avaricious greed for wealth exerts such a fascinating,\nbewitching influence over the life that it results in perverting the\nnobility and corrupting the humanity of men until they are drowned\nin perdition. The service of Satan is full of care, perplexity, and\nwearing labor, and the treasure men toil to accumulate on earth is\nonly for a season.\n70 Thoughts from the Mount of Blessing\nJesus said, “Lay up for yourselves treasures in heaven, where\nneither moth nor rust doth corrupt, and where thieves do not break\nthrough nor steal: for where your treasure is, there will your heart\nbe also.”\nThe instruction is to “lay up for yourselves treasures in heaven.”\nIt is for your own interest to secure heavenly riches. These alone, of\nall that you possess, are really yours. The treasure laid up in heaven\nis imperishable. No fire or flood can destroy it, no thief despoil it,\nno moth or rust corrupt it; for it is in the keeping of God.\nThis treasure, which Christ esteems as precious above all esti-\nmate, is “the riches of the glory of His inheritance in the saints.”\nEphesians 1:18. The disciples of Christ are called His jewels, His\nprecious and peculiar treasure. He says, “They shall be as the stones\nof a crown.” “I will make a man more precious than fine gold; even\na man than the golden wedge of Ophir.” Zechariah 9:16; Isaiah\n13:12. Christ looks upon His people in their purity and perfection as\nthe reward of all His sufferings, His humiliation, and His love, and\nthe supplement of His glory—Christ, the great Center, from whom\nradiates all glory.\nAnd we are permitted to unite with Him in the great work of[90]\nredemption and to be sharers with Him in the riches which His death\nand suffering have won. The apostle Paul wrote to the Thessalonian\nChristians: “What is our hope, or joy, or crown of rejoicing? Are\nnot even ye in the presence of our Lord Jesus Christ at His coming?\nfor ye are our glory and joy.” 1 Thessalonians 2:19, 20. This is the\ntreasure for which Christ bids us labor. Character is the great harvest\nof life. And every word or deed that through the grace of Christ\nshall kindle in one soul an impulse that reaches heavenward, every\neffort that tends to the formation of a Christlike character, is laying\nup treasure in heaven.\nWhere the treasure is, there the heart will be. In every effort to\nbenefit others, we benefit ourselves. He who gives money or time\nfor spreading the gospel enlists his own interest and prayers for the\nwork, and for the souls to be reached through it; his affections go\nout to others, and he is stimulated to greater devotion to God, that\nhe may be enabled to do them the greatest good.\nAnd at the final day, when the wealth of earth shall perish, he\nwho has laid up treasure in heaven will behold that which his life\nTrue Motive in Service 71\nhas gained. If we have given heed to the words of Christ, then, as\nwe gather around the great white throne, we shall see souls who\nhave been saved through our agency, and shall know that one has\nsaved others, and these still others—a large company brought into\nthe haven of rest as the result of our labors, there to lay their crowns\nat Jesus’ feet, and praise Him through the ceaseless ages of eternity.\nWith what joy will the worker for Christ behold these redeemed ones, [91]\nwho share the glory of the Redeemer! How precious will heaven be\nto those who have been faithful in the work of saving souls!\n“If ye then be risen with Christ, seek those things which are\nabove, where Christ sitteth on the right hand of God.” Colossians\n3:1.\n“If ... thine eye be single, thy whole body shall be full of\nlight.”—Matthew 6:22.\nSingleness of purpose, wholehearted devotion to God, is the\ncondition pointed out by the Saviour’s words. Let the purpose be\nsincere and unwavering to discern the truth and to obey it at whatever\ncost, and you will receive divine enlightenment. Real piety begins\nwhen all compromise with sin is at an end. Then the language of the\nheart will be that of the apostle Paul: “This one thing I do, forgetting\nthose things which are behind, and reaching forth unto those things\nwhich are before, I press toward the mark for the prize of the high\ncalling of God in Christ Jesus.” “I count all things but loss for the\nexcellency of the knowledge of Christ Jesus my Lord: for whom I\nhave suffered the loss of all things, and do count them but dung, that\nI may win Christ.” Philippians 3:13, 14, 8.\nBut when the eye is blinded by the love of self, there is only\ndarkness. “If thine eye be evil, thy whole body shall be full of\ndarkness.” It was this fearful darkness that wrapped the Jews in\nstubborn unbelief, making it impossible for them to appreciate the [92]\ncharacter and mission of Him who came to save them from their\nsins.\nYielding to temptation begins in permitting the mind to waver,\nto be inconstant in your trust in God. If we do not choose to give\nourselves fully to God then we are in darkness. When we make any\nreserve we are leaving open a door through which Satan can enter to\n72 Thoughts from the Mount of Blessing\nlead us astray by his temptations. He knows that if he can obscure\nour vision, so that the eye of faith cannot see God, there will be no\nbarrier against sin.\nThe prevalence of a sinful desire shows the delusion of the soul.\nEvery indulgence of that desire strengthens the soul’s aversion to\nGod. In following the path of Satan’s choosing, we are encompassed\nby the shadows of evil, and every step leads into deeper darkness\nand increases the blindness of the heart.\nThe same law obtains in the spiritual as in the natural world.\nHe who abides in darkness will at last lose the power of vision.\nHe is shut in by a deeper than midnight blackness; and to him the\nbrightest noontide can bring no light. He “walketh in darkness, and\nknoweth not whither he goeth, because that darkness hath blinded his\neyes.” 1 John 2:11. Through persistently cherishing evil, willfully\ndisregarding the pleadings of divine love, the sinner loses the love\nfor good, the desire for God, the very capacity to receive the light\nof heaven. The invitation of mercy is still full of love, the light is\nshining as brightly as when it first dawned upon his soul; but the\nvoice falls on deaf ears, the light on blinded eyes.\nNo soul is ever finally deserted of God, given up to his own ways,[93]\nso long as there is any hope of his salvation. “Man turns from God,\nnot God from him.” Our heavenly Father follows us with appeals and\nwarnings and assurances of compassion, until further opportunities\nand privileges would be wholly in vain. The responsibility rests with\nthe sinner. By resisting the Spirit of God today, he prepares the way\nfor a second resistance of light when it comes with mightier power.\nThus he passes on from one stage of resistance to another, until at\nlast the light will fail to impress, and he will cease to respond in any\nmeasure to the Spirit of God. Then even “the light that is in thee”\nhas become darkness. The very truth we do know has become so\nperverted as to increase the blindness of the soul.\n“No man can serve two masters.”—Matthew 6:24.\nChrist does not say that man will not or shall not serve two\nmasters, but that he cannot. The interests of God and the interests of\nmammon have no union or sympathy. Just where the conscience of\nthe Christian warns him to forbear, to deny himself, to stop, just there\nTrue Motive in Service 73\nthe worldling steps over the line, to indulge his selfish propensities.\nOn one side of the line is the self-denying follower of Christ; on the\nother side is the self-indulgent world lover, pandering to fashion,\nengaging in frivolity, and pampering himself in forbidden pleasure.\nOn that side of the line the Christian cannot go.\nNo one can occupy a neutral position; there is no middle class, [94]\nwho neither love God nor serve the enemy of righteousness. Christ\nis to live in His human agents and work through their faculties and\nact through their capabilities. Their will must be submitted to His\nwill; they must act with His Spirit. Then it is no more they that live,\nbut Christ that lives in them. He who does not give himself wholly\nto God is under the control of another power, listening to another\nvoice, whose suggestions are of an entirely different character. Half-\nand-half service places the human agent on the side of the enemy as\na successful ally of the hosts of darkness. When men who claim to\nbe soldiers of Christ engage with the confederacy of Satan, and help\nalong his side, they prove themselves enemies of Christ. They betray\nsacred trusts. They form a link between Satan and the true soldiers,\nso that through these agencies the enemy is constantly working to\nsteal away the hearts of Christ’s soldiers.\nThe strongest bulwark of vice in our world is not the iniqui-\ntous life of the abandoned sinner or the degraded outcast; it is that\nlife which otherwise appears virtuous, honorable, and noble, but\nin which one sin is fostered, one vice indulged. To the soul that is\nstruggling in secret against some giant temptation, trembling upon\nthe very verge of the precipice, such an example is one of the most\npowerful enticements to sin. He who, endowed with high concep-\ntions of life and truth and honor, does yet willfully transgress one\nprecept of God’s holy law, has perverted His noble gifts into a lure\nto sin. Genius, talent, sympathy, even generous and kindly deeds,\nmay become decoys of Satan to entice other souls over the precipice [95]\nof ruin for this life and the life to come.\n“Love not the world, neither the things that are in the world. If\nany man love the world, the love of the Father is not in him. For\nall that is in the world, the lust of the flesh, and the lust of the eyes,\nand the pride of life, is not of the Father, but is of the world.” 1 John\n2:15, 16.\n74 Thoughts from the Mount of Blessing\n“Be not anxious.”—Matthew 6:25, R. V .\nHe who has given you life knows your need of food to sustain it.\nHe who created the body is not unmindful of your need of raiment.\nWill not He who has bestowed the greater gift bestow also what is\nneeded to make it complete?\nJesus pointed His hearers to the birds as they warbled their carols\nof praise, unencumbered with thoughts of care, for “they sow not,\nneither do they reap;” and yet the great Father provides for their\nneeds. And He asks, “Are not ye of much more value than they?”",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "R.V .",
        "chunk_index": 0,
        "page_reference": "27-77",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110469"
      }
    },
    {
      "id": "thoughts_mount_blessing_000008",
      "text": "“No sparrow falls without His care,\nNo soul bows low but Jesus knows;\nFor He is with us everywhere,\nAnd marks each bitter tear that flows.\nAnd He will never, never, never\nForsake the soul that trusts Him ever.”\nThe hillsides and the fields were bright with flowers, and, point-\ning to them in the dewy freshness of the morning, Jesus said, “Con-[96]\nsider the lilies of the field, how they grow.” The graceful forms and\ndelicate hues of the plants and flowers may be copied by human\nskill, but what touch can impart life to even one flower or blade of\ngrass? Every wayside blossom owes its being to the same power\nthat set the starry worlds on high. Through all created things thrills\none pulse of life from the great heart of God. The flowers of the\nfield are clothed by His hand in richer robes than have ever graced\nthe forms of earthly kings. And “if God so clothe the grass of the\nfield, which today is, and tomorrow is cast into the oven, shall He\nnot much more clothe you, O ye of little faith?”\nIt is He who made the flowers and who gave to the sparrow its\nsong who says, “Consider the lilies,” “Behold the birds.” R.V . In\nthe loveliness of the things of nature you may learn more of the\nwisdom of God than the schoolmen know. On the lily’s petals, God\nhas written a message for you, written in language that your heart\ncan read only as it unlearns the lessons of distrust and selfishness\nand corroding care. Why has He given you the singing birds and\nthe gentle blossoms, but from the overflowing love of a Father’s\nTrue Motive in Service 75\nheart, that would brighten and gladden your path of life? All that\nwas needed for existence would have been yours without the flowers\nand birds, but God was not content to provide what would suffice\nfor mere existence. He has filled earth and air and sky with glimpses\nof beauty to tell you of His loving thought for you. The beauty of\nall created things is but a gleam from the shining of His glory. If He\nhas lavished such infinite skill upon the things of nature, for your [97]\nhappiness and joy, can you doubt that He will give you every needed\nblessing?\n“Consider the lilies.” Every flower that opens its petals to the\nsunshine obeys the same great laws that guide the stars, and how\nsimple and beautiful and how sweet its life! Through the flowers,\nGod would call our attention to the loveliness of Christlike character.\nHe who has given such beauty to the blossoms desires far more that\nthe soul should be clothed with the beauty of the character of Christ.\nConsider, says Jesus, how the lilies grow; how, springing from\nthe cold, dark earth, or from the mud of the river bed, the plants\nunfold in loveliness and fragrance. Who would dream of the possi-\nbilities of beauty in the rough brown bulb of the lily? But when the\nlife of God, hidden therein, unfolds at His call in the rain and the\nsunshine, men marvel at the vision of grace and loveliness. Even so\nwill the life of God unfold in every human soul that will yield itself\nto the ministry of His grace, which, free as the rain and the sunshine,\ncomes with its benediction to all. It is the word of God that creates\nthe flowers, and the same word will produce in you the graces of\nHis Spirit.\nGod’s law is the law of love. He has surrounded you with beauty\nto teach you that you are not placed on earth merely to delve for self,\nto dig and build, to toil and spin, but to make life bright and joyous\nand beautiful with the love of Christ—like the flowers, to gladden\nother lives by the ministry of love.\nFathers and mothers, let your children learn from the flowers.\nTake them with you into garden and field and under the leafy trees, [98]\nand teach them to read in nature the message of God’s love. Let the\nthoughts of Him be linked with bird and flower and tree. Lead the\nchildren to see in every pleasant and beautiful thing an expression\nof God’s love for them. Recommend your religion to them by its\npleasantness. Let the law of kindness be in your lips.\n76 Thoughts from the Mount of Blessing\nTeach the children that because of God’s great love their natures\nmay be changed and brought into harmony with His. Teach them that\nHe would have their lives beautiful with the graces of the flowers.\nTeach them, as they gather the sweet blossoms, that He who made\nthe flowers is more beautiful than they. Thus the tendrils of their\nhearts will be entwined about Him. He who is “altogether lovely”\nwill become to them as a daily companion and familiar friend, and\ntheir lives will be transformed into the image of His purity.\n“Seek ye first the kingdom of God.”—Matthew 6:33.\nThe people who listened to the words of Christ were still anx-\niously watching for some announcement of the earthly kingdom.\nWhile Jesus was opening to them the treasures of heaven, the ques-\ntion uppermost in many minds was, How will a connection with Him\nadvance our prospects in the world? Jesus shows that in making the\nthings of the world their supreme anxiety they were like the heathen\nnations about them, living as if there were no God, whose tender[99]\ncare is over His creatures.\n“All these things,” said Jesus, “do the nations of the world seek\nafter.” “Your heavenly Father knoweth that ye have need of all these\nthings. But seek ye first the kingdom of God, and His righteousness;\nand all these things shall be added unto you.” Luke 12:30; Matthew\n6:32, 33. I have come to open to you the kingdom of love and\nrighteousness and peace. Open your hearts to receive this kingdom,\nand make its service your highest interest. Though it is a spiritual\nkingdom, fear not that your needs for this life will be uncared-for. If\nyou give yourself to God’s service, He who has all power in heaven\nand earth will provide for your needs.\nJesus does not release us from the necessity of effort, but He\nteaches that we are to make Him first and last and best in everything.\nWe are to engage in no business, follow no pursuit, seek no plea-\nsure, that would hinder the outworking of His righteousness in our\ncharacter and life. Whatever we do is to be done heartily, as unto\nthe Lord.\nJesus, while He dwelt on earth, dignified life in all its details\nby keeping before men the glory of God, and by subordinating\neverything to the will of His Father. If we follow His example, His\nTrue Motive in Service 77\nassurance to us is that all things needful in this life “shall be added.”\nPoverty or wealth, sickness or health, simplicity or wisdom—all are\nprovided for in the promise of His grace.\nGod’s everlasting arm encircles the soul that turns to Him for\naid, however feeble that soul may be. The precious things of the hills [100]\nshall perish, but the soul that lives for God shall abide with Him.\n“The world passeth away, and the lust thereof; but he that doeth the\nwill of God abideth forever.” 1 John 2:17. The city of God will open\nits golden gates to receive him who learned while on earth to lean\non God for guidance and wisdom, for comfort and hope, amid loss\nand affliction. The songs of the angels will welcome him there, and\nfor him the tree of life shall yield its fruit. “The mountains shall\ndepart, and the hills be removed; but My kindness shall not depart\nfrom thee, neither shall the covenant of My peace be removed, saith\nthe Lord that hath mercy on thee.” Isaiah 54:10.\n“Be not therefore anxious for the morrow.... Sufficient unto the\nday is the evil thereof.”—Matthew 6:34, R. V .\nIf you have given yourself to God, to do His work, you have\nno need to be anxious for tomorrow. He whose servant you are,\nknows the end from the beginning. The events of tomorrow, which\nare hidden from your view, are open to the eyes of Him who is\nomnipotent.\nWhen we take into our hands the management of things with\nwhich we have to do, and depend upon our own wisdom for success,\nwe are taking a burden which God has not given us, and are trying\nto bear it without His aid. We are taking upon ourselves the respon-\nsibility that belongs to God, and thus are really putting ourselves in\nHis place. We may well have anxiety and anticipate danger and loss, [101]\nfor it is certain to befall us. But when we really believe that God\nloves us and means to do us good we shall cease to worry about the\nfuture. We shall trust God as a child trusts a loving parent. Then our\ntroubles and torments will disappear, for our will is swallowed up in\nthe will of God.\nChrist has given us no promise of help in bearing today the\nburdens of tomorrow. He has said, “My grace is sufficient for thee”\n(2 Corinthians 12:9); but, like the manna given in the wilderness,\n78 Thoughts from the Mount of Blessing\nHis grace is bestowed daily, for the day’s need. Like the hosts of\nIsrael in their pilgrim life, we may find morning by morning the\nbread of heaven for the day’s supply.\nOne day alone is ours, and during this day we are to live for God.\nFor this one day we are to place in the hand of Christ, in solemn\nservice, all our purposes and plans, casting all our care upon Him,\nfor He careth for us. “I know the thoughts that I think toward you,\nsaith the Lord, thoughts of peace, and not of evil, to give you an\nexpected end.” “In returning and rest shall ye be saved; in quietness\nand in confidence shall be your strength.” Jeremiah 29:11; Isaiah\n30:15.\nIf you will seek the Lord and be converted every day; if you\nwill of your own spiritual choice be free and joyous in God; if with\ngladsome consent of heart to His gracious call you come wearing\nthe yoke of Christ,—the yoke of obedience and service,—all your\nmurmurings will be stilled, all your difficulties will be removed, all\nthe perplexing problems that now confront you will be solved.\nChapter 5—The Lord’s Prayer [102]\n“After this manner therefore pray ye.”—Matthew 6:9.\nThe Lord’s Prayer was twice given by our Saviour, first to the\nmultitude in the Sermon on the Mount, and again, some months later,\nto the disciples alone. The disciples had been for a short time absent\nfrom their Lord, when on their return they found Him absorbed in\ncommunion with God. Seeming unconscious of their presence, He\ncontinued praying aloud. The Saviour’s face was irradiated with a\ncelestial brightness. He seemed to be in the very presence of the\nUnseen, and there was a living power in His words as of one who\nspoke with God.\nThe hearts of the listening disciples were deeply moved. They\nhad marked how often He spent long hours in solitude in communion\nwith His Father. His days were passed in ministry to the crowds\nthat pressed upon Him, and in unveiling the treacherous sophistry of\nthe rabbis, and this incessant labor often left Him so utterly wearied\nthat His mother and brothers, and even His disciples, had feared that\nHis life would be sacrificed. But as He returned from the hours of\nprayer that closed the toilsome day, they marked the look of peace\nupon His face, the sense of refreshment that seemed to pervade His\npresence. It was from hours spent with God that He came forth,\nmorning by morning, to bring the light of heaven to men. The\ndisciples had come to connect His hours of prayer with the power [103]\nof His words and works. Now, as they listened to His supplication,\ntheir hearts were awed and humbled. As He ceased praying, it was\nwith a conviction of their own deep need that they exclaimed, “Lord,\nteach us to pray.” Luke 11:1.\nJesus gives them no new form of prayer. That which He has\nbefore taught them He repeats, as if He would say, You need to\nunderstand what I have already given. It has a depth of meaning you\nhave not yet fathomed.\n79\n80 Thoughts from the Mount of Blessing\nThe Saviour does not, however, restrict us to the use of these\nexact words. As one with humanity, He presents His own ideal\nof prayer, words so simple that they may be adopted by the little\nchild, yet so comprehensive that their significance can never be fully\ngrasped by the greatest minds. We are taught to come to God with\nour tribute of thanksgiving, to make known our wants, to confess\nour sins, and to claim His mercy in accordance with His promise.\n“When ye pray, say, Our Father.”—Luke 11:2.\nJesus teaches us to call His Father our Father. He is not ashamed\nto call us brethren. Hebrews 2:11. So ready, so eager, is the Saviour’s\nheart to welcome us as members of the family of God, that in the\nvery first words we are to use in approaching God He places the\nassurance of our divine relationship, “Our Father.”\nHere is the announcement of that wonderful truth, so full of[104]\nencouragement and comfort, that God loves us as He loves His Son.\nThis is what Jesus said in His last prayer for His disciples, Thou\n“hast loved them, as Thou hast loved Me.” John 17:23.\nThe world that Satan has claimed and has ruled over with cruel\ntyranny, the Son of God has, by one vast achievement, encircled in\nHis love and connected again with the throne of Jehovah. Cherubim\nand seraphim, and the unnumbered hosts of all the unfallen worlds,\nsang anthems of praise to God and the Lamb when this triumph was\nassured. They rejoiced that the way of salvation had been opened to\nthe fallen race and that the earth would be redeemed from the curse\nof sin. How much more should those rejoice who are the objects of\nsuch amazing love!\nHow can we ever be in doubt and uncertainty, and feel that we\nare orphans? It was in behalf of those who had transgressed the law\nthat Jesus took upon Him human nature; He became like unto us,\nthat we might have everlasting peace and assurance. We have an\nAdvocate in the heavens, and whoever accepts Him as a personal\nSaviour is not left an orphan to bear the burden of his own sins.\n“Beloved, now are we the sons of God.” “And if children, then\nheirs; heirs of God, and joint heirs with Christ; if so be that we suffer\nwith Him, that we may be also glorified together.” “It doth not yet\nappear what we shall be: but we know that, when He shall appear,\nLord’s Prayer 81\nwe shall be like Him; for we shall see Him as He is.” 1 John 3:2;\nRomans 8:17.\nThe very first step in approaching God is to know and believe [105]\nthe love that He has to us (1 John 4:16); for it is through the drawing\nof His love that we are led to come to Him.\nThe perception of God’s love works the renunciation of selfish-\nness. In calling God our Father, we recognize all His children as our\nbrethren. We are all a part of the great web of humanity, all members\nof one family. In our petitions we are to include our neighbors as\nwell as ourselves. No one prays aright who seeks a blessing for\nhimself alone.\nThe infinite God, said Jesus, makes it your privilege to approach\nHim by the name of Father. Understand all that this implies. No\nearthly parent ever pleaded so earnestly with an erring child as He\nwho made you pleads with the transgressor. No human, loving inter-\nest ever followed the impenitent with such tender invitations. God\ndwells in every abode; He hears every word that is spoken, listens to\nevery prayer that is offered, tastes the sorrows and disappointments\nof every soul, regards the treatment that is given to father, mother,\nsister, friend, and neighbor. He cares for our necessities, and His\nlove and mercy and grace are continually flowing to satisfy our need.\nBut if you call God your Father you acknowledge yourselves\nHis children, to be guided by His wisdom and to be obedient in all\nthings, knowing that His love is changeless. You will accept His\nplan for your life. As children of God, you will hold His honor,\nHis character, His family, His work, as the objects of your highest\ninterest. It will be your joy to recognize and honor your relation to\nyour Father and to every member of His family. You will rejoice\nto do any act, however humble, that will tend to His glory or to the [106]\nwell-being of your kindred.\n“Which art in heaven.” He to whom Christ bids us look as\n“our Father” “is in the heavens: He hath done whatsoever He hath\npleased.” In His care we may safely rest, saying, “What time I am\nafraid, I will trust in Thee.” Psalm 115:3; 56:3.\n82 Thoughts from the Mount of Blessing\n“Hallowed be Thy name.”—Matthew 6:9.\nTo hallow the name of the Lord requires that the words in which\nwe speak of the Supreme Being be uttered with reverence. “Holy and\nreverend is His name.” Psalm 111:9. We are never in any manner to\ntreat lightly the titles or appellations of the Deity. In prayer we enter\nthe audience chamber of the Most High; and we should come before\nHim with holy awe. The angels veil their faces in His presence.\nThe cherubim and the bright and holy seraphim approach His throne\nwith solemn reverence. How much more should we, finite, sinful\nbeings, come in a reverent manner before the Lord, our Maker!\nBut to hallow the name of the Lord means much more than this.\nWe may, like the Jews in Christ’s day, manifest the greatest outward\nreverence for God, and yet profane His name continually. “The name\nof the Lord” is “merciful and gracious, long-suffering, and abundant\nin goodness and truth, ... forgiving iniquity and transgression and\nsin.” Exodus 34:5-7. Of the church of Christ it is written, “This is the\nname wherewith she shall be called, The Lord our Righteousness.”\nJeremiah 33:16. This name is put upon every follower of Christ. It[107]\nis the heritage of the child of God. The family are called after the\nFather. The prophet Jeremiah, in the time of Israel’s sore distress\nand tribulation, prayed, “We are called by Thy name; leave us not.”\nJeremiah 14:9.\nThis name is hallowed by the angels of heaven, by the inhabitants\nof unfallen worlds. When you pray, “Hallowed be Thy name,” you\nask that it may be hallowed in this world, hallowed in you. God has\nacknowledged you before men and angels as His child; pray that you\nmay do no dishonor to the “worthy name by which ye are called.”\nJames 2:7. God sends you into the world as His representative. In\nevery act of life you are to make manifest the name of God. This\npetition calls upon you to possess His character. You cannot hallow\nHis name, you cannot represent Him to the world, unless in life and\ncharacter you represent the very life and character of God. This you\ncan do only through the acceptance of the grace and righteousness\nof Christ.\nLord’s Prayer 83\n“Thy kingdom come.”—Matthew 6:10.\nGod is our Father, who loves and cares for us as His children; He\nis also the great King of the universe. The interests of His kingdom\nare our interests, and we are to work for its upbuilding.\nThe disciples of Christ were looking for the immediate coming\nof the kingdom of His glory, but in giving them this prayer Jesus\ntaught that the kingdom was not then to be established. They were to [108]\npray for its coming as an event yet future. But this petition was also\nan assurance to them. While they were not to behold the coming of\nthe kingdom in their day, the fact that Jesus bade them pray for it is\nevidence that in God’s own time it will surely come.\nThe kingdom of God’s grace is now being established, as day\nby day hearts that have been full of sin and rebellion yield to the\nsovereignty of His love. But the full establishment of the kingdom\nof His glory will not take place until the second coming of Christ\nto this world. “The kingdom and dominion, and the greatness of\nthe kingdom under the whole heaven,” is to be given to “the people\nof the saints of the Most High.” Daniel 7:27. They shall inherit\nthe kingdom prepared for them “from the foundation of the world.”\nMatthew 25:34. And Christ will take to Himself His great power\nand will reign.\nThe heavenly gates are again to be lifted up, and with ten thou-\nsand times ten thousand and thousands of thousands of holy ones,\nour Saviour will come forth as King of kings and Lord of lords.\nJehovah Immanuel “shall be king over all the earth: in that day shall\nthere be one Lord, and His name one.” “The tabernacle of God”\nshall be with men, “and He will dwell with them, and they shall be\nHis people, and God Himself shall be with them, and be their God.”\nZechariah 14:9; Revelation 21:3.\nBut before that coming, Jesus said, “This gospel of the kingdom\nshall be preached in all the world for a witness unto all nations.”\nMatthew 24:14. His kingdom will not come until the good tidings\nof His grace have been carried to all the earth. Hence, as we give [109]\nourselves to God, and win other souls to Him, we hasten the coming\nof His kingdom. Only those who devote themselves to His service,\nsaying, “Here am I; send me” (Isaiah 6:8), to open blind eyes, to turn\nmen “from darkness to light and from the power of Satan unto God,\n84 Thoughts from the Mount of Blessing\nthat they may receive forgiveness of sins and inheritance among them\nwhich are sanctified” (Acts 26:18)—they alone pray in sincerity,\n“Thy kingdom come.”\n“Thy will be done in earth, as it is in heaven.”—Matthew 6:10.\nThe will of God is expressed in the precepts of His holy law, and\nthe principles of this law are the principles of heaven. The angels\nof heaven attain unto no higher knowledge than to know the will of\nGod, and to do His will is the highest service that can engage their\npowers.\nBut in heaven, service is not rendered in the spirit of legality.\nWhen Satan rebelled against the law of Jehovah, the thought that\nthere was a law came to the angels almost as an awakening to\nsomething unthought of. In their ministry the angels are not as\nservants, but as sons. There is perfect unity between them and their\nCreator. Obedience is to them no drudgery. Love for God makes\ntheir service a joy. So in every soul wherein Christ, the hope of\nglory, dwells, His words are re-echoed, “I delight to do Thy will, O\nMy God: yea, Thy law is within My heart.” Psalm 40:8.\nThe petition, “Thy will be done in earth, as it is in heaven,”[110]\nis a prayer that the reign of evil on this earth may be ended, that\nsin may be forever destroyed, and the kingdom of righteousness be\nestablished. Then in earth as in heaven will be fulfilled “all the good\npleasure of His goodness.” 2 Thessalonians 1:11.\n“Give us this day our daily bread.”—Matthew 6:11.\nThe first half of the prayer Jesus has taught us is in regard to the\nname and kingdom and will of God—that His name may be honored,\nHis kingdom established, His will performed. When you have thus\nmade God’s service your first interest, you may ask with confidence\nthat your own needs may be supplied. If you have renounced self\nand given yourself to Christ you are a member of the family of God,\nand everything in the Father’s house is for you. All the treasures of\nGod are opened to you, both the world that now is and that which is\nto come. The ministry of angels, the gift of His Spirit, the labors of\nHis servants—all are for you. The world, with everything in it, is\nLord’s Prayer 85\nyours so far as it can do you good. Even the enmity of the wicked\nwill prove a blessing by disciplining you for heaven. If “ye are\nChrist’s,” “all things are yours.” 1 Corinthians 3:23, 21.\nBut you are as a child who is not yet placed in control of his\ninheritance. God does not entrust to you your precious possession,\nlest Satan by his wily arts should beguile you, as he did the first pair\nin Eden. Christ holds it for you, safe beyond the spoiler’s reach. [111]\nLike the child, you shall receive day by day what is required for the\nday’s need. Every day you are to pray, “Give us this day our daily\nbread.” Be not dismayed if you have not sufficient for tomorrow.\nYou have the assurance of His promise, “So shalt thou dwell in the\nland, and verily thou shalt be fed.” David says, “I have been young,\nand now am old; yet have I not seen the righteous forsaken, nor\nhis seed begging bread.” Psalm 37:3, 25. That God who sent the\nravens to feed Elijah by the brook Cherith will not pass by one of His\nfaithful, self-sacrificing children. Of him that walketh righteously\nit is written: “Bread shall be given him; his waters shall be sure.”\n“They shall not be ashamed in the evil time: and in the days of\nfamine they shall be satisfied.” “He that spared not His own Son, but\ndelivered Him up for us all, how shall He not with Him also freely\ngive us all things?” Isaiah 33:16; Psalm 37:19; Romans 8:32. He\nwho lightened the cares and anxieties of His widowed mother and\nhelped her to provide for the household at Nazareth, sympathizes\nwith every mother in her struggle to provide her children food. He\nwho had compassion on the multitude because they “fainted, and\nwere scattered abroad” (Matthew 9:36), still has compassion on the\nsuffering poor. His hand is stretched out toward them in blessing;\nand in the very prayer which He gave His disciples, He teaches us\nto remember the poor.\nWhen we pray, “Give us this day our daily bread,” we ask for\nothers as well as ourselves. And we acknowledge that what God\ngives us is not for ourselves alone. God gives to us in trust, that [112]\nwe may feed the hungry. Of His goodness He has prepared for the\npoor. Psalm 68:10. And He says, “When thou makest a dinner or a\nsupper, call not thy friends, nor thy brethren, neither thy kinsmen,\nnor thy rich neighbors.... But when thou makest a feast, call the\npoor, the maimed, the lame, the blind: and thou shalt be blessed; for\n86 Thoughts from the Mount of Blessing\nthey cannot recompense thee: for thou shalt be recompensed at the\nresurrection of the just.” Luke 14:12-14.\n“God is able to make all grace abound toward you; that ye,\nalways having all sufficiency in all things, may abound to every good\nwork.” “He which soweth sparingly shall reap also sparingly; and he\nwhich soweth bountifully shall reap also bountifully.” 2 Corinthians\n9:8, 6.\nThe prayer for daily bread includes not only food to sustain the\nbody, but that spiritual bread which will nourish the soul unto life\neverlasting. Jesus bids us, “Labor not for the meat which perisheth,\nbut for that meat which endureth unto everlasting life.” John 6:27. He\nsays, “I am the living bread which came down from heaven: if any\nman eat of this bread, he shall live forever.” Verse 51 . Our Saviour\nis the bread of life, and it is by beholding His love, by receiving it\ninto the soul, that we feed upon the bread which came down from\nheaven.\nWe receive Christ through His word, and the Holy Spirit is given\nto open the word of God to our understanding, and bring home its\ntruths to our hearts. We are to pray day by day that as we read His\nword, God will send His Spirit to reveal to us the truth that will[113]\nstrengthen our souls for the day’s need.\nIn teaching us to ask every day for what we need—both temporal\nand spiritual blessings—God has a purpose to accomplish for our\ngood. He would have us realize our dependence upon His constant\ncare, for He is seeking to draw us into communion with Himself.\nIn this communion with Christ, through prayer and the study of the\ngreat and precious truths of His word, we shall as hungry souls be\nfed; as those that thirst, we shall be refreshed at the fountain of life.\n“Forgive us our sins; for we also forgive everyone that is\nindebted to us.”—Luke 11:4.\nJesus teaches that we can receive forgiveness from God only as\nwe forgive others. It is the love of God that draws us unto Him,\nand that love cannot touch our hearts without creating love for our\nbrethren.\nAfter completing the Lord’s Prayer, Jesus added: “If ye forgive\nmen their trespasses, your heavenly Father will also forgive you: but\nLord’s Prayer 87\nif ye forgive not men their trespasses, neither will your Father forgive\nyour trespasses.” He who is unforgiving cuts off the very channel\nthrough which alone he can receive mercy from God. We should not\nthink that unless those who have injured us confess the wrong we are\njustified in withholding from them our forgiveness. It is their part, no\ndoubt, to humble their hearts by repentance and confession; but we\nare to have a spirit of compassion toward those who have trespassed [114]\nagainst us, whether or not they confess their faults. However sorely\nthey may have wounded us, we are not to cherish our grievances\nand sympathize with ourselves over our injuries; but as we hope to\nbe pardoned for our offenses against God we are to pardon all who\nhave done evil to us.\nBut forgiveness has a broader meaning than many suppose.\nWhen God gives the promise that He “will abundantly pardon,”\nHe adds, as if the meaning of that promise exceeded all that we\ncould comprehend: “My thoughts are not your thoughts, neither\nare your ways My ways, saith the Lord. For as the heavens are\nhigher than the earth, so are My ways higher than your ways, and\nMy thoughts than your thoughts.” Isaiah 55:7-9. God’s forgiveness\nis not merely a judicial act by which He sets us free from condem-\nnation. It is not only forgiveness for sin, but reclaiming from sin. It\nis the outflow of redeeming love that transforms the heart. David\nhad the true conception of forgiveness when he prayed, “Create in\nme a clean heart, O God; and renew a right spirit within me.” Psalm\n51:10. And again he says, “As far as the east is from the west, so far\nhath He removed our transgressions from us.” Psalm 103:12.\nGod in Christ gave Himself for our sins. He suffered the cruel\ndeath of the cross, bore for us the burden of guilt, “the just for the\nunjust,” that He might reveal to us His love and draw us to Himself.\nAnd He says, “Be ye kind one to another, tenderhearted, forgiving\neach other, even as God also in Christ forgave you.” Ephesians 4:32 ,\nR.V . Let Christ, the divine Life, dwell in you and through you reveal [115]\nthe heaven-born love that will inspire hope in the hopeless and bring\nheaven’s peace to the sin-stricken heart. As we come to God, this is\nthe condition which meets us at the threshold, that, receiving mercy\nfrom Him, we yield ourselves to reveal His grace to others.\nThe one thing essential for us in order that we may receive and\nimpart the forgiving love of God is to know and believe the love that\n88 Thoughts from the Mount of Blessing\nHe has to us. 1 John 4:16. Satan is working by every deception he\ncan command, in order that we may not discern that love. He will\nlead us to think that our mistakes and transgressions have been so\ngrievous that the Lord will not have respect unto our prayers and will\nnot bless and save us. In ourselves we can see nothing but weakness,\nnothing to recommend us to God, and Satan tells us that it is of no\nuse; we cannot remedy our defects of character. When we try to\ncome to God, the enemy will whisper, It is of no use for you to pray;\ndid not you do that evil thing? Have you not sinned against God\nand violated your own conscience? But we may tell the enemy that\n“the blood of Jesus Christ His Son cleanseth us from all sin.” 1 John\n1:7. When we feel that we have sinned and cannot pray, it is then\nthe time to pray. Ashamed we may be and deeply humbled, but we\nmust pray and believe. “This is a faithful saying, and worthy of all\nacceptation, that Christ Jesus came into the world to save sinners; of\nwhom I am chief.” 1 Timothy 1:15. Forgiveness, reconciliation with\nGod, comes to us, not as a reward for our works, it is not bestowed\nbecause of the merit of sinful men, but it is a gift unto us, having in[116]\nthe spotless righteousness of Christ its foundation for bestowal.\nWe should not try to lessen our guilt by excusing sin. We must\naccept God’s estimate of sin, and that is heavy indeed. Calvary alone\ncan reveal the terrible enormity of sin. If we had to bear our own\nguilt, it would crush us. But the sinless One has taken our place;\nthough undeserving, He has borne our iniquity. “If we confess our\nsins,” God “is faithful and just to forgive us our sins, and to cleanse\nus from all unrighteousness.” 1 John 1:9. Glorious truth!—just to\nHis own law, and yet the Justifier of all that believe in Jesus. “Who\nis a God like unto Thee, that pardoneth iniquity, and passeth by the\ntransgression of the remnant of His heritage? He retaineth not His\nanger forever, because He delighteth in mercy.” Micah 7:18.\n“Bring us not into temptation, but deliver us from the evil\none.”—Matthew 6:13, R. V .\nTemptation is enticement to sin, and this does not proceed from\nGod, but from Satan and from the evil of our own hearts. “God\ncannot be tempted with evil, and He Himself tempteth no man.”\nJames 1:13 , R.V .\nLord’s Prayer 89\nSatan seeks to bring us into temptation, that the evil of our\ncharacters may be revealed before men and angels, that he may claim\nus as his own. In the symbolic prophecy of Zechariah, Satan is seen\nstanding at the right hand of the Angel of the Lord, accusing Joshua, [117]\nthe high priest, who is clothed in filthy garments, and resisting the\nwork that the Angel desires to do for him. This represents the attitude\nof Satan toward every soul whom Christ is seeking to draw unto\nHimself. The enemy leads us into sin, and then he accuses us before\nthe heavenly universe as unworthy of the love of God. But “the Lord\nsaid unto Satan, The Lord rebuke thee, O Satan; even the Lord that\nhath chosen Jerusalem rebuke thee: is not this a brand plucked out\nof the fire?” And unto Joshua He said, “Behold, I have caused thine\niniquity to pass from thee, and I will clothe thee with change of\nraiment.” Zechariah 3:1-4.\nGod in His great love is seeking to develop in us the precious\ngraces of His Spirit. He permits us to encounter obstacles, persecu-\ntion, and hardships, not as a curse, but as the greatest blessing of our\nlives. Every temptation resisted, every trial bravely borne, gives us a\nnew experience and advances us in the work of character building.\nThe soul that through divine power resists temptation reveals to the\nworld and to the heavenly universe the efficiency of the grace of\nChrist.\nBut while we are not to be dismayed by trial, bitter though it\nbe, we should pray that God will not permit us to be brought where\nwe shall be drawn away by the desires of our own evil hearts. In\noffering the prayer that Christ has given, we surrender ourselves to\nthe guidance of God, asking Him to lead us in safe paths. We cannot\noffer this prayer in sincerity, and yet decide to walk in any way of\nour own choosing. We shall wait for His hand to lead us; we shall [118]\nlisten to His voice, saying, “This is the way, walk ye in it.” Isaiah\n30:21.\nIt is not safe for us to linger to contemplate the advantages to be\nreaped through yielding to Satan’s suggestions. Sin means dishonor\nand disaster to every soul that indulges in it; but it is blinding and\ndeceiving in its nature, and it will entice us with flattering presen-\ntations. If we venture on Satan’s ground we have no assurance of\nprotection from his power. So far as in us lies, we should close every\navenue by which the tempter may find access to us.\n90 Thoughts from the Mount of Blessing\nThe prayer, “Bring us not into temptation,” is itself a promise. If\nwe commit ourselves to God we have the assurance, He “will not\nsuffer you to be tempted above that ye are able; but will with the\ntemptation also make a way to escape, that ye may be able to bear\nit.” 1 Corinthians 10:13.\nThe only safeguard against evil is the indwelling of Christ in the\nheart through faith in His righteousness. It is because selfishness\nexists in our hearts that temptation has power over us. But when we\nbehold the great love of God, selfishness appears to us in its hideous\nand repulsive character, and we desire to have it expelled from the\nsoul. As the Holy Spirit glorifies Christ, our hearts are softened\nand subdued, the temptation loses its power, and the grace of Christ\ntransforms the character.\nChrist will never abandon the soul for whom He has died. The\nsoul may leave Him and be overwhelmed with temptation, but Christ\ncan never turn from one for whom He has paid the ransom of His\nown life. Could our spiritual vision be quickened, we should see[119]\nsouls bowed under oppression and burdened with grief, pressed as a\ncart beneath sheaves and ready to die in discouragement. We should\nsee angels flying swiftly to aid these tempted ones, who are standing\nas on the brink of a precipice. The angels from heaven force back\nthe hosts of evil that encompass these souls, and guide them to plant\ntheir feet on the sure foundation. The battles waging between the\ntwo armies are as real as those fought by the armies of this world,\nand on the issue of the spiritual conflict eternal destinies depend.\nTo us, as to Peter, the word is spoken, “Satan hath desired to\nhave you, that he may sift you as wheat: but I have prayed for thee,\nthat thy faith fail not.” Luke 22:31, 32. Thank God, we are not left\nalone. He who “so loved the world, that He gave His only-begotten\nSon, that whosoever believeth in Him should not perish, but have\neverlasting life” (John 3:16), will not desert us in the battle with the\nadversary of God and man. “Behold,” He says, “I give unto you\npower to tread on serpents and scorpions, and over all the power of\nthe enemy: and nothing shall by any means hurt you.” Luke 10:19.\nLive in contact with the living Christ, and He will hold you firmly\nby a hand that will never let go. Know and believe the love that God\nhas to us, and you are secure; that love is a fortress impregnable to\nall the delusions and assaults of Satan. “The name of the Lord is a\nLord’s Prayer 91\nstrong tower: the righteous runneth into it, and is safe.” Proverbs\n18:10.\n“Thine is the kingdom, and the power, and the [120]\nglory.”—Matthew 6:13.\nThe last like the first sentence of the Lord’s Prayer, points to\nour Father as above all power and authority and every name that is\nnamed. The Saviour beheld the years that stretched out before His\ndisciples, not, as they had dreamed, lying in the sunshine of worldly\nprosperity and honor, but dark with the tempests of human hatred\nand satanic wrath. Amid national strife and ruin, the steps of the\ndisciples would be beset with perils, and often their hearts would\nbe oppressed by fear. They were to see Jerusalem a desolation, the\ntemple swept away, its worship forever ended, and Israel scattered\nto all lands, like wrecks on a desert shore. Jesus said, “Ye shall\nhear of wars and rumors of wars.” “Nation shall rise against nation,\nand kingdom against kingdom: and there shall be famines, and\npestilences, and earthquakes, in divers places. All these are the\nbeginning of sorrows.” Matthew 24:6-8. Yet Christ’s followers were\nnot to fear that their hope was lost or that God had forsaken the earth.\nThe power and the glory belong unto Him whose great purposes\nwould still move on unthwarted toward their consummation. In the\nprayer that breathes their daily wants, the disciples of Christ were\ndirected to look above all the power and dominion of evil, unto the\nLord their God, whose kingdom ruleth over all and who is their\nFather and everlasting Friend.\nThe ruin of Jerusalem was a symbol of the final ruin that shall\noverwhelm the world. The prophecies that received a partial fulfill-\nment in the overthrow of Jerusalem have a more direct application [121]\nto the last days. We are now standing on the threshold of great and\nsolemn events. A crisis is before us, such as the world has never\nwitnessed. And sweetly to us, as to the first disciples, comes the\nassurance that God’s kingdom ruleth over all. The program of com-\ning events is in the hands of our Maker. The Majesty of heaven has\nthe destiny of nations, as well as the concerns of His church, in His\nown charge. The divine Instructor is saying to every agent in the\n92 Thoughts from the Mount of Blessing\naccomplishment of His plans, as He said to Cyrus, “I girded thee,\nthough thou hast not known Me.” Isaiah 45:5.\nIn the vision of the prophet Ezekiel there was the appearance\nof a hand beneath the wings of the cherubim. This is to teach His\nservants that it is divine power which gives them success. Those\nwhom God employs as His messengers are not to feel that His work\nis dependent upon them. Finite beings are not left to carry this\nburden of responsibility. He who slumbers not, who is continually\nat work for the accomplishment of His designs, will carry forward\nHis own work. He will thwart the purposes of wicked men, and will\nbring to confusion the counsels of those who plot mischief against\nHis people. He who is the King, the Lord of hosts, sitteth between\nthe cherubim, and amid the strife and tumult of nations He guards\nHis children still. He who ruleth in the heavens is our Saviour. He\nmeasures every trial, He watches the furnace fire that must test every\nsoul. When the strongholds of kings shall be overthrown, when the\narrows of wrath shall strike through the hearts of His enemies, His\npeople will be safe in His hands.\n“Thine, O Lord, is the greatness, and the power, and the glory,[122]\nand the victory, and the majesty: for all that is in the heaven and in\nthe earth is Thine.... In Thine hand is power and might; and in Thine\nhand it is to make great, and to give strength unto all.” 1 Chronicles\n29:11, 12.\nChapter 6—Not Judging, but Doing [123]\n“Judge not, that ye be not judged.”—Matthew 7:1.\nThe effort to earn salvation by one’s own works inevitably leads\nmen to pile up human exactions as a barrier against sin. For, seeing\nthat they fail to keep the law, they will devise rules and regulations\nof their own to force themselves to obey. All this turns the mind\naway from God to self. His love dies out of the heart, and with it\nperishes love for his fellow men. A system of human invention, with\nits multitudinous exactions, will lead its advocates to judge all who\ncome short of the prescribed human standard. The atmosphere of\nselfish and narrow criticism stifles the noble and generous emotions,\nand causes men to become self-centered judges and petty spies.\nThe Pharisees were of this class. They came forth from their\nreligious services, not humbled with a sense of their own weakness,\nnot grateful for the great privileges that God had given them. They\ncame forth filled with spiritual pride, and their theme was, “My-\nself, my feelings, my knowledge, my ways.” Their own attainments\nbecame the standard by which they judged others. Putting on the\nrobes of self-dignity, they mounted the judgment seat to criticize\nand condemn.\nThe people partook largely of the same spirit, intruding upon\nthe province of conscience and judging one another in matters that [124]\nlay between the soul and God. It was in reference to this spirit and\npractice that Jesus said, “Judge not, that ye be not judged.” That is,\ndo not set yourself up as a standard. Do not make your opinions,\nyour views of duty, your interpretations of Scripture, a criterion for\nothers and in your heart condemn them if they do not come up to\nyour ideal. Do not criticize others, conjecturing as to their motives\nand passing judgment upon them.\n“Judge nothing before the time, until the Lord come, who both\nwill bring to light the hidden things of darkness, and will make man-\nifest the counsels of the hearts.” 1 Corinthians 4:5. We cannot read\n93\n94 Thoughts from the Mount of Blessing\nthe heart. Ourselves faulty, we are not qualified to sit in judgment\nupon others. Finite men can judge only from outward appearance.\nTo Him alone who knows the secret springs of action, and who deals\ntenderly and compassionately, is it given to decide the case of every\nsoul.\n“Thou art inexcusable, O man, whosoever thou art that judgest:\nfor wherein thou judgest another, thou condemnest thyself; for thou\nthat judgest doest the same things.” Romans 2:1. Thus those who\ncondemn or criticize others, proclaim themselves guilty, for they do\nthe same things. In condemning others, they are passing sentence\nupon themselves, and God declares that this sentence is just. He\naccepts their own verdict against themselves.\n“These clumsy feet, still in the mire,\nGo crushing blossoms without end;\nThese hard, well-meaning hands we thrust\nAmong the heartstrings of a friend.”\n“Why beholdest thou the mote that is in thy brother’s[125]\neye?”—Matthew 7:3.\nEven the sentence, “Thou that judgest doest the same things,”\ndoes not reach the magnitude of his sin who presumes to criticize\nand condemn his brother. Jesus said, “Why beholdest thou the mote\nthat is in thy brother’s eye, but considerest not the beam that is in\nthine own eye?”\nHis words describe one who is swift to discern a defect in others.\nWhen he thinks he has detected a flaw in the character or the life he\nis exceedingly zealous in trying to point it out; but Jesus declares that\nthe very trait of character developed in doing this un-Christlike work,\nis, in comparison with the fault criticized, as a beam in proportion\nto a mote. It is one’s own lack of the spirit of forbearance and love\nthat leads him to make a world of an atom. Those who have never\nexperienced the contrition of an entire surrender to Christ do not\nin their life make manifest the softening influence of the Saviour’s\nlove. They misrepresent the gentle, courteous spirit of the gospel\nand wound precious souls, for whom Christ died. According to the\nfigure that our Saviour uses, he who indulges a censorious spirit\nNot Judging, but Doing 95\nis guilty of greater sin than is the one he accuses, for he not only\ncommits the same sin, but adds to it conceit and censoriousness.\nChrist is the only true standard of character, and he who sets\nhimself up as a standard for others is putting himself in the place of\nChrist. And since the Father “hath committed all judgment unto the\nSon” (John 5:22), whoever presumes to judge the motives of others [126]\nis again usurping the prerogative of the Son of God. These would-be\njudges and critics are placing themselves on the side of antichrist,\n“who opposeth and exalteth himself above all that is called God, or\nthat is worshiped; so that he as God sitteth in the temple of God,\nshowing himself that he is God.” 2 Thessalonians 2:4.\nThe sin that leads to the most unhappy results is the cold, critical,\nunforgiving spirit that characterizes Pharisaism. When the religious\nexperience is devoid of love, Jesus is not there; the sunshine of\nHis presence is not there. No busy activity or Christless zeal can\nsupply the lack. There may be a wonderful keenness of perception\nto discover the defects of others; but to everyone who indulges this\nspirit, Jesus says, “Thou hypocrite, first cast out the beam out of\nthine own eye; and then shalt thou see clearly to cast out the mote\nout of thy brother’s eye.” He who is guilty of wrong is the first to\nsuspect wrong. By condemning another he is trying to conceal or\nexcuse the evil of his own heart. It was through sin that men gained\nthe knowledge of evil; no sooner had the first pair sinned than they\nbegan to accuse each other; and this is what human nature will\ninevitably do when uncontrolled by the grace of Christ.\nWhen men indulge this accusing spirit, they are not satisfied\nwith pointing out what they suppose to be a defect in their brother.\nIf milder means fail of making him do what they think ought to\nbe done, they will resort to compulsion. Just as far as lies in their\npower they will force men to comply with their ideas of what is\nright. This is what the Jews did in the days of Christ and what the [127]\nchurch has done ever since whenever she has lost the grace of Christ.\nFinding herself destitute of the power of love, she has reached out\nfor the strong arm of the state to enforce her dogmas and execute\nher decrees. Here is the secret of all religious laws that have ever\nbeen enacted, and the secret of all persecution from the days of Abel\nto our own time.\n96 Thoughts from the Mount of Blessing\nChrist does not drive but draws men unto Him. The only compul-\nsion which He employs is the constraint of love. When the church\nbegins to seek for the support of secular power, it is evident that she\nis devoid of the power of Christ—the constraint of divine love.\nBut the difficulty lies with the individual members of the church,\nand it is here that the cure must be wrought. Jesus bids the accuser\nfirst cast the beam out of his own eye, renounce his censorious spirit,\nconfess and forsake his own sin, before trying to correct others. For\n“a good tree bringeth not forth corrupt fruit; neither doth a corrupt\ntree bring forth good fruit.” Luke 6:43. This accusing spirit which\nyou indulge is evil fruit, and shows that the tree is evil. It is useless\nfor you to build yourselves up in self-righteousness. What you need\nis a change of heart. You must have this experience before you are\nfitted to correct others; for “out of the abundance of the heart the\nmouth speaketh.” Matthew 12:34.\nWhen a crisis comes in the life of any soul, and you attempt to\ngive counsel or admonition, your words will have only the weight of\ninfluence for good that your own example and spirit have gained for\nyou. You must be good before you can do good. You cannot exert[128]\nan influence that will transform others until your own heart has been\nhumbled and refined and made tender by the grace of Christ. When\nthis change has been wrought in you, it will be as natural for you\nto live to bless others as it is for the rosebush to yield its fragrant\nbloom or the vine its purple clusters.\nIf Christ is in you “the hope of glory,” you will have no dispo-\nsition to watch others, to expose their errors. Instead of seeking to\naccuse and condemn, it will be your object to help, to bless, and\nto save. In dealing with those who are in error, you will heed the\ninjunction, Consider “thyself, lest thou also be tempted.” Galatians\n6:1. You will call to mind the many times you have erred and how\nhard it was to find the right way when you had once left it. You will\nnot push your brother into greater darkness, but with a heart full of\npity will tell him of his danger.\nHe who looks often upon the cross of Calvary, remembering\nthat his sins placed the Saviour there, will never try to estimate the\ndegree of his guilt in comparison with that of others. He will not\nclimb upon the judgment seat to bring accusation against another.\nNot Judging, but Doing 97\nThere can be no spirit of criticism or self-exaltation on the part of\nthose who walk in the shadow of Calvary’s cross.\nNot until you feel that you could sacrifice your own self-dignity,\nand even lay down your life in order to save an erring brother, have\nyou cast the beam out of your own eye so that you are prepared to\nhelp your brother. Then you can approach him and touch his heart. [129]\nNo one has ever been reclaimed from a wrong position by censure\nand reproach; but many have thus been driven from Christ and led to\nseal their hearts against conviction. A tender spirit, a gentle, winning\ndeportment, may save the erring and hide a multitude of sins. The\nrevelation of Christ in your own character will have a transforming\npower upon all with whom you come in contact. Let Christ be daily\nmade manifest in you, and He will reveal through you the creative\nenergy of His word—a gentle, persuasive, yet mighty influence to\nre-create other souls in the beauty of the Lord our God.\n“Give not that which is holy unto the dogs.”—Matthew 7:6.\nJesus here refers to a class who have no desire to escape from\nthe slavery of sin. By indulgence in the corrupt and vile their natures\nhave become so degraded that they cling to the evil and will not be\nseparated from it. The servants of Christ should not allow themselves\nto be hindered by those who would make the gospel only a matter\nof contention and ridicule.\nBut the Saviour never passed by one soul, however sunken in\nsin, who was willing to receive the precious truths of heaven. To\npublicans and harlots His words were the beginning of a new life.\nMary Magdalene, out of whom He cast seven devils, was the last at\nthe Saviour’s tomb and the first whom He greeted in the morning of\nHis resurrection. It was Saul of Tarsus, one of the most determined [130]\nenemies of the gospel, who became Paul the devoted minister of\nChrist. Beneath an appearance of hatred and contempt, even beneath\ncrime and degradation, may be hidden a soul that the grace of Christ\nwill rescue to shine as a jewel in the Redeemer’s crown.\n98 Thoughts from the Mount of Blessing\n“Ask, and it shall be given you; seek, and ye shall find; knock,\nand it shall be opened unto you.”—Matthew 7:7.\nTo leave no chance for unbelief, misunderstanding, or misinter-\npretation of His words, the Lord repeats the thrice-given promise.\nHe longs to have those who would seek after God believe in Him\nwho is able to do all things. Therefore He adds, “For everyone\nthat asketh receiveth; and he that seeketh findeth; and to him that\nknocketh it shall be opened.”\nThe Lord specifies no conditions except that you hunger for His\nmercy, desire His counsel, and long for His love. “Ask.” The asking,\nmakes it manifest that you realize your necessity; and if you ask in\nfaith you will receive. The Lord has pledged His word, and it cannot\nfail. If you come with true contrition you need not feel that you are\npresumptuous in asking for what the Lord has promised. When you\nask for the blessings you need, that you may perfect a character after\nChrist’s likeness, the Lord assures you that you are asking according\nto a promise that will be verified. That you feel and know you are a\nsinner is sufficient ground for asking for His mercy and compassion.[131]\nThe condition upon which you may come to God is not that you\nshall be holy, but that you desire Him to cleanse you from all sin\nand purify you from all iniquity. The argument that we may plead\nnow and ever is our great need, our utterly helpless state, that makes\nHim and His redeeming power a necessity.\n“Seek.” Desire not merely His blessing, but Himself. “Acquaint\nnow thyself with Him, and be at peace.” Job 22:21. Seek, and you\nshall find. God is seeking you, and the very desire you feel to come\nto Him is but the drawing of His Spirit. Yield to that drawing. Christ\nis pleading the cause of the tempted, the erring, and the faithless. He\nis seeking to lift them into companionship with Himself. “If thou\nseek Him, He will be found of thee.” 1 Chronicles 28:9.\n“Knock.” We come to God by special invitation, and He waits\nto welcome us to His audience chamber. The first disciples who\nfollowed Jesus were not satisfied with a hurried conversation with\nHim by the way; they said, “Rabbi, ... where dwellest Thou? ...\nThey came and saw where He dwelt, and abode with Him that day.”\nJohn 1:38, 39. So we may be admitted into closest intimacy and\ncommunion with God. “He that dwelleth in the secret place of the\nNot Judging, but Doing 99\nMost High shall abide under the shadow of the Almighty.” Psalm\n91:1. Let those who desire the blessing of God knock and wait at the\ndoor of mercy with firm assurance, saying, For Thou, O Lord, hast\nsaid, “Everyone that asketh receiveth; and he that seeketh findeth;\nand to him that knocketh it shall be opened.”\nJesus looked upon those who were assembled to hear His words,\nand earnestly desired that the great multitude might appreciate the [132]\nmercy and loving-kindness of God. As an illustration of their need,\nand of God’s willingness to give, He presents before them a hungry\nchild asking his earthly parent for bread. “What man is there ofyou,”\nHe said, “whom if his son ask bread, will he give him a stone?” He\nappeals to the tender, natural affection of a parent for his child and\nthen says, “If ye then, being evil, know how to give good gifts unto\nyour children, how much more shall your Father which is in heaven\ngive good things to them that ask Him?” No man with a father’s\nheart would turn from his son who is hungry and is asking for bread.\nWould they think him capable of trifling with his child, of tantalizing\nhim by raising his expectations only to disappoint him? Would he\npromise to give him good and nourishing food, and then give him\na stone? And should anyone dishonor God by imagining that He\nwould not respond to the appeals of His children?\nIf ye, then, being human and evil, “know how to give good gifts\nunto your children: how much more shall your heavenly Father\ngive the Holy Spirit to them that ask Him?” Luke 11:13. The Holy\nSpirit, the representative of Himself, is the greatest of all gifts. All\n“good things” are comprised in this. The Creator Himself can give\nus nothing greater, nothing better. When we beseech the Lord to\npity us in our distress, and to guide us by His Holy Spirit, He will\nnever turn away our prayer. It is possible even for a parent to turn\naway from his hungry child, but God can never reject the cry of the\nneedy and longing heart. With what wonderful tenderness He has\ndescribed His love! To those who in days of darkness feel that God [133]\nis unmindful of them, this is the message from the Father’s heart:\n“Zion said, The Lord hath forsaken me, and my Lord hath forgotten\nme. Can a woman forget her sucking child, that she should not have\ncompassion on the son of her womb? Yea, they may forget, yet will\nI not forget thee. Behold, I have graven thee upon the palms of My\nhands.” Isaiah 49:14-16.\n100 Thoughts from the Mount of Blessing\nEvery promise in the word of God furnishes us with subject\nmatter for prayer, presenting the pledged word of Jehovah as our\nassurance. Whatever spiritual blessing we need, it is our privilege to\nclaim through Jesus. We may tell the Lord, with the simplicity of\na child, exactly what we need. We may state to Him our temporal\nmatters, asking Him for bread and raiment as well as for the bread\nof life and the robe of Christ’s righteousness. Your heavenly Father\nknows that you have need of all these things, and you are invited to\nask Him concerning them. It is through the name of Jesus that every\nfavor is received. God will honor that name, and will supply your\nnecessities from the riches of His liberality.\nBut do not forget that in coming to God as a father you ac-\nknowledge your relation to Him as a child. You not only trust His\ngoodness, but in all things yield to His will, knowing that His love is\nchangeless. You give yourself to do His work. It was to those whom\nHe had bidden to seek first the kingdom of God and His righteous-\nness that Jesus gave the promise, “Ask, and ye shall receive.” John\n16:24.\nThe gifts of Him who has all power in heaven and earth are in\nstore for the children of God. Gifts so precious that they come to[134]\nus through the costly sacrifice of the Redeemer’s blood; gifts that\nwill satisfy the deepest craving of the heart, gifts lasting as eternity,\nwill be received and enjoyed by all who will come to God as little\nchildren. Take God’s promises as your own, plead them before Him\nas His own words, and you will receive fullness of joy.\n“Therefore all things whatsoever ye would that men should do\nto you, do ye even so to them.”—Matthew 7:12.\nOn the assurance of the love of God toward us, Jesus enjoins\nlove to one another, in one comprehensive principle covering all the\nrelations of human fellowship.\nThe Jews had been concerned about what they should receive;\nthe burden of their anxiety was to secure what they thought their\ndue of power and respect and service. But Christ teaches that our\nanxiety should not be, How much are we to receive? but, How much\ncan we give? The standard of our obligation to others is found in\nwhat we ourselves would regard as their obligation to us.\nNot Judging, but Doing 101\nIn your association with others, put yourself in their place. Enter\ninto their feelings, their difficulties, their disappointments, their\njoys, and their sorrows. Identify yourself with them, and then do\nto them as, were you to exchange places with them, you would\nwish them to deal with you. This is the true rule of honesty. It is\nanother expression of the law. “Thou shalt love thy neighbor as [135]\nthyself.” Matthew 22:39. And it is the substance of the teaching of\nthe prophets. It is a principle of heaven, and will be developed in all\nwho are fitted for its holy companionship.\nThe golden rule is the principle of true courtesy, and its truest\nillustration is seen in the life and character of Jesus. Oh, what rays\nof softness and beauty shone forth in the daily life of our Saviour!\nWhat sweetness flowed from His very presence! The same spirit will\nbe revealed in His children. Those with whom Christ dwells will be\nsurrounded with a divine atmosphere. Their white robes of purity\nwill be fragrant with perfume from the garden of the Lord. Their\nfaces will reflect light from His, brightening the path for stumbling\nand weary feet.\nNo man who has the true ideal of what constitutes a perfect\ncharacter will fail to manifest the sympathy and tenderness of Christ.\nThe influence of grace is to soften the heart, to refine and purify the\nfeelings, giving a heaven-born delicacy and sense of propriety.\nBut there is a yet deeper significance to the golden rule. Everyone\nwho has been made a steward of the manifold grace of God is called\nupon to impart to souls in ignorance and darkness, even as, were he\nin their place, he would desire them to impart to him. The apostle\nPaul said, “I am debtor both to the Greeks, and to the barbarians;\nboth to the wise, and to the unwise.” Romans 1:14. By all that you\nhave known of the love of God, by all that you have received of the\nrich gifts of His grace above the most benighted and degraded soul\nupon the earth are you in debt to that soul to impart these gifts unto\nhim.\nSo also with the gifts and blessings of this life: whatever you may [136]\npossess above your fellows places you in debt, to that degree, to all\nwho are less favored. Have we wealth, or even the comforts of life,\nthen we are under the most solemn obligation to care for the suffering\nsick, the widow, and the fatherless exactly as we would desire them\nto care for us were our condition and theirs to be reversed.\n102 Thoughts from the Mount of Blessing\nThe golden rule teaches, by implication, the same truth which\nis taught elsewhere in the Sermon on the Mount, that “with what\nmeasure ye mete, it shall be measured to you again.” That which\nwe do to others, whether it be good or evil, will surely react upon\nourselves, in blessing or in cursing. Whatever we give, we shall\nreceive again. The earthly blessings which we impart to others may\nbe, and often are, repaid in kind. What we give does, in time of need,\noften come back to us in fourfold measure in the coin of the realm.\nBut, besides this, all gifts are repaid, even in this life, in the fuller\ninflowing of His love, which is the sum of all heaven’s glory and its\ntreasure. And evil imparted also returns again. Everyone who has\nbeen free to condemn or discourage, will in his own experience be\nbrought over the ground where he has caused others to pass; he will\nfeel what they have suffered because of his want of sympathy and\ntenderness.\nIt is the love of God toward us that has decreed this. He would\nlead us to abhor our own hardness of heart and to open our hearts to\nlet Jesus abide in them. And thus, out of evil, good is brought, and\nwhat appeared a curse becomes a blessing.\nThe standard of the golden rule is the true standard of Christian-[137]\nity; anything short of it is a deception. A religion that leads men to\nplace a low estimate upon human beings, whom Christ has esteemed\nof such value as to give Himself for them; a religion that would lead\nus to be careless of human needs, sufferings, or rights, is a spurious\nreligion. In slighting the claims of the poor, the suffering, and the\nsinful, we are proving ourselves traitors to Christ. It is because men\ntake upon themselves the name of Christ, while in life they deny\nHis character, that Christianity has so little power in the world. The\nname of the Lord is blasphemed because of these things.\nOf the apostolic church, in those bright days when the glory of\nthe risen Christ shone upon them, it is written that no man said “that\naught of the things which he possessed was his own.” “Neither was\nthere any among them that lacked.” “And with great power gave\nthe apostles witness of the resurrection of the Lord Jesus: and great\ngrace was upon them all.” “And they, continuing daily with one\naccord in the temple, and breaking bread from house to house, did\neat their meat with gladness and singleness of heart, praising God,\nNot Judging, but Doing 103\nand having favor with all the people. And the Lord added to the\nchurch daily such as should be saved.” Acts 4:32, 34, 33; 2:46, 47.\nSearch heaven and earth, and there is no truth revealed more\npowerful than that which is made manifest in works of mercy to\nthose who need our sympathy and aid. This is the truth as it is in\nJesus. When those who profess the name of Christ shall practice the\nprinciples of the golden rule, the same power will attend the gospel\nas in apostolic times.\n“Strait is the gate, and narrow is the way, which leadeth unto [138]\nlife.”—Matthew 7:14.\nIn the time of Christ the people of Palestine lived in walled\ntowns, which were mostly situated upon hills or mountains. The\ngates, which were closed at sunset, were approached by steep, rocky\nroads, and the traveler journeying homeward at the close of the day\noften had to press his way in eager haste up the difficult ascent in\norder to reach the gate before nightfall. The loiterer was left without.\nThe narrow, upward road leading to home and rest furnished\nJesus with an impressive figure of the Christian way. The path which\nI have set before you, He said, is narrow; the gate is difficult of\nentrance; for the golden rule excludes all pride and self-seeking.\nThere is, indeed, a wider road; but its end is destruction. If you\nwould climb the path of spiritual life, you must constantly ascend;\nfor it is an upward way. You must go with the few; for the multitude\nwill choose the downward path.\nIn the road to death the whole race may go, with all their world-\nliness, all their selfishness, all their pride, dishonesty, and moral\ndebasement. There is room for every man’s opinions and doctrines,\nspace to follow his inclinations, to do whatever his self-love may\ndictate. In order to go in the path that leads to destruction, there is\nno need of searching for the way; for the gate is wide, and the way\nis broad, and the feet naturally turn into the path that ends in death.\nBut the way to life is narrow and the entrance strait. If you cling [139]\nto any besetting sin you will find the way too narrow for you to enter.\nYour own ways, your own will, your evil habits and practices, must\nbe given up if you would keep the way of the Lord. He who would\nserve Christ cannot follow the world’s opinions or meet the world’s\n104 Thoughts from the Mount of Blessing\nstandard. Heaven’s path is too narrow for rank and riches to ride in\nstate, too narrow for the play of self-centered ambition, too steep\nand rugged for lovers of ease to climb. Toil, patience, self-sacrifice,\nreproach, poverty, the contradiction of sinners against Himself, was\nthe portion of Christ, and it must be our portion, if we ever enter the\nParadise of God.\nYet do not therefore conclude that the upward path is the hard\nand the downward road the easy way. All along the road that leads to\ndeath there are pains and penalties, there are sorrows and disappoint-\nments, there are warnings not to go on. God’s love has made it hard\nfor the heedless and headstrong to destroy themselves. It is true that\nSatan’s path is made to appear attractive, but it is all a deception; in\nthe way of evil there are bitter remorse and cankering care. We may\nthink it pleasant to follow pride and worldly ambition, but the end is\npain and sorrow. Selfish plans may present flattering promises and\nhold out the hope of enjoyment, but we shall find that our happiness\nis poisoned and our life embittered by hopes that center in self. In the\ndownward road the gateway may be bright with flowers, but thorns\nare in the path. The light of hope which shines from its entrance\nfades into the darkness of despair, and the soul who follows that path\ndescends into the shadows of unending night.\n“The way of transgressors is hard,” but wisdom’s “ways are ways[140]\nof pleasantness and all her paths are peace.” Proverbs 13:15; 3:17.\nEvery act of obedience to Christ, every act of self-denial for His\nsake, every trial well endured, every victory gained over temptation,\nis a step in the march to the glory of final victory. If we take Christ\nfor our guide, He will lead us safely. The veriest sinner need not\nmiss his way. Not one trembling seeker need fail of walking in pure\nand holy light. Though the path is so narrow, so holy that sin cannot\nbe tolerated therein, yet access has been secured for all, and not one\ndoubting, trembling soul need say, “God cares nought for me.”\nThe road may be rough and the ascent steep; there may be pitfalls\nupon the right hand and upon the left; we may have to endure toil in\nour journey; when weary, when longing for rest, we may have to toil\non; when faint, we may have to fight; when discouraged, we must\nstill hope; but with Christ as our guide we shall not fail of reaching\nthe desired haven at last. Christ Himself has trodden the rough way\nbefore us and has smoothed the path for our feet.\nNot Judging, but Doing 105\nAnd all the way up the steep road leading to eternal life are well-\nsprings of joy to refresh the weary. Those who walk in wisdom’s\nways are, even in tribulation, exceeding joyful; for He whom their\nsoul loveth, walks, invisible, beside them. At each upward step they\ndiscern more distinctly the touch of His hand; at every step brighter\ngleamings of glory from the Unseen fall upon their path; and their\nsongs of praise, reaching ever a higher note, ascend to join the songs\nof angels before the throne. “The path of the righteous is as the light [141]\nof dawn, that shineth more and more unto the perfect day.” Proverbs\n4:18 , R.V ., margin.\n“Strive to enter in at the strait gate.”—Luke 13:24.\nThe belated traveler, hurrying to reach the city gate by the going\ndown of the sun, could not turn aside for any attractions by the way.\nHis whole mind was bent on the one purpose of entering the gate.\nThe same intensity of purpose, said Jesus, is required in the Christian\nlife. I have opened to you the glory of character, which is the true\nglory of My kingdom. It offers you no promise of earthly dominion;\nyet it is worthy of your supreme desire and effort. I do not call you\nto battle for the supremacy of the world’s great empire, but do not\ntherefore conclude that there is no battle to be fought nor victories to\nbe won. I bid you strive, agonize, to enter into My spiritual kingdom.\nThe Christian life is a battle and a march. But the victory to\nbe gained is not won by human power. The field of conflict is the\ndomain of the heart. The battle which we have to fight—the greatest\nbattle that was ever fought by man—is the surrender of self to the\nwill of God, the yielding of the heart to the sovereignty of love. The\nold nature, born of blood and of the will of the flesh, cannot inherit\nthe kingdom of God. The hereditary tendencies, the former habits,\nmust be given up.\nHe who determines to enter the spiritual kingdom will find that [142]\nall the powers and passions of an unregenerate nature, backed by\nthe forces of the kingdom of darkness, are arrayed against him.\nSelfishness and pride will make a stand against anything that would\nshow them to be sinful. We cannot, of ourselves, conquer the evil\ndesires and habits that strive for the mastery. We cannot overcome\nthe mighty foe who holds us in his thrall. God alone can give us\n106 Thoughts from the Mount of Blessing\nthe victory. He desires us to have the mastery over ourselves, our\nown will and ways. But He cannot work in us without our consent\nand co-operation. The divine Spirit works through the faculties and\npowers given to man. Our energies are required to co-operate with\nGod.\nThe victory is not won without much earnest prayer, without\nthe humbling of self at every step. Our will is not to be forced\ninto co-operation with divine agencies, but it must be voluntarily\nsubmitted. Were it possible to force upon you with a hundredfold\ngreater intensity the influence of the Spirit of God, it would not\nmake you a Christian, a fit subject for heaven. The stronghold of\nSatan would not be broken. The will must be placed on the side of\nGod’s will. You are not able, of yourself, to bring your purposes\nand desires and inclinations into submission to the will of God; but\nif you are “willing to be made willing,” God will accomplish the\nwork for you, even “casting down imaginations, and every high thing\nthat exalteth itself against the knowledge of God, and bringing into\ncaptivity every thought to the obedience of Christ.” 2 Corinthians\n10:5. Then you will “work out your own salvation with fear and\ntrembling. For it is God which worketh in you both to will and to do[143]\nof His good pleasure.” Philippians 2:12, 13.\nBut many are attracted by the beauty of Christ and the glory of\nheaven, who yet shrink from the conditions by which alone these\ncan become their own. There are many in the broad way who are\nnot fully satisfied with the path in which they walk. They long to\nbreak from the slavery of sin, and in their own strength they seek\nto make a stand against their sinful practices. They look toward\nthe narrow way and the strait gate; but selfish pleasure, love of the\nworld, pride, unsanctified ambition, place a barrier between them\nand the Saviour. To renounce their own will, their chosen objects of\naffection or pursuit, requires a sacrifice at which they hesitate and\nfalter and turn back. Many “will seek to enter in, and shall not be\nable.” Luke 13:24. They desire the good, they make some effort to\nobtain it; but they do not choose it; they have not a settled purpose\nto secure it at the cost of all things.\nThe only hope for us if we would overcome is to unite our will to\nGod’s will and work in co-operation with Him, hour by hour and day\nby day. We cannot retain self and yet enter the kingdom of God. If we\nNot Judging, but Doing 107\never attain unto holiness, it will be through the renunciation of self\nand the reception of the mind of Christ. Pride and self-sufficiency\nmust be crucified. Are we willing to pay the price required of us?\nAre we willing to have our will brought into perfect conformity to\nthe will of God? Until we are willing, the transforming grace of God\ncannot be manifest upon us.\nThe warfare which we are to wage is the “good fight of faith.” “I [144]\nalso labor,” said the apostle Paul, “striving according to His working,\nwhich worketh in me mightily.” Colossians 1:29.\nJacob, in the great crisis of his life, turned aside to pray. He was\nfilled with one overmastering purpose—to seek for transformation\nof character. But while he was pleading with God, an enemy, as\nhe supposed, placed his hand upon him, and all night he wrestled\nfor his life. But the purpose of his soul was not changed by peril of\nlife itself. When his strength was nearly spent, the Angel put forth\nHis divine power, and at His touch Jacob knew Him with whom\nhe had been contending. Wounded and helpless, he fell upon the\nSaviour’s breast, pleading for a blessing. He would not be turned\naside nor cease his intercession, and Christ granted the petition of\nthis helpless, penitent soul, according to His promise, “Let him take\nhold of My strength, that he may make peace with Me; and he shall\nmake peace with Me.” Isaiah 27:5. Jacob pleaded with determined\nspirit, “I will not let Thee go, except Thou bless me.” Genesis 32:26.\nThis spirit of persistence was inspired by Him who wrestled with\nthe patriarch. It was He who gave him the victory, and He changed\nhis name from Jacob to Israel, saying, “As a prince hast thou power\nwith God and with men, and hast prevailed.” Genesis 32:28. That\nfor which Jacob had vainly wrestled in his own strength was won\nthrough self-surrender and steadfast faith. “This is the victory that\novercometh the world, even our faith.” 1 John 5:4.\n“Beware of false prophets.”—Matthew 7:15. [145]\nTeachers of falsehood will arise to draw you away from the\nnarrow path and the strait gate. Beware of them; though concealed\nin sheep’s clothing, inwardly they are ravening wolves. Jesus gives a\ntest by which false teachers may be distinguished from the true. “Ye\n108 Thoughts from the Mount of Blessing\nshall know them by their fruits,” He says. “Do men gather grapes of\nthorns, or figs of thistles?”\nWe are not bidden to prove them by their fair speeches and\nexalted professions. They are to be judged by the word of God. “To\nthe law and to the testimony: if they speak not according to this\nword it is because there is no light in them.” “Cease, my son, to hear\nthe instruction that causeth to err from the words of knowledge.”\nIsaiah 8:20; Proverbs 19:27. What message do these teachers bring?\nDoes it lead you to reverence and fear God? Does it lead you to\nmanifest your love for Him by loyalty to His commandments? If\nmen do not feel the weight of the moral law; if they make light of\nGod’s precepts; if they break one of the least of His commandments,\nand teach men so, they shall be of no esteem in the sight of heaven.\nWe may know that their claims are without foundation. They are\ndoing the very work that originated with the prince of darkness, the\nenemy of God.\nNot all who profess His name and wear His badge are Christ’s.\nMany who have taught in My name, said Jesus, will be found want-\ning at last. “Many will say to Me in that day, Lord, Lord, have we\nnot prophesied in Thy name? and in Thy name have cast out devils?\nand in Thy name done many wonderful works? And then will I[146]\nprofess unto them, I never knew you: depart from Me, ye that work\niniquity.”\nThere are persons who believe that they are right, when they\nare wrong. While claiming Christ as their Lord, and professedly\ndoing great works in His name, they are workers of iniquity. “With\ntheir mouth they show much love, but their heart goeth after their\ncovetousness.” He who declares God’s word is to them “as a very\nlovely song of one that hath a pleasant voice, and can play well on an\ninstrument: for they hear Thy words, but they do them not.” Ezekiel\n33:31, 32.\nA mere profession of discipleship is of no value. The faith in\nChrist which saves the soul is not what it is represented to be by\nmany. “Believe, believe,” they say, “and you need not keep the law.”\nBut a belief that does not lead to obedience is presumption. The\napostle John says, “He that saith, I know Him, and keepeth not His\ncommandments, is a liar, and the truth is not in him.” 1 John 2:4.\nLet none cherish the idea that special providences or miraculous\nNot Judging, but Doing 109\nmanifestations are to be the proof of the genuineness of their work\nor of the ideas they advocate. When persons will speak lightly of\nthe word of God, and set their impressions, feelings, and exercises\nabove the divine standard, we may know that they have no light in\nthem.\nObedience is the test of discipleship. It is the keeping of the\ncommandments that proves the sincerity of our professions of love.\nWhen the doctrine we accept kills sin in the heart, purifies the soul\nfrom defilement, bears fruit unto holiness, we may know that it is\nthe truth of God. When benevolence, kindness, tenderheartedness, [147]\nsympathy, are manifest in our lives; when the joy of right doing is\nin our hearts; when we exalt Christ, and not self, we may know that\nour faith is of the right order. “Hereby we do know that we know\nHim, if we keep His commandments.” 1 John 2:3.\n“It fell not; for it was founded upon the rock.”—Matthew 7:25,",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "R.V .",
        "chunk_index": 0,
        "page_reference": "78-112",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110511"
      }
    },
    {
      "id": "thoughts_mount_blessing_000009",
      "text": "The people had been deeply moved by the words of Christ.\nThe divine beauty of the principles of truth attracted them; and\nChrist’s solemn warnings had come to them as the voice of the\nheart-searching God. His words had struck at the very root of their\nformer ideas and opinions; to obey His teaching would require a\nchange in all their habits of thought and action. It would bring them\ninto collision with their religious teachers; for it would involve the\noverthrow of the whole structure which for generations the rabbis had\nbeen rearing. Therefore, while the hearts of the people responded to\nHis words, few were ready to accept them as the guide of life.\nJesus ended His teaching on the mount with an illustration that\npresented with startling vividness the importance of putting in prac-\ntice the words He had spoken. Among the crowds that thronged\nabout the Saviour were many who had spent their lives about the Sea\nof Galilee. As they sat upon the hillside, listening to the words of\nChrist, they could see valleys and ravines through which the moun-\ntain streams found their way to the sea. In summer these streams\noften wholly disappeared, leaving only a dry and dusty channel. But [148]\nwhen the wintry storms burst upon the hills, the rivers became fierce,\nraging torrents, at times overspreading the valleys and bearing every-\n110 Thoughts from the Mount of Blessing\nthing away on their resistless flood. Often, then, the hovels reared\nby the peasants on the grassy plain, apparently beyond the reach of\ndanger, were swept away. But high upon the hills were houses built\nupon the rock. In some parts of the land were dwellings built wholly\nof rock, and many of them had withstood the tempests of a thousand\nyears. These houses were reared with toil and difficulty. They were\nnot easy of access, and their location appeared less inviting than the\ngrassy plain. But they were founded upon the rock, and wind and\nflood and tempest beat upon them in vain.\nLike the builders of these houses on the rock, said Jesus, is he\nwho shall receive the words that I have spoken to you, and make\nthem the foundation of his character and life. Centuries before, the\nprophet Isaiah had written, “The word of our God shall stand forever”\n(Isaiah 40:8); and Peter, long after the Sermon on the Mount was\ngiven, quoting these words of Isaiah added, “This is the word which\nby the gospel is preached unto you” (1 Peter 1:25). The word of God\nis the only steadfast thing our world knows. It is the sure foundation.\n“Heaven and earth shall pass away,” said Jesus, “but My words shall\nnot pass away.” Matthew 24:35.\nThe great principles of the law, of the very nature of God, are\nembodied in the words of Christ on the mount. Whoever builds\nupon them is building upon Christ, the Rock of Ages. In receiving[149]\nthe word, we receive Christ. And only those who thus receive His\nwords are building upon Him. “Other foundation can no man lay\nthan that is laid, which is Jesus Christ.” 1 Corinthians 3:11. “There\nis none other name under heaven, given among men, whereby we\nmust be saved.” Acts 4:12. Christ, the Word, the revelation of God,—\nthe manifestation of His character, His law, His love, His life,—is\nthe only foundation upon which we can build a character that will\nendure.\nWe build on Christ by obeying His word. It is not he who\nmerely enjoys righteousness, that is righteous, but he who does\nrighteousness. Holiness is not rapture; it is the result of surrendering\nall to God; it is doing the will of our heavenly Father. When the\nchildren of Israel were encamped on the borders of the Promised\nLand, it was not enough for them to have a knowledge of Canaan,\nor to sing the songs of Canaan. This alone would not bring them\ninto possession of the vineyards and olive groves of the goodly\nNot Judging, but Doing 111\nland. They could make it theirs in truth only by occupation, by\ncomplying with the conditions, by exercising living faith in God, by\nappropriating His promises to themselves, while they obeyed His\ninstruction.\nReligion consists in doing the words of Christ; not doing to\nearn God’s favor, but because, all undeserving, we have received\nthe gift of His love. Christ places the salvation of man, not upon\nprofession merely, but upon faith that is made manifest in works of\nrighteousness. Doing, not saying merely, is expected of the followers\nof Christ. It is through action that character is built. “As many as are\nled by the Spirit of God, they are the sons of God.” Romans 8:14. [150]\nNot those whose hearts are touched by the Spirit, not those who now\nand then yield to its power, but they that are led by the Spirit, are the\nsons of God.\nDo you desire to become a follower of Christ, yet know not how\nto begin? Are you in darkness and know not how to find the light?\nFollow the light you have. Set your heart to obey what you do know\nof the word of God. His power, His very life, dwells in His word.\nAs you receive the word in faith, it will give you power to obey. As\nyou give heed to the light you have, greater light will come. You are\nbuilding on God’s word, and your character will be builded after the\nsimilitude of the character of Christ.\nChrist, the true foundation, is a living stone; His life is imparted\nto all that are built upon Him. “Ye also, as living stones, are built\nup a spiritual house.” “Each several building, fitly framed together,\ngroweth into a holy temple in the Lord.” 1 Peter 2:5 , R.V .; Ephesians\n2:21 , R.V . The stones became one with the foundation; for a\ncommon life dwells in all. That building no tempest can overthrow;\nfor—\n“That which shares the life of God,\nWith Him surviveth all.”\nBut every building erected on other foundation than God’s word\nwill fall. He who, like the Jews in Christ’s day, builds on the foun-\ndation of human ideas and opinions, of forms and ceremonies of\nman’s invention, or on any works that he can do independently of\nthe grace of Christ, is erecting his structure of character upon the\n112 Thoughts from the Mount of Blessing\nshifting sand. The fierce tempests of temptation will sweep away[151]\nthe sandy foundation and leave his house a wreck on the shores of\ntime.\n“Therefore thus saith the Lord God, ... Judgment also will I lay\nto the line, and righteousness to the plummet: and the hail shall\nsweep away the refuge of lies, and the waters shall overflow the\nhiding place.” Isaiah 28:16, 17.\nBut today mercy pleads with the sinner. “As I live, saith the\nLord God, I have no pleasure in the death of the wicked; but that\nthe wicked turn from his way and live: turn ye, turn ye from your\nevil ways; for why will ye die?” Ezekiel 33:11. The voice that\nspeaks to the impenitent today is the voice of Him who in heart\nanguish exclaimed as He beheld the city of His love: “O Jerusalem,\nJerusalem, which killeth the prophets, and stoneth them that are sent\nunto her! how often would I have gathered thy children together,\neven as a hen gathereth her own brood under her wings, and ye would\nnot! Behold, your house is left unto you desolate.” Luke 13:34, 35\n, R.V . In Jerusalem, Jesus beheld a symbol of the world that had\nrejected and despised His grace. He was weeping, O stubborn\nheart, for you! Even when Jesus’ tears were shed upon the mount,\nJerusalem might yet have repented, and escaped her doom. For a\nlittle space the Gift of heaven still waited her acceptance. So, O\nheart, to you Christ is still speaking in accents of love: “Behold, I\nstand at the door, and knock: if any man hear My voice, and open the\ndoor, I will come in to him, and will sup with him, and he with Me.”\n“Now is the accepted time; behold, now is the day of salvation.”\nRevelation 3:20; 2 Corinthians 6:2.\nYou who are resting your hope on self are building on the sand.[152]\nBut it is not yet too late to escape the impending ruin. Before the\ntempest breaks, flee to the sure foundation. “Thus saith the Lord\nGod, Behold, I lay in Zion for a foundation a stone, a tried stone, a\nprecious cornerstone, of sure foundation: he that believeth shall not\nmake haste.” “Look unto Me, and be ye saved, all the ends of the\nearth: for I am God, and there is none else.” “Fear thou not; for I am\nwith thee: be not dismayed; for I am thy God: I will strengthen thee;\nyea, I will help thee; yea, I will uphold thee with the right hand of\nMy righteousness.” “Ye shall not be ashamed nor confounded world\nwithout end.” Isaiah 28:16, R.V .; 45:22; 41:10; 45:17.",
      "metadata": {
        "source_id": "thoughts_mount_blessing",
        "title": "Thoughts from the Mount of Blessing",
        "author": "Ellen G. White",
        "domain": "unknown",
        "section_title": "R. V .",
        "chunk_index": 0,
        "page_reference": "113-116",
        "chunk_strategy": "paragraph",
        "creation_timestamp": "2025-08-23T20:44:07.110518"
      }
    }
  ]
}